{
  "id": "admiralty-jurisdiction-act",
  "type": "statute",
  "title": "ADMIRALTY JURISDICTION ACT",
  "title_en": "ADMIRALTY JURISDICTION ACT",
  "short_name": "ADMIRALTY JURISDICTION ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=17",
  "provisions": [
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Application of jurisdiction to ships, etc.",
      "content": "Application of jurisdiction to ships, etc. Subject to the provisions of this Act, the admiralty jurisdiction of the Court shall apply to- all ships, irrespective of the places of residence or domicile of their owners; and (b) all maritime claims, wherever arising. 4. Aviation claims Any reference in this Act to a claim in respect of an aircraft includes a claim that can be made under any of the Conventions in force to which Nigeria is a party. 5 . Mode of exercise of admiralty jurisdiction (1) Subject to section 6 of this Act, an action in personam may be brought in the Court in all cases within the admiralty jurisdiction of the Court. (2) In the case of a claim as is mentioned in section 2 (2) (a) or section 2 (3) (u), or a question as is mentioned in section 2 (2) (b) of this Act, an action in rem may be brought in the Court against the ship or property in connection with which the claim or question arises. (3) In any case in which there is a maritime lien or other charge on any ship, aircraft or other property for the amount claimed, an action in rem may be brought in the Court against that ship, aircraft or property; and for the purpose of this subsection, \"maritime lien\" means a lien for- (a) salvage; or (b) damage done by a ship; or (c) wages of the master or of a member of the crew of a ship; or (d) master's disbursements. (4) In any other claim under section 2 of this Act, where the claim arises in connection with a ship and the person who would be liable on the claim in an action in personam (in this Act referred to as \"the relevant person\") was, when the cause of action arose, the owner or charterer of or in possession or in control of the ship, an action in rem may (whether or not the claim gives rise to a maritime lien on that ship) be brought against- (a) that ship, if at the time the action is brought the relevant person is either the beneficial owner of that ship in respect of all the shares in it or the charterer of the ship under a charter by demise; or (b) any other ship of which, at the time when the action is brought, the relevant person is the beneficial owner in respect of all the shares in the ship. (5) In the case of a claim in the nature of towage in respect of an aircraft, an action in rem may be brought in the Court against that aircraft if, at the time when the action is brought, it is beneficially owned by the person who would be liable on the claim in an action in personam. (6) Where, in the exercise of its admiralty jurisdiction, the Court orders any ship, aircraft or other property to be sold, the Court shall have jurisdiction to hear and determine any question arising as to the title to the proceeds of sale. (7) In determining, for the purposes of subsection (4) and (5) of this section, whether a person would be liable on a claim in an action in personam, it shall be assumed that the person has his habitual residence or place of business within Nigeria. (8) Where a ship has been served with a writ or arrested in an action in rem brought to enforce a claim, no other ship shall (subject to subsection (9) of this section) be served with a writ or arrested in that or any other action in rem brought to enforce that claim; but this subsection shall not prevent the issue, in respect of anyone such claim, of a writ naming more than one ship (for example where the claim relates to repairs to two or more ships in the same ownership) or of two or more writs each naming a different ship. (9) Where a ship has been arrested, no other ship shall be arrested in the proceeding unless the first-mentioned ship- (a) having been invalidly arrested, has been released from arrest; or (b) had been unlawfully removed from the custody of the Admiralty Marshal and the Admiralty Marshal has not regained custody of the ship. (10) Where a person has a claim that is both- (a) a claim on a maritime lien or other charge; and (b) a general maritime claim, in respect of a ship and has commenced proceedings against a sister ship, subsection (9) of this Act shall not prevent the arrest of the first-mentioned ship in a proceeding on the maritime lien or other charge if the amount recovered by the person in the proceeding is less than the amount of claim on the maritime lien or other charge. 6. Re-arrest (1) A ship or other property arrested in a proceeding on a maritime claim shall not be re-arrested in the proceeding in relation to the claim unless the Court so orders, because default has been made in the performance of a guarantee undertaking given to procure the release of the ship or property from the earlier arrest or for some other sufficient reason. (2) An order under subsection (1) of this section may be made subject to such conditions as the Court deems just in the circumstances."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Service and arrest within jurisdiction",
      "content": "Service and arrest within jurisdiction (1) A writ in a proceeding commenced as an action in rem in the Court may be served on a ship or other property. (2) A ship or other property may, in any proceeding under subsection (1) of this section, be arrested at any place within the limits of the territorial waters of Nigeria. 8. Proceeds of sale Where, but for the sale of a ship or other property under this Act, a proceeding could have been commenced as an action in rem against the ship or property, the proceeding may be commenced as an action in rem against the proceeds of sale that have been paid into a Court under this Act."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Limitation of liability proceedings",
      "content": "Limitation of liability proceedings (1) A person who apprehends that a claim for compensation under any law, including the Merchant Shipping Act, that gives effect to a Liability Convention may be made against him by some other person, may apply to the Court to determine the question whether the liability of the first-mentioned person in respect of the claim may be limited under that law. [Cap. M11.] (2) On an application under subsection (1) of this section, the Court may, in accordance with the law referred to in that subsection- (a) determine whether the applicant's liability may be so limited and, if so determined the limit of the liability; (b) order the constitution of a limitation fund for the payment of claims in respect of which the applicant is entitled to limit his liability; and (c) make such orders as are just with respect to the administration and distribution of that fund. (3) Where the Court has jurisdiction under this Act in respect of a proceeding, that jurisdiction shall extend to entertaining a defence in the proceeding by way of limitation of liability under a law that gives effect to the provisions of a Liability Convention. 10. Retention of security where proceedings are stayed or dismissed (1) Without prejudice to any other power of the Court- (a) where it appears to the Court in which a proceeding commenced under this Act is pending that the proceeding should be stayed or dismissed on the ground that the claim concerned should be determined by arbitration (whether in Nigeria or elsewhere) or by a court of a foreign country; and (b) where a ship or other property is under arrest in the proceeding, the Court may, order that the proceeding be stayed on condition that the arrest and detention of the ship or property shall stay or satisfactory security for their release be given as security for the satisfaction of any award or judgment that may be made in the arbitration or in a proceeding in the Court of the foreign country. (2) The power of the Court to stay or dismiss a proceeding commenced under this Act includes power to impose any condition as is just and reasonable in the circumstances, including a condition- (a) with respect to the institution or prosecution of the arbitration or proceeding in the court of a foreign country; and (b) that equivalent security be provided for the satisfaction of any award or judgment that may be made in the arbitration or in the proceeding in the court of a foreign country. (3) Where the Court has made an order under subsection (1) or (2) of this section, the Court may make such interim or supplementary orders as are appropriate in relation to the ship or other property for the purpose of preserving- (a) the ship or other property; or (b) the rights of a party or of a person interested in the ship or other property. (4) Where- (a) a ship or other property is under arrest in a proceeding; (b) an award or judgment as mentioned in subsection (1) of this section has been made in favour of a party; and (c) apart from this section, the award or judgment is enforceable in Nigeria, then in addition to any other proceeding that may be taken by the party to enforce the award or judgment, the party may apply to the Court in the stayed proceeding for an appropriate order in relation to the ship or property to give effect to the award or judgment. 11. Liability not limited to value of ship or property Where judgment is given for the plaintiff in any proceeding on a maritime claim commenced as an action in rem against a ship or other property, the extent to which a defendant in the proceeding, who has entered an appearance and is a relevant person in relation to the claim, is personally liable to the judgment shall not be limited by the value of the ship or other property. 12. Ownership disputes In a proceeding on a maritime claim between co-owners of a ship relating to possession, ownership, operations or earnings of the ship, the orders that the Court may make shall include- (a) an order for the settlement of accounts outstanding and unsettled; (b) an order directing that the ship or a share in the ship be sold; and (c) an order relating to entries in and deletions from the Registry of Ships. 13. Damages for wrongful arrest (1) Where, in relation to a proceeding commenced under this Act- (a) a party unreasonably and without good cause- (i) demands excessive security in relation to the proceeding; or (ii) obtains the arrest of a ship or other property under this Act; or (b) a party or other person unreasonably and without good cause fails to give a consent required under this Act for the release from arrest of a ship or other property, the party or person shall be liable in damages to a party to the proceeding, being a party or person who has suffered loss or damage as a direct result. (2) The jurisdiction of the Court shall extend to determining summarily, in relation to the proceeding, a claim arising under subsection (1) of this section. 14. Priorities: general maritime claims Notwithstanding the provisions of any other law, where- (a) a proceeding in respect of a general maritime claim concerning a ship has been commenced under this Act against a sister ship; or (b) in relation to a proceeding commenced under this Act concerning a ship, a sister ship has been arrested, the order in which general maritime claims against both ships shall be paid out of the proceeds of the sale of a sister ship shall be determined, as if all the claims were general maritime claims against the sister ship. 15. Statutory powers of detention (1) Where a law, other than this Act, confers on a person a power to detain a ship- (a) if the ship is under arrest under this Act, the power to detain the ship shall not be exercised; (b) the exercise of the power to detain the ship shall not prevent the arrest of the ship under this Act. (2) If a ship that has been detained under such a power as is mentioned in subsection (1) of this section, is arrested under this Act, then, by force of this subsection the detention shall be suspended for so long as the ship is under arrest. (3) If a ship that has been detained pursuant to a civil claim or would, but for paragraph (a) of subsection (1) of this section, be liable to be detained under such a power, is arrested and sold under this Act, then, the civil claim shall, unless the Court otherwise directs, be payable in priority to any claim against the ship other than the claim of the Admiralty Marshal for expenses. 16. Liability for principal and agent (1) The charterer, manager, operator or master of any ship in a Nigerian port or territorial waterways who authorises an agent to act for the ship, in relation to any purpose for which the ship is in Nigeria, shall be liable for any act, declaration, default, omission or commission of his agent in carrying out his agency. (2) If the owner, charterer, manager, operator or master of any ship entering or coming into Nigeria requests the services of an agent in Nigeria, such request shall be notified in writing to the ports authorities before or on the arrival of the ship, and the authorisation shall only cease if no suit is brought against the ship within the limitation period. (3) A person who acts as an agent of the owner, charterer, manager or operator of a ship may be personally liable, irrespective of the liability of his principal, for the act, default, omission or commission of the ship in respect of anything done or failed to be done in Nigeria. (4) A person who does anything or carries out any duty under the provisions of this Act or under the provisions of any law in force in Nigeria in respect of any ship in the territorial waters of Nigeria shall by doing that thing or carrying out that duty constitute himself the agent of the ship. 17. Currency clause (1) The Court shall have the power to give judgment in any monetary currency (accepted as legal tender by the laws of any other country) in which any of the parties has suffered loss "
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Appearance",
      "content": "Appearance (1) No formal appearance need be filed but a return date shall be fixed by the Court not more than 21 days after the issue of a writ, on which date any party served with the writ shall appear in court or be represented by Counsel. (2) Where the writ is served simultaneously with an order for the arrest of any ship or property, an interested person may apply for the release of the arrested ship or property and the Court shall, within 3 days of the filing and serving of the application for release of the ship or property, entertain the said application. (3) An application for the release of the arrested ship or property shall be heard by the judge who ordered the arrest or, in his absence, by another judge. ORDER III Preliminary acts 1. Filing of preliminary acts In an action to enforce a claim for damages arising from loss of a ship or damage done to or by a ship following a collision between two or more ships, each party shall file a preliminary act, unless the Court otherwise orders. 2. Contents of preliminary acts The preliminary act shall contain the following particulars- (a) the names of the ships which came into collision and their ports of registry; (b) the date and time of the collision; (c) the place of the collision; (d) the direction and force of the wind; (e) the state of the weather; (f) the state, direction and force of the tidal or other current; (g) the course steered and speed through the water of the ship when the other ship was first seen or immediately before any measure was taken with reference to her presence whichever was the earlier; (h) what light or combination of lights (if any) of the other ship was first seen; (i) the distance and bearing of the other ship if and when her echo was first observed by radar; (j) the distance, bearing and approximate heading of the other ship when first seen; (k) what other lights or combination of lights (if any) of the other ship were subsequently seen before the collision and when; (l) what alternations (if any) were made to the course and speed of the ship after the earlier of the two times referred to in sub-paragraph (k) of this rule up to the time of the collision any other than alteration, and when, and what measures (if any) other than alternation of course or speed, were taken to avoid the collision, and when; (m) the heading of the ship, the parts of each ship which first came into contact and the approximate angle between the two ship at the moment of contact; (n) what sound signals (if any) were given, and when; (o) what sound signals (if any) were heard from the other ship, and when. 3. Time for filing of preliminary acts The Plaintiff shall file his preliminary act within 7 days after the commencement of the proceeding and the other parties shall tile their preliminary acts before filing any pleading. 4. Preliminary acts to be sealed A preliminary act shall be filed in a closed envelope that has been sealed with the seal of the Court and bears the date of filing."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Default in filing",
      "content": "Default in filing (1) Where the Plaintiff fails to file a preliminary act, the Court may, on an application, dismiss the proceeding or make such order on such terms as it thinks just. (2) Where a defendant fails to file a preliminary act, the Plaintiff may take the same steps in the proceeding as may be taken in relation to a defendant who has failed to file a defence. (3) Improving his case in pursuance to paragraph (2) of this rule, the Plaintiff's evidence may, unless the Court otherwise orders, be given by affidavit. 6. Opening of preliminary acts The Court may at the stage of the proceeding after pleadings have been closed, on application or of its own motion, order that the Registrar open the envelopes containing the preliminary acts and may make such further order or orders as are appropriate. ORDER IV Parties 1. Actions in rem The writ in a proceeding commenced as an action in rem shall specify a relevant per-son in relation to the maritime claim concerned as a defendant and shall be in Form B in the Schedule to these Rules. 2. Action against a ship or other property The writ in a proceeding commenced as an action in rem against a ship or other property shall identify the ship or property. Sister ships (1) Where the action is commenced against a sister ship, the ship in relation to which it is a sister ship shall also be identified in the initiating process. (2) A writ may identify more than one ship as a sister ship. 4. Amendment (1) The powers of the Court in relation to amendment of process and joinder of parties shall extend to- (a) making an order, on such terms as are just; (b) substituting for a defendant identified in rule 2 of this Order some other person; and (c) substituting for a ship some other ship. (2) Where the writ in a proceeding is amended by substituting for a ship some other ship, the proceeding shall be taken to have been commenced against the other ship at the time specified in the order or, if no time is specified, at the time when the order was made. ORDER V Service of Process"
    },
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Service on ships or other property on a ship",
      "content": "Service on ships or other property on a ship The writ in a proceeding commenced as an action in rem against a ship or other property that is at the time of service on board a ship, shall be served by securely affixing a sealed copy of the process to a mast or some other conspicuous part of the ship, or delivering the same to the master of the ship."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Service on property not on ship",
      "content": "Service on property not on ship The writ in a proceeding commenced as an action in rem against any property that is not, at the time of service, on board a ship, shall be served by securely affixing a sealed copy of the process to the property or to a package or container containing the property. Service where access impossible If access to the ship or property cannot reasonably be obtained, the process may be served on the ship or property by-"
    }
  ],
  "definitions": []
}