{
  "id": "african-charter-on-human-and-peoples-rights-ratification-and-enforcement-act",
  "type": "statute",
  "title": "AFRICAN CHARTER ON HUMAN AND PEOPLES' RIGHTS (RATIFICATION AND ENFORCEMENT) ACT",
  "title_en": "AFRICAN CHARTER ON HUMAN AND PEOPLES' RIGHTS (RATIFICATION AND ENFORCEMENT) ACT",
  "short_name": "AFRICAN CHARTER ON HUMAN AND PEOPLES'",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=24",
  "provisions": [
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "",
      "content": "s 2 of the said Charter to eradicate all forms of colonialism from Africa, to co-ordinate and intensify their co-operation and efforts to achieve a better life for the peoples of Africa and to promote international co-operation having due regards to the Charter of the United Nations and the Universal Declaration of Human Rights; Taking into consideration the virtues of their historical tradition and the values of African civilisation which should inspire and characterise their reflection on the concept of human and peoples' rights; Recognising on the one hand, that fundamental human rights stem from the attributes of human beings, which justifies their international protection and on the other hand that the reality and respect of peoples' rights should necessarily guarantee human rights; Considering that the enjoyment of rights and freedoms also inspires the performance of duties on the part of everyone; Convinced that it is henceforth essential to pay particular attention to the right to development and that civil and political rights cannot be dissociated from economic, social and cultural rights in their conception as well as universality and that the satisfaction of economic, social and cultural rights is a guarantee for the enjoyment of civil and political rights; Conscious of their duty to achieve the total liberation of Africa, the peoples of which are still struggling for their dignity and genuine independence, and undertaking to eliminate colonialism, neo-colonialism, apartheid, Zionism and to dismantle aggressive foreign military bases and all forms of discrimination, particularly those based on race, ethnic group, colour, sex, language, religion or political opinion; Reaffirming their adherence to the principles of human and peoples' rights and freedoms contained in the declarations, conventions and other instruments adopted by the Organisation of African Unity, the Movement of Non-Aligned Countries and the United Nations; Firmly Convinced of their duty to promote and protect human and peoples' rights and freedom taking into account the importance traditionally attached to these rights and freedoms in Africa; Have agreed as follows: PART I Rights and Duties CHAPTER I Human and Peoples' Rights Article 1 The Member States of the Organisation of African Unity parties to the present Charter shall recognise the rights, duties and freedoms enshrined in this Charter and shall undertake to adopt legislative or other measures to give effect to them. Article 2 Every individual shall be entitled to the enjoyment of the rights and freedoms recognised and guaranteed in the present Charter without distinction of any kind such as race, ethnic group, colour, sex, language, religion, political or any other opinion, national and social origin, fortune, birth or other status. Article 3 Every individual shall be equal before the law. Every individual shall be entitled to equal protection of the law. Article 4 Human beings are inviolable. Every human being shall be entitled to respect for his life and the integrity of his person. No one may be arbitrarily deprived of this right. Article 5 Every individual shall have the right to the respect of the dignity inherent in a human being and to the recognition of his legal status. All forms of exploitation and degradation of man particularly slavery, slave trade, torture, cruel, inhuman or degrading punishment and treatment shall be prohibited. Article 6 Every individual shall have the right to liberty and to the security of his person. No one may be deprived of his freedom except for reasons and conditions previously laid down by law. In particular no one may be arbitrarily arrested or detained. Article 7 1 . Every individual shall have the right to have his cause heard. This comprises: (a) the right to an appeal to competent national organs against acts of violating his fundamental rights as recognised and guaranteed by conventions, laws, regulations and customs in force; (b) the right to be presumed innocent until proved guilty by a competent court or tribunal; (c) the right to defence, including the right to be defended by counsel of his choice; (d) the right to be tried within a reasonable time by an impartial court or tribunal. 2 . No one may be condemned for an act or omission which did not constitute a legally punishable offence at the time it was committed. No penalty may be inflicted for an offence for which no provision was made at the time it was committed. Punishment is personal and can be imposed only on the offender. Article 8 Freedom of conscience, the profession and free practice of religion shall be guaranteed. No one may, subject to law and order, be submitted to measures restricting the exercise of these freedoms. Article 9 Every individual shall have the right to receive information. Every individual shall have the right to express and disseminate his opinions within the law. Article 10 Every individual shall have the right to free association provided that he abides by the law. Subject to the obligation of solidarity provided for in Article 29, no one may be compelled to join an association. Article 11 Every individual shall have the right to assemble freely with others. The exercise of this right shall be subject only to necessary restriction provided for by law, in particular those enacted in the interest of national security, the safety, health, ethics, rights and freedom of others. Article 12 1 . Every individual shall have the right to freedom of movement and residence within the borders of a State provided he abides by the law. 2 . Every individual shall have the right to leave any country including his own, and to return to his country. This right may only be subject to restrictions provided for by law for the protection of national security, law and order, public health or morality. 3 . Every individual shall have the light, when persecuted, to seek and obtain asylum in other countries in accordance with the laws of those countries and international conventions. 4. A non-national legally admitted in a territory of a State Party to the present Charter, may only be expelled from it by virtue of a decision taken in accordance with the law. 5 . The mass expulsion of non-nationals shall be prohibited. Mass expulsion shall be that which is aimed at national, racial, ethnic or religious groups. Article 13 Every citizen shall have the right to participate freely in the government of his country, either directly or through freely chosen representatives in accordance with provisions of the law. Every citizen shall have the right of equal access to the public services of his country. Every individual shall have the right of access to public property and services in strict equality of all persons before the law. Article 14 The right to property shall be guaranteed: It may only be encroached upon in the interest of public need or in the general interest of the community and in accordance with the provisions of appropriate laws. Article 15 Every individual shall have the right to work under equitable and satisfactory conditions and shall receive equal pay for equal work. Article 16 1 . Every individual shall have the right to enjoy the best attainable state of physical and mental health. 2 . State Parties to the present Charter shall take the necessary measures to protect the health of their people and to ensure that they receive medical attention when they are sick. Article 17 Every individual shall have the right to education. Every individual may freely, take part in the cultural life of his community. The promotion and protection of morals and traditional values recognised by the community shall be the duty of the State. Article 18 1 . The family shall be the natural unit and basis of society. It shall be protected by the State which shall take care of its physical health and morals. 2 . The State shall have the duty to assist the family which is the custodian of morals and traditional values re"
    }
  ],
  "definitions": []
}