{
  "id": "agricultural-credit-guarantee-scheme-fund-act",
  "type": "statute",
  "title": "AGRICULTURAL CREDIT GUARANTEE SCHEME FUND ACT",
  "title_en": "AGRICULTURAL CREDIT GUARANTEE SCHEME FUND ACT",
  "short_name": "AGRICULTURAL CREDIT GUARANTEE SCHEME",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=26",
  "provisions": [
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "",
      "content": "section 4 or this Act, be managed by a body to be known as the Agricultural Credit Guarantee Scheme Fund Board (in this Act referred to as \"the Board\") which shall be a body corporate with perpetual succession and a common seal and may sue and be sued in its corporate name. (2) The Board shall comprise- (a) four persons appointed by the Minister, one or whom shall be designated chairman; (b) two representatives of the Central Bank; and (c) one representative of the Bankers Committee. (3) The quorum for meetings of the Board shall be four of whom at least one shall be a representative of the Central Bank. (4) The Board shall meet not less than four times in each year and on such other occasions as the Board may consider necessary. (5) At any meeting of the Board the Chairman shall preside; but if he is absent, the members present at the meeting shall appoint one of their numbers to preside at that meeting. (6) Subject to"
    },
    {
      "provision_ref": "s27",
      "section": "27",
      "title": "",
      "content": "section 27 of the Interpretation Act (which provides for decisions of a statutory body to be taken by a majority of its members and for the person presiding to have a casting vote), the Board may make standing orders regulating its proceedings or any sub-committee thereof. [Cap. 123] (7) Where the Board desires to obtain the advice of any person on a particular matter, the Board may co-opt him as a member for such period as it thinks fit; but a person who is a member by virtue of this subsection shall not be entitled to vote at any meeting of the Board and shall not count towards a quorum. (8) There shall be a secretary to the Board who shall be an official of the Central Bank designated as such and the secretariat of the Board shall be located in the Central Bank. (9) The administrative expenses of the Board shall be borne by the Federal Government. 3. Functions of the Board, etc. (1) Notwithstanding any other provisions of this Act, the functions of the Board shall include the general power of- (a) monitor the operation and evaluate the progress of the Scheme; (b) advise the Minister as to changes required to improve the operation of the Fund; (c) receive and consider the report of the management agent of the Fund and advise the Minister thereon; (d) determine the remuneration of external auditors and solicitors; (e) perform such other duties relating to the Fund as may be referred to it by the Minister; (f) publish names of defaulters of loans granted under this Act in the national newspapers; (g) approve the operational budget of the Fund; and (h) solicit the assistance of government loan machineries in the recovery of loans granted under this Act. (2) The Minister may give the Board directions of a general character or relating generally to particular matters with regard to the exercise by the Board of its functions under this Act and it shall be the duty of the Board to comply with such directions. 4. Appointment of managing agent (1) The Minister may appoint for such period as he may deem fit any person (whether corporate or unincorporate) as the managing agent for the administration of the Fund and any person so appointed shall act in accordance with any general or special directions as may, from time to time, be given by the Board. (2) The Central Bank shall he deemed to have been appointed as the managing agent for the purposes of subsection (1) of this section and the appointment shall have effect for such period as the Minister may direct. (3) Any person appointed as the managing agent pursuant to this section shall be remunerated from moneys provided for that purpose by the Federal Government upon such terms as the Board may, with the approval of the Minister, determine. Financial Provisions 5. Amount to be paid into the Fund The Fund shall consist of the sum of one hundred million naira which shall be paid as soon as may be after the establishment of the Fund and shall be contributed- (a) as to sixty per cent, by the Federal Government; and (b) as to forty per cent, by the Central Bank. 6. Limits of liability of the Fund in respect of guarantees (1) The maximum liability of the Fund in respect of any guarantee given pursuant to this Act shall not exceed seventy-five per cent of the specified loan, being- (a) in the case of a loan granted to any individual, any sum up to but not exceeding N100,000.00; and (b) in the case of a loan granted to a co-operative society or a corporate body, any sum up to but not exceeding N1,000,000.00. (2) For the purposes of this section, loan means the principal loan and the interest thereon. 7. Applications for loans and for guarantees, etc. (1) Applications for guarantees under this Act shall be made to the Board by the hank concerned following a request for a loan made to that bank and such applications shall be in such form as the Minister may prescribe. (2) Where for any reason any request for a loan for the purposes of this Act is rejected by any bank, the bank shall give reasons therefore to the person making the request and shall specify what steps should be taken by the person to enable him to comply with the bank's requirements. 8. Form and terms of loan agreement Every agreement for a loan in respect of which a guarantee is to be given under this Act shall be in such form and upon such terms and conditions as the Minister may approve. 9. Rate of interest The rate of interest payable on a loan granted pursuant to this Act shall be as may be directed by the Minister. 10. Forms of security (1) Security required by a bank for the purpose of any loan under this Act may be one or more of the following that is to say- (a) a charge on land in which the borrower holds a legal interest or a right to farm, or a charge on the crops on such land; (b) a charge on the movable property of the borrower; (c) a life assurance policy, a promissory note or other negotiable security; (d) stocks and shares; (e) a personal guarantee; (f) any other security acceptable to the bank; (2) The requirement of security for a loan specified under the provisions of subsection (1) of this section may be waived in the case of a loan of the sum of N5,000.00 or below granted to a small scale farmer. 11. Safeguard in respect of certain loans Where a loan or any portion thereof, in respect or which a guarantee is to be given under this Act, is to be applied to the purchase of livestock, machinery or farming equipment, the loan or portion thereof, as the case may be, shall not be paid to the borrower but shall instead be paid by the bank directly to the supplier who shall furnish the bank with a copy of the delivery note or other document in evidence of the delivery of the livestock, machinery or farming equipment to the borrower. 12. Recovery of outstanding loan, etc. (1) Where there has been a default in the repayment of the interest or principal of any loan guaranteed under this Act, the bank concerned shall in the first instance endeavour to recover the amount outstanding from the borrower or his sureties, if any, and may for that purpose dispose of any security obtained in respect of the loan. (2) Where any part of the interest or principal remains outstanding after the steps specified in subsection (1) of this section have been taken, or where the recovery of any amount outstanding is impracticable, the bank may apply, in the prescribed form, to the Board for payment and the Board shall, in accordance with the terms of the guarantee, settle the claim. 13. Loans to be applied for purposes for which made, and offences (1) No loan granted pursuant to this Act shall be applied to any purpose other than that for which the loan was granted. (2) Any person who applies any loan granted pursuant to this Act in contravention of subsection (1) of this section shall be guilty of an offence and shall be liable on conviction to a fine of an amount not less than the amount of the loan in respect of which the offence was committed or to imprisonment for not less than five years. (3) Where an offence under this section committed by a body corporate is proved to have been committed with the consent or connivance of, or to be attributable to any neglect on the part of any director, manager, secretary or other similar officer of the body corporate (or any person purporting to act in any such capacity) he as well as the body corporate shall be deemed to be guilty of the offence and may be proceeded against and punished accordingly. Miscellaneous and Supplementary 14. Rules and publication thereof (1 ) The Minister may make rules with respect to any of the following matters, that is to say- (a) form of application for loans and for guarantee of loans under this Act; (b) terms, conditions, rates of interest, fees or administrative charges in respect of loans; (c) form of application for repayment of outstanding loans under any guarantee and other matters connected therewith; (d) any other matter that may be incidental or supplemental to any of the abo"
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "",
      "content": "section 16 of this Act; (ii) the agricultural purposes set out in the Schedule to this Act; [Schedule.] (iii) the maximum liability of the Fund in respect of guarantees; (iv) the amount of unsecured loans that may be granted to a small scale farmer; (v) the amount of loans guaranteed to individuals and corporate bodies; and (b) to require a farmer, who receives a loan under this Act for insurable crops, to take an agricultural insurance. 22. Interpretation In this Act, unless the context otherwise requires- \"Bank\" has the same meaning as in the Bank and Other Financial Institutions Act; [Cap. B3.] \"Board\" means the Agricultural Credit Guarantee Scheme Fund Board established by"
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "",
      "content": "section 2 of this Act; \"Central Bank\" means the Central Bank of Nigeria established by the Central Bank of Nigeria Act; [Cap. C4.] \"Fund\" means the Agricultural Credit Guarantee Scheme Fund established by"
    },
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "",
      "content": "section 1 of this Act; \"Lending bank\" means a bank concerned with the granting of loans under this Act; [1993 No. 32.] \"Loan\" includes advances, overdrafts and any credit facility; \"Minister\" means the Minister charged with responsibility for Finance. 23. Short title This Act may be cited as the Agricultural Credit Guarantee Scheme Fund Act. SCHEDULE [Section 1 (3).] Agricultural purposes 1. Any purpose connected with- (a) the establishment or management of plantations for the production of rubber, oil palm, cocoa, coffee and similar crops; (b) the cultivation or production of cereal crops, tubers, fruits of all kinds, cotton, beans, groundnuts, sheanuts, beniseed, vegetables, pineapples, bananas and plantains; (c) livestock production including cattle ranching, piggery, poultry, and fish culture, fish captures and storage; (d) farm machinery and hire services. 2 . Notwithstanding the provisions of sub-paragraphs (a), (b) and (c) of paragraph 1 of this Schedule, agricultural purposes shall include integrated agricultural projects, incorporating production and processing, provided that the primary production element accounts for not less than forty per cent of the raw material required by the factory. SUBSIDIARY LEGISLATION No Subsidiary Legislation"
    }
  ],
  "definitions": []
}