{
  "id": "ahmadu-bello-university-transitional-provisions-act",
  "type": "statute",
  "title": "AHMADU BELLO UNIVERSITY (TRANSITIONAL PROVISIONS) ACT",
  "title_en": "AHMADU BELLO UNIVERSITY (TRANSITIONAL PROVISIONS) ACT",
  "short_name": "AHMADU BELLO UNIVERSITY (TRANSITIONAL",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=28",
  "provisions": [
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Establishment of Provisional Council for the University",
      "content": "Establishment of Provisional Council for the University (Omitted; see 1993 No. 11). 3. Powers of the Provisional Council (Omitted; see 1993 No.11)."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Power to amend the principal Law",
      "content": "Power to amend the principal Law The President may by order amend any provision of the principal Law."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Modification of provisions of the principal Law, etc.",
      "content": "Modification of provisions of the principal Law, etc. (1) Until other provisions are made in that behalf by the Federal Government- (a) all references in the principal Law to the Visitor shall be construed as references to the President; and (b) the power to appoint the Vice-Chancellor of the University shall vest in the President. (2) All the provisions of the principal Law shall be construed subject to this Act. Interpretation (1) In this Act, unless the context otherwise requires- \"Council\" means the Council of the Ahmadu Bello University dissolved by this Act; \"functions\" includes powers and duties; \"President\" means the President of the Federal Republic of Nigeria; \"principal Law\" means the Ahmadu Bello University Law, as amended; \"University\" means the Ahmadu Bello University."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Short title",
      "content": "7. Short title This Act may be cited as the Ahmadu Bello University (Transitional Provisions) Act. AHMADU BELLO UNIVERSITY LAW ARRANGEMENT OF SECTIONS PART I Preliminary SECTION 1. Short title. 2. Interpretation. PART II Incorporation and Objects of the University Incorporation of Ahmadu Bello University. Objects of the University. Powers of the University. Membership of the University to be free. The Visitor. PART III Authorities of the University SECTION The Authorities. The Chancellor. Functions of the Chancellor. The Pro-Chancellors. Composition of the Council. Powers of the Council. Council's Power of Delegation. The Chairman of the Council. The Senate and its composition. Functions of the Senate. Congregation and its functions. PART IV Faculties and Faculty Boards Faculties. Faculty Boards and their functions. Composition of Faculty Boards. PART V Institutes, Colleges and Units within the University Institutes. Constitution, etc., of the Institutes. Constitution of colleges. Other units within the University. PART VI Legislative Powers of Authorities and Interpretation of Legislation The Statutes and their scope. First Statutes and their effect. Method of enactment of Statutes. Proof of Statutes in court. Acts. Regulations. Effect of Acts and Regulations. Settlement of disputes. PART VII Matters of Administration 34. Superannuation of staff. Retiring age of academic staff of the University. Special provisions relating to pensions of professors. Common seal of the University. Parol contracts. Bank accounts. Acquisition of land for purposes of the University. Non-application of section 20 of Cap. 52 of Laws of Northern Nigeria. Repeal of N.N. 24 of 1961. Transitional provisions. Power to amend this Law by order. SCHEDULES FIRST SCHEDULE The Statutes SECOND SCHEDULE Transitional Provisions A Law to establish a University in Northern Nigeria and to provide for the governance thereof and matters incidental thereto. [Commencement.] [4th October, 1962] PART I Preliminary"
    },
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. Short title This Law may be cited as the Ahmadu Bello University Law. Interpretation In this Law, unless the context otherwise requires- \"the academic staff&rdquo; means those members of the staff whose sole or primary duty as such members is teaching or research; \"the administrative staff&rdquo; means those members of the staff who are not members of the academic staff; \"the appointed day\" means the date on which this Law shall come into operation; \"the authorities\" means the authorities of the University as prescribed in section 8; \"the chairman\" means the Chairman of the Council; \"the Council\" means the Council of the University established by section 12 of this Law; \"Faculty\" means a Faculty of the University; \"the members of the University\" means those persons or office-holders described in Statute 2; \"the officers of the University\" means those persons or office-holders described in Statute 3; \"Acts\" means the Acts of the University; \"Regulations\" means Regulations made by the Senate under the provisions of section 32; \"the Statutes\" means the Statutes of the University set out in the First Schedule and any other Statutes made in pursuance of this Law; \"the University\" means the Ahmadu Bello University. PART II Incorporation and Objects of the University"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Incorporation of Ahmadu Bello University",
      "content": "Incorporation of Ahmadu Bello University There shall be in Northern Nigeria a university to be known as the Ahmadu Bello University the authorities of which are hereby constituted a body corporate which shall have perpetual succession and a common seal and may sue and be sued in the name of the said University. Objects of the University The objects of the University shall be- (a) to provide regular and liberal course of instruction in the humanities, the sciences and other spheres of learning of a standard required and expected of a university of the highest standing; (b) to promote research and the advancement of science and learning; (c) to secure the diffusion of knowledge throughout Northern Nigeria; (d) to acquire and take over the property; rights, trusts and liabilities of the Provisional Council established by the University of Northern Nigeria (Provisional Council) Law, 1961, including all the property of the Nigerian College of Arts, Science and Technology vested in the Provisional Council by the provisions of the Nigerian College of Arts, Science and Technology (Transfer) Act, 1962. Powers of the University For carrying out the objects specified in section 4, the University shall have power- (a) to institute professorships, readerships, lectureship, and other posts and offices and to make appointments thereto; (b) to institute and award fellowships, scholarships, exhibitions, bursaries, medals, prizes and other titles, distinctions, awards and forms of assistance; (c) to provide for the residence, discipline and welfare of members of the University; (d) to hold examinations and grant degrees, diplomas, certificates and other distinctions to persons who have pursued a course of study approved by the University and have satisfied such other requirements as the University may lay down; (e) to arrange for the education and welfare of children of members of the staff; (f) to demand and receive from any student or any other person attending the University for the purpose of instruction such fees as the Council may from time to time determine; (g) to acquire, hold, grant, charge or otherwise deal with or dispose of movable and immovable property wherever situate; (h) to accept gifts, legacies and donations, but without obligation to accept the same for a particular purpose unless it approves the terms and conditions attaching thereto; (i) to enter into contracts, establish trusts, act as trustees, solely or jointly with any other person, and employ and act through agents; (j) to erect, provide, equip and maintain libraries, laboratories, lecture halls, halls of residence, refectories, sports grounds, playing fields and other buildings or things (whether in Nigeria or elsewhere) necessary or suitable or convenient for any of the objects aforesaid; (k) subject to any limitations or conditions imposed by the Statutes to invest any moneys appertaining to the University by way of endowment and whether for general or special purposes, and such other moneys as may not be immediately required for current expenditure, in any investments or securities or in the purchase or improvement of land, with power from time to time to vary any such investments and to deposit any moneys for the time being uninvested with any bank on deposit or current account; (l) to borrow, whether at interest or not and if need be upon the security of any or all the property movable or immovable of the University, such moneys as the Council may from time to time in its discretion find it necessary or expedient to borrow; (m) to make gifts for any charitable purpose; (n) to do anything which it is authorised or required by the Statutes to do; (o) to make rules not inconsistent with the provisions of this Law or the Statutes, for regulating the administration of the University; (p) to do all such acts or things, whether or not incidental to the foregoing powers, as may advance the objects of the University; (q) to exercise such other functions as are set out in this Law and the Statutes."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Membership of the University to be free",
      "content": "Membership of the University to be free Membership of the University shall be open to persons of either sex and no discrimination shall be made or test imposed on the ground of religious belief, political views, racial or tribal origin, place of birth or residence. 7. The Visitor (1) The President shall be the Visitor of the University and he may, in addition to the powers conferred upon him by other provisions of this Law, from time to time and in such manner as he thinks fit, direct a visitation to the University for the purpose of ensuring the effective fulfilment of its objects as set out in this Law. [1971 No. 26. 1975 No. 22.] (2) In the exercise of all powers conferred upon the Visitor by this Law, the Visitor shall act in his sole and absolute discretion. PART III Authorities of the University"
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "The authorities",
      "content": "8. The authorities The authorities of the University shall be the Officers, the Council, the Senate and the Faculties of the University and such other bodies as may be prescribed by Statute."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "The Chancellor",
      "content": "The Chancellor (1) The Chancellor shall be the Head of the University and shall be appointed by the Visitor on the recommendation of the Council. [1971 No.26. 1975 No.22.] (2) The Chancellor shall hold office for five years from the date of his appointment or until his resignation, whichever be the shorter, and shall be eligible for reappointment."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Functions of the Chancellor",
      "content": "10. Functions of the Chancellor The Chancellor when present shall preside at the ceremonial and other assemblies of the University, and in addition to his other functions provided for in this Law, shall be entitled to call for information in regard to any matter relating to the welfare of the University from the Vice-Chancellor and the Chairman of the Council whose duty it shall be to provide the same."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "The Pro-Chancellors",
      "content": "11. The Pro-Chancellors (Omitted; see 1993 No. 11). [1993 No.11]"
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Composition of the Council",
      "content": "12. Composition of the Council The Council of the University shall consist of- the Pro-Chancellor; [1996 No.25.] (b) the Vice-Chancellor; (c) the Deputy Vice-Chancellors; (d) one person from the Ministry responsible for Education; (e) nine persons representing a variety of interests and broadly representative of the whole Federation to be appointed by the President; (f) four persons appointed by the Senate from among its members; (g) two persons appointed by the Congregation from among its members; (h) one person appointed by Convocation from among its members."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Powers of the Council",
      "content": "13. Powers of the Council (1) Subject to subsection (2) of this section, the Council shall exercise such functions, apart from those specified in section 14 of this Law, as are expressly conferred on the Council by this Law. [1971 No.26.] (2) Except with the prior approval of the President, the Council shall not exercise any of the powers conferred by- (a) section 14 of this Law (which relates to power to delegate functions of the Council); and (b) section 31 of this Law (which relates to the making of Statutes regulating the University). (3) Without derogation from the generality of the powers conferred upon the Council by subsections (1) and (2), it is hereby declared that the Council shall have the following powers- (a) to participate in the making, amendment or revocation of the Statutes of the University in accordance with the provisions of section 29; (b) to make Acts for any purposes for which Acts are or may be authorised to be made in accordance with the provisions of section 31; (c) to govern, manage, and regulate the finances, accounts, investments, property, business and all affairs whatsoever of the University, and for that purpose to appoint bankers and any other officers or agents whom it seems expedient to appoint and to cause proper books of account to be kept for all sums of money received and expended by the University and for the assets and liabilities of the University so that such books give a true and fair view of the state of the affairs of the University and explain its transactions; (d) to borrow money on behalf of the University; (e) to invest any money belonging to the University; (f) to sell, buy, exchange, lease or accept leases of any real or personal property on behalf of the University; (g) to provide the buildings, libraries, laboratories, premises, furniture, apparatus and other equipment needed for carrying on the work of the University; (h) to enter into, vary, perform and cancel contracts on behalf of the University; (i) to affiliate other institutions or branches or departments thereof and to recognise selected members thereof as teachers of the University and to admit the members thereof to any of the privileges of the University and to accept attendance at courses of study in such institutions, branches or departments thereof in place of such part attendance at courses of study in the University and upon such terms and conditions and subject to such regulations as may from time to time be determined by the University; (j) to enter into agreements for the incorporation in the University of any other institution and for the taking over its rights, property and liabilities and for any other purpose not repugnant to this Law; (k) save as otherwise provided, to appoint all members of the academic staff, the Registrar and the librarian, on the recommendation of the appropriate Appointment and Promotion Committee on such terms and conditions as the Council may determine; (l) to appoint all members of the staff other than those for whom a specific method of appointment is otherwise provided; (m) to appoint external examiners on the recommendations of the Senate in accordance with the proviso to paragraph (a) of subsection (1) of section 17 of this Law; (n) to provide for the welfare of all persons employed by the University and the wives, widows and dependants of such persons including payment of money, pensions or other payments and to subscribe to benevolent and other funds for the benefit of such persons; (o) to call for reports from the Senate on any matter relating to the instruction and teaching in the University; (p) to encourage and make provision for research within the University; (q) to exercise all such powers as are or may be conferred on the Council by this Law or by the Statutes or Acts and to carry this Law, the Statutes and the Acts into effect."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Council's power of delegation",
      "content": "14. Council's power of delegation The Council may delegate subject to the prior approval of the President, any of its powers or duties, except the powers relating to the making, altering, or annulling of Statutes, to the Chairman of the Council, the Vice-Chancellor, the Board of Governors of an Institute or other Units of the University established under this Law, or to any Committee appointed by the Council and consisting- [1971 No. 26. 1975 No. 22.] (a) of members of the Council; or (b) of one or more members of the Council and such other persons as the Council may appoint to the Committee."
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "The Chairman of the Council",
      "content": "15. The Chairman of the Council (Omitted; see 1993 No.11)."
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "The Senate and its composition",
      "content": "16. The Senate and its composition (1) There shall be a Senate for the University, the composition of which shall be determined by Statute. (2) Proceedings of the Senate shall not be invalidated by reason of any defect in the appointment of any member or by reason of any vacancies among its members."
    },
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "Functions of the Senate",
      "content": "17. Functions of the Senate (1) The Senate shall, subject to the provisions of this Law and the Statutes, and subject also to control by the Council in all matters affecting the finances of the University, manage the educational affairs of the University and act for the University in all academic matters, and shall in particular but without derogation from the generality of the foregoing have the following functions- (a) to direct and regulate the admission of students and the teaching and instruction within the University and the examinations held by the University subject to the powers of the Council as hereinafter defined: Provided that, in the case of examinations for university degrees the Senate shall arrange for the appointment of at least one external and independent examiner of high academic standing for every subject or group of subjects forming part of the course of studies for such degrees; (b) to promote research within the University; (c) to confer degrees (other than honorary degrees), diplomas, certificates, licentiateships and other distinctions; (d) to make, after report from the Faculties concerned, all regulations for giving effect to the Statutes and Acts of the University relating to courses of study and examinations; (e) to report to the Council on all Statutes and Acts or proposed changes thereof; (f) to exercise and perform such other powers and duties as may be conferred or imposed upon the Senate by Statutes. (2) Subject to a right of appeal from the decision of the Senate to the Council and from the decision of the Council to the Chancellor, the Senate shall have power to deprive any person of any degree or diploma of the University which has been conferred upon him if after due inquiry he shall be shown to have been guilty of dishonourable or scandalous conduct in the obtaining of such degree or diploma."
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "Congregation and its functions",
      "content": "18. Congregation and its functions There shall be a body, to be known as Congregation, the constitution, and functions of which shall be determined by Statute. (1971 No.26.) PART IV Faculties and Faculty Boards"
    },
    {
      "provision_ref": "s19",
      "section": "19",
      "title": "Faculties",
      "content": "19. Faculties (1) There shall be such Faculties as may be prescribed by the Statutes. [1971 No.26.]"
    },
    {
      "provision_ref": "s20",
      "section": "20",
      "title": "Faculty Boards and their functions",
      "content": "20. Faculty Boards and their functions (1) There shall be in each Faculty a Faculty Board which shall- (a) subject to the provisions of this Law and the Statutes, and subject also to the directions of the Senate, regulate the teaching and study of, and the conduct of examinations connected with, the subjects assigned to such Faculty; (b) deal with any other matter assigned to it by the Statutes or by the Senate; (c) advise the Senate on any matter referred to it by the Senate. (2) A Faculty Board may deliberate upon any matter affecting the work of the Faculty, and may report to the Senate thereon."
    },
    {
      "provision_ref": "s21",
      "section": "21",
      "title": "Composition of Faculty Boards",
      "content": "21. Composition of Faculty Boards (1) The Vice-Chancellor and the Deputy Vice-Chancellor shall be members of every Faculty Board. (2) Subject to the provisions of subsection (1), the composition of each Faculty Board shall be determined by the Statutes, and the Statutes may include provision for the appointment to any Faculty Board of persons who are not members of the academic staff but are specially qualified to assist in the work of the Faculty Board. PART V Institutes, Colleges and other Units within the University"
    },
    {
      "provision_ref": "s22",
      "section": "22",
      "title": "Institutes",
      "content": "22. Institutes There shall be within the University the following Institutes- (a) the Institute of Administration; (b) the Institute of Agricultural Research and Special Services; (c) the Institute of Education; and (d) the Institute of Health."
    },
    {
      "provision_ref": "s23",
      "section": "23",
      "title": "Constitution, etc., of the Institutes",
      "content": "23. Constitution, etc., of the Institutes (1) The functions and constitution of each Institute shall be prescribed by Statute. (2) For each Institute, the Statutes shall provide for the functions and constitution of a Board of Governors and an Academic and Professional Board. (3) The Statute of each Institute shall provide that the Governor of the States in Northern Nigeria shall each be entitled to appoint at least one member of each Board of Governors."
    },
    {
      "provision_ref": "s24",
      "section": "24",
      "title": "Constitution of colleges",
      "content": "24. Constitution of colleges (1) There shall be such colleges as may be prescribed by Statute as administrative units within the University which may provide instruction for degree and other courses, conduct research and carry out such other functions as may he prescribed by Statute. (2) The constitution of and other matters relating to any college may be prescribed by Statute."
    },
    {
      "provision_ref": "s25",
      "section": "25",
      "title": "Other units within the University",
      "content": "25. Other units within the University Subject to the provisions of this Law, the Council may establish units for special purposes within the University, other than Faculties, Institutes or colleges, and the name, constitution and functions of any such unit may be prescribed by Statute or by direction of the Council. PART VI Legislative Powers of Authorities and Interpretation of Legislation"
    },
    {
      "provision_ref": "s26",
      "section": "26",
      "title": "The Statutes and their scope",
      "content": "26. The Statutes and their scope Statutes made under the provisions of section 28 (2) may, subject to the provisions of this Law, prescribe and regulate- (a) the powers and duties of the authorities of the University, their composition and constitution, and all other matters relative to such authorities; (b) the admission of students, their discipline and welfare; (c) any other matters authorised or required by this Law to be prescribed or regulated by the Statutes. 27. First Statutes and their effect (1) The first Statutes which are those set out in the First Schedule to this Law, shall be deemed to have been made under the provisions of sections 28 and 31 and shall continue in force save in so far as they may be hereafter amended or revoked. [First Schedule.] (2) The power to make Statutes shall not be limited by or with reference to the first or any subsequent Statute or to the subject matter thereof."
    },
    {
      "provision_ref": "s28",
      "section": "28",
      "title": "Method of enactment of Statutes",
      "content": "28. Method of enactment of Statutes (1) The making, amendment and revocation of Statutes shall, subject to the prior approval of the President, be carried out only by and with the consent of the Chancellor, the Council and the Senate. [1971 No.26. 1975 No. 22.] (2) Proposals for the making, amendment or revocation of Statutes may be initiated by either the Council or the Senate and shall require- (a) approval at a meeting of the Council by the votes of at least three-quarters of the members present and voting, being not less than one-half of the total membership of the Council; and (b) approval at a meeting of the Senate by a majority of the members present and voting; and (c) approval by the Chancellor. (3) Unless otherwise specified therein, a Statute shall come into force when it has received the approval of the Council, the Senate and the Chancellor in accordance with subsection (2) and when it has been published in the Federal Gazette."
    },
    {
      "provision_ref": "s29",
      "section": "29",
      "title": "Proof of Statutes in court",
      "content": "29. Proof of Statutes in court Any Statute or the amendment or annulment of any Statutes may be proved in any court by the production of a copy thereof purporting to be signed and certified as true by the Vice-Chancellor or the Deputy Vice-Chancellor or the Registrar."
    },
    {
      "provision_ref": "s30",
      "section": "30",
      "title": "Acts",
      "content": "30. Acts The Council after consultation with the Senate may from time to time make, amend or revoke Acts to direct and regulate the University and its authorities and members."
    },
    {
      "provision_ref": "s31",
      "section": "31",
      "title": "Regulations",
      "content": "31. Regulations The Senate may from time to time make, amend or revoke Regulations to regulate and control the educational affairs and academic matters of the University."
    },
    {
      "provision_ref": "s32",
      "section": "32",
      "title": "Effect of Acts and Regulations",
      "content": "32. Effect of Acts and Regulations All Acts and Regulations shall take effect subject to the provisions of this Law and the Statutes."
    },
    {
      "provision_ref": "s33",
      "section": "33",
      "title": "Settlement of disputes",
      "content": "33. Settlement of disputes In the event of any doubt or dispute arising at any time regarding the meaning of any of the provisions of this Law or the Statutes, the matter may be referred to the Visitor who shall take such advice and make such decision thereon as he shall think fit, and such decision shall be binding upon the authorities, staff and students of the University. PART VII Matters of Administration"
    },
    {
      "provision_ref": "s34",
      "section": "34",
      "title": "Superannuation of staff",
      "content": "34. Superannuation of staff Provisions may be made by the Council to authorise the University to contribute to any superannuation fund or other similar scheme for the benefit of members of the staff. [l971 No. 26.]"
    },
    {
      "provision_ref": "s35",
      "section": "35",
      "title": "Retiring age of academic staff of the University",
      "content": "35. Retiring age of academic staff of the University (1) Notwithstanding anything to the contrary in the Pensions Act, the compulsory retiring age of an academic staff of the University shall be sixty-five years. [Cap. P4.] (2) A law or rule requiring a person to retire from the public service after serving for thirty-five years shall not apply to an academic staff of the University. [1993 No. 11]"
    },
    {
      "provision_ref": "s36",
      "section": "36",
      "title": "Special provisions relating to pensions of professors",
      "content": "36. Special provisions relating to pensions of professors A person who retires as a professor having served- [1993 No.11] (a) a minimum period of fifteen years as a professor in the University or continuously in the service of a University in Nigeria up to the retiring age; and (b) who during the period of service was absent from the University only on approved national or University assignments, shall be entitled to pension at a rate equivalent to his last annual salary and such allowances, as the Council may, from time to time, determine as qualifying for pension and gratuity, in addition to any other retirement benefits to which he may be entitled."
    },
    {
      "provision_ref": "s37",
      "section": "37",
      "title": "Common seal of the University",
      "content": "37. Common seal of the University (1) The Registrar shall have custody of the common seal of the University and shall be responsible for affixing the same to documents. (2) The common seal of the University shall not be used except upon the direction of the Council and shall be authenticated in the manner prescribed by the Statutes, and shall be officially and judicially noticed."
    },
    {
      "provision_ref": "s38",
      "section": "38",
      "title": "Parol contracts",
      "content": "38. Parol contracts A contract which, if made by a private person, would be by law valid although made by parol and not reduced into writing may be made by parol on behalf of the Council by any person acting under its authority express or implied."
    },
    {
      "provision_ref": "s39",
      "section": "39",
      "title": "Bank accounts",
      "content": "39. Bank accounts (1) All moneys received on account of the University shall be paid into such bank or banks as may be approved by the Council for the credit of one or other of the accounts of the University in accordance with the directions of the Council. (2) The moneys or any portion thereof standing to the credit of any or the accounts of the University may, if the Council thinks fit, be invested in such securities as the Council directs or be placed on deposit in such bank or banks as the Council may determine."
    },
    {
      "provision_ref": "s40",
      "section": "40",
      "title": "Acquisition of land for purposes of the University",
      "content": "40. Acquisition of land for purposes of the University (1) Where it is made to appear to the President that any land in the Northern States of Nigeria is required for the purposes of the University and that there is any hindrance to the acquisition thereof the President may by order direct that proceedings be taken under the Land Use Act for acquiring the land for the Government and for determining the compensation to be paid to the parties interested and upon such order being made the land to which it relates shall be deemed to be land required for a public purpose within the meaning of the Land Use Act. [Cap. L5.] (2) Where any land has been acquired in pursuance of an order made under subsection (1), the Federal Minister charged with the responsibility for land matters shall vest such land in the University by means of a certificate of occupancy for an indefinite term without a rent and thereupon such land shall be subject in all respects to the provisions of the Land Use Act. (3) The compensation for such acquisition shall in the first instance be paid by the Federal Government, but if and when so required, the University shall refund to the Federal Government any compensation so paid and all expenses incidental to such acquisition incurred by the Federal Government."
    },
    {
      "provision_ref": "s41",
      "section": "41",
      "title": "Non-application of section 20 of Cap. 52 of the Laws of Northern Nigeria",
      "content": "41. Non-application of section 20 of Cap. 52 of the Laws of Northern Nigeria transition from the provisions of the University of Northern Nigeria (Provisional Council) Law, 1961, to the provisions of this Law and otherwise as therein stated. The provisions of section 20 of the Interpretation Law (which relate to the power given by an Act to make subsidiary legislation) shall not apply in relation to any regulations or rules made by any of the authorities of the University under the provisions of this Law or to any Statutes."
    },
    {
      "provision_ref": "s42",
      "section": "42",
      "title": "Repeal of N.N. 24 of 1961",
      "content": "42. Repeal of N.N. 24 of 1961 The University of Northern Nigeria (Provisional Council) Law, 1961, is hereby repealed."
    },
    {
      "provision_ref": "s43",
      "section": "43",
      "title": "Transitional provisions",
      "content": "43. Transitional provisions The transitional provisions set out in the Second Schedule shall have effect for the purposes of [Second Schedule. N.N.24 of 1961.]"
    },
    {
      "provision_ref": "s44",
      "section": "44",
      "title": "Power to amend this Law by order",
      "content": "44. Power to amend this Law by order The President may by order amend any provision of this Law. [1975 No.22.] SCHEDULES FIRST SCHEDULE The Statutes [Section 27] STATUTE I Definitions In these Statutes- expressions which are defined in the Law shall have the meanings assigned to them by the Law; \"the Law\" means the Ahmadu Bello University Law; \" Constituent Institution\" means an institution so described in these Statutes; \"States\" means the States formed out of the territory formerly known as Northern Nigeria. STATUTE 2 Members of the University The following persons shall be members of the University- (a) the officers; (b) the members of the Council; (c) the members of the Senate; (d) the members of the academic staff; (e) the warden of University halls of residence; (f) the graduates; (g) the students. Such other persons as the Council may, after consultation with the Senate, grant the status of member. STATUTE 3 Officers of the University 1 . The officers of the University shall be- (a) the Chancellor; (b) the Pro-Chancellors; (c) the Vice-Chancellor; (d) the Deputy Vice-Chancellor; (e) the Provost of any college established under Statute 17; (f) the Provost for Agriculture and Veterinary Medicine; (g) the Directors of the Institutes within the University; (h) the Registrar; (i) the Librarian; and (j) the Bursar. 2 . (1) The Pro-Chancellor shall be appointed by the Chancellor on the advice of the Council. (2) A Pro-Chancellor may, at the request of the Chancellor, act for the Chancellor in relation to any matter specially delegated to him. The Vice-Chancellor 3. (1) There shall be a Vice-Chancellor of the University who shall be appointed by the President in accordance with the provisions of this paragraph. [1993 No.11] (2) The Vice-Chancellor shall - (a) be competent at all times to advise the Council on any matter affecting the policy, finance and administration of the University; (b) be generally responsible to the Council for maintaining the efficiency and good order of the University and for ensuring the proper enforcement of the Statutes, Acts and Regulations; (c) be responsible for discipline in the University and in this behalf may make rules which, on their making, shall come into force, but shall be submitted by him to the Council at its next meeting and shall thereupon be deemed to be ratified unless the contrary is shown; (d) have power to refuse to admit any person as a student without giving any reason; and (e) have power to act for and on behalf of the Chancellor at any function at which degrees of the University are conferred. (3) Where a vacancy occurs in the post of a Vice-chancellor, the Council shall- (a) advertise the vacancy in a reputable journal or a widely read newspaper in Nigeria, specifying- (i) the qualities of the persons who may apply for the post; and (ii) the terms and conditions of service applicable to the post, and thereafter draw up a short list of suitable candidates for the post for consideration; (b) constitute a Search Team consisting of - (i) a member of the Council, who is not a member of the Senate, as chairman; (ii) two members of the Senate who are not members of the Council, one of whom shall be a professor; (iii) two members of Congregation who are not members of the Council, one of whom shall be a professor, to identify and nominate for consideration, suitable persons who are not likely to apply for the post on their own volition because they feel that it is not proper to do so. (4) A Joint Council and Senate Selection Board consisting of &ndash; (a) the pro-Chancellor, as chairman; (b) two members of the Council, not being members of the Senate; (c) two members of the Senate who are professors, but who were not members of the Search Team, shall consider the candidates and persons on the short list drawn up under subparagraph (2) of this paragraph through an examination of their curriculum vitae and interaction with them, and recommend to the Council suitable candidates for further consideration. (5) The Council shall select three candidates from among the candidates recommended to it under subparagraph (3) of this paragraph and may indicate its order of preference stating the reasons therefore and forward the names to the President. [1996 No. 25] (6) The President may appoint as Vice-Chancellor, anyone of the candidates recommended to him in accordance with the provisions of subparagraph (4) of this paragraph. (7) The Vice-Chancellor shall hold office for a single term of five years only on such terms and conditions as may be specified in his letter of appointment. (8) For the avoidance of doubt, the provisions of subparagraph (7) of this paragraph shall- (i) only be applicable to those appointed to the office of Vice-Chancellor after 1 January, 1993; (ii) not confer on a person serving a first term of office as Vice-Chancellor before 1 January, 1993 any right to renewal of the appointment for a further term of four years. (9) The Vice-Chancellor may be removed from office by the Visitor after due consultation with the Council and the Senate acting through the Minister of Education. Deputy Vice-Chancellors 4 . (1) There shall be for the University such number of Deputy Vice-Chancellors as the Council may, from time to time, deem necessary for the proper administration of the University. [1996 No.25.] (2) Where a vacancy occurs in the post of Deputy Vice-Chancellor, the Vice-Chancellor shall forward to the Senate a list of two candidates for each post of Deputy Vice-Chancellor that is vacant. (3) The Senate shall select for each vacant post one candidate from each list forwarded to it under subparagraph (2) of this paragraph and forward his name to the Council for confirmation. (4) A Deputy Vice-Chancellor shall- (a) assist the Vice-Chancellor in the performance of his functions; (b) act in the place of the Vice-Chancellor when the post of the Vice-Chancellor is vacant or if the Vice-Chancellor is, for any reason, absent or unable to perform his functions as Vice-Chancellor; and (c) perform such other functions as the Vice-Chancellor or the Council may, from time to time, assign to him. (5) A Deputy Vice-Chancellor- (a) shall hold office for a period of two years beginning from the effective date of his appointment and on such terms and conditions as may be specified in his letter of appointment; and (b) may be re-appointed for one further period of two years and no more. (6) The Provost for Agriculture and Veterinary Medicine shall assist the Vice-Chancellor in and shall co-ordinate matters concerning agriculture and veterinary medicine. Office of the Registrar 6. (1) There shall be a Registrar, who shall be the Chief Administrative Officer of the University and shall be responsible to the Vice-Chancellor for the day-to-day administrative work of the University except as regards matters for which the Bursar is responsible in accordance with paragraph 7 (2) of this Statute. [1993 No. 11. 1993 No. 55] (2) The person holding the office of the Registrar shall by virtue of that office be Secretary to the Council, the Senate, Congregation and Convocation. Other Principal Officers of the University 7. (1) There shall be for the University the following principal officers, in addition to the Registrar, that is- [1993 No.11] (a) the Bursar; and [1993 No.55] (b) the University Librarian, who shall be appointed by the Council on the recommendation of the Selection Board constituted under paragraph 8 of this Statute. (2) The bursar shall be the Chief Financial Officer of the University and be responsible to the Vice-Chancellor for the day-to-day administration and control of the financial affairs of the University. (3) The University Librarian shall be responsible to the Vice-Chancellor for the- (a) administration of the University library; (b) co-ordination of the library services in the University, its campuses, colleges, faculties, schools, departments, institutes and other teaching or research units; and"
    }
  ],
  "definitions": []
}