{
  "id": "armed-forces-comfort-fund-act",
  "type": "statute",
  "title": "ARMED FORCES COMFORT FUND ACT",
  "title_en": "ARMED FORCES COMFORT FUND ACT",
  "short_name": "ARMED FORCES COMFORT FUND ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=36",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Establishment of the Armed Forces Comfort Fund",
      "content": "1. Establishment of the Armed Forces Comfort Fund There shall be established a fund to be known as the Armed Forces Comfort Fund (in this Act referred to as \"the Fund\") into which shall be paid all moneys received in terms of the Trust Deed made between the Federal Government of Nigeria and the Trustees of the Fund, that is to say- (a) the moneys and contributions paid or credited to the Armed Forces Comfort Fund hereby established; and (b) any further sums from time to time payable under the said Trust Deed; and moneys in the Fund together with interest (if any) payable in respect thereof shall be applied by the Trustees of the Fund for any of the purposes set out in section 2 of this Act."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Purpose of Fund",
      "content": "2. Purpose of Fund The Fund shall be available and applied for the following purposes, that is- (a) for the relief of the members of the Armed Forces and their families in distress as a result of the exigencies of the civil war where this cannot be met from other official sources and is certified by the Chief of Staff (Nigerian Army), the Chief of Naval Staff or the Chief of Air Staff, whichever is appropriate, as constituting a fair charge against the Fund; (b) for extra medical care for members of the armed forces and their families where government facilities are either inadequate or not immediately available; (c) for the restitution of messing facilities of the armed forces; (d) for making donations as appropriate to other funds or organisations which in the opinion of the Trustees are closely connected with and actively assisting in the war effort of the armed forces; and (e) for the doing of such acts and things as may seem to the Trustees expedient and necessary for the trusts declared in the Trust Deed."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Disbursements from the Fund",
      "content": "3. Disbursements from the Fund Disbursements from the Fund shall be made in accordance with the rules under section 28 of the Finance (Control and Management) Act. [Cap. F26.]"
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Short title",
      "content": "4. Short title This Act may be cited as the Armed Forces Comfort Fund Act. SUBSIDIARY LEGISLATION No Subsidiary Legislation"
    }
  ],
  "definitions": []
}