{
  "id": "association-of-national-accountants-of-nigeria-act",
  "type": "statute",
  "title": "ASSOCIATION OF NATIONAL ACCOUNTANTS OF NIGERIA ACT",
  "title_en": "ASSOCIATION OF NATIONAL ACCOUNTANTS OF NIGERIA ACT",
  "short_name": "ASSOCIATION OF NATIONAL ACCOUNTANTS OF",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=41",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Establishment of the Association of National Accountants of Nigeria, etc.",
      "content": "1. Establishment of the Association of National Accountants of Nigeria, etc. (1) There is hereby established a body to be known as the Association of National Accountants of Nigeria (in this Act referred to as \"the Association\") which shall be a body corporate under that name and be charged with the general duty of- (a) advancing the science of accountancy (in this Act referred to as \"the profession\"); (b) determining the standards of knowledge and skill to be attained by persons seeking to become registered members of the profession and reviewing those standards, from time to time as circumstances may require; (c) promoting the highest standard of competence, practice and conduct among the members of the profession; (d) securing, in accordance with the provisions of this Act, the establishment and maintenance of a register of members of the profession and the publication, from time to time, of lists of those persons; (e) doing such things as may advance and promote the advancement of the profession of accountancy in both the public and private sector of the economy; and (f) performing, through the Council established under section 3 of this Act, the functions conferred on it by this Act. (2) The Association shall have perpetual succession and a common seal which shall be kept in such custody as the Council established under section 3 of this Act may from time to time authorise."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Membership of the Association",
      "content": "2. Membership of the Association Subject to the provisions of this Act, a person admitted to membership of the Association shall be registered as a member and shall be entitled to use the abbreviation \"NNA\" (Nigerian National Accountant) after his name. 3. Council of the Association (1) There shall be, as the governing body of the Association, a Council which shall be charged with the administration and general management of the Association. (2) The Council shall consist of- (a) a President; (b) a Vice-President; (c) ten persons nominated by the Association; (d) all immediate past presidents of the Association, including the Incorporated Association; (e) three persons to represent the Federal, State and Local Governments in rotation; (f) two persons who shall be members of the Association to represent institutions of higher learning in Nigeria offering courses leading to an approved qualification, in rotation, so however that the two shall not come from the same institution. (3) The President and the Vice-President shall be nominated from the Council by members of the Association. (4) The President and Vice-President shall each hold office for a term of two years from the date of their nomination, and the President shall be the Chairman at meetings of the Association, so however that in the event of the death, incapacity or inability for any reason of the President, the Vice- President shall act as President for the unexpired portion of the term of office and as Chairman, as the case may be and references in this Act to the president shall be construed accordingly. (5) The President and the Vice-President shall respectively be Chairman and Vice-Chairman of the Council of the Association under this Act. (6) If the President or the Vice-President ceases to be a member of the Association, he shall cease to hold any of the offices designated under this section. (7) The provisions of the First Schedule to this Act shall have effect with respect to the qualifications and tenure of office of members of the Council and other matters therein mentioned. [First Schedule.] PART II Financial Provisions 4. Fund of the Association (1) The Council shall establish and maintain a fund for the purpose of this Act. (2) There shall be paid into the fund of the Council- (a) all fees and other moneys payable to the Council in pursuance of this Act; and (b) such moneys as may be payable to the Council, whether in the course of the discharge of its functions or not. (3) There shall be paid out of the fund of the Council established pursuant to subsection (1) of this section- (a) the remuneration and allowances of the Registrar and other employees of the Council; (b) such reasonable travelling and subsistence allowance of members of the Council in respect of the time spent on the business of the Council as the Council may approve; (c) any other expenses approved by the Council in the discharge of its functions under this Act. (4) The Council may invest moneys in the fund in any security created or issued by or on behalf of the Federal Government or in any other securities in Nigeria approved by the Council. (5) The Council may, from time to time, borrow money for the purposes of the Association and any interest payable on moneys so borrowed shall be paid out of the fund. 5. Accounts, etc. The Council shall keep proper accounts on behalf of the Association in respect of each year and proper records in relation to those accounts and shall cause its accounts to be audited as soon as may be after the end of the year to which the accounts relate by a firm of auditors approved by the Association and, when audited, the accounts shall be submitted to the members of the Association for approval by them at the meeting of the Association. PART III Appointment of Registrar, etc., and preparation of the Register"
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Appointment of Registrar, etc., and preparation of the register",
      "content": "6. Appointment of Registrar, etc., and preparation of the register (1) The Council shall appoint a fit and proper person to be the Registrar for the purposes of this Act, and such other persons as the Council may, from time to time think necessary to assist the Registrar in the performance of his function under this Act. (2) It shall be the duty of the Registrar to prepare and maintain, in accordance with rules made by the Council, a register of the names, addresses, approved qualifications, and of such other qualifications and particulars as may be specified in the rules of all persons who are entitled in accordance with the provisions of this Act to be registered as members of the Association and who, in the manner prescribed by such rules, apply to be so registered. (3) Subject to the foregoing provisions of this section, the Council shall make rules with respect to the form and keeping of the register and the making of entries therein, and in particular- (a) regulating the making of application for or registration, as the case may be, and providing for the evidence to be produced in support of such applications; (b) providing for the notification to the Registrar, by the person to whom any registered particulars relate, of any change in those particulars; (c) authorising a registered person to have any qualification which is in relation to the relevant division of the profession, whether an approved qualification or accepted qualification for the purposes of this Act; registered in relation to his name in addition to or, as he may elect, in substitution for any other qualifications so registered; (d) specifying the fees, including any annual subscription, to be paid to the Association in respect of the entry of names on the register, and authorising the Registrar to refuse to enter a name on the register until any fee specified for the entry has been paid; (e) specifying anything failing to be specified under the foregoing provisions of this section, but rules made for the purposes of paragraph (d) of this subsection shall not come into force until they are confirmed at a meeting of the Association. (4) It shall be the duty of the Registrar- (a) to correct, in accordance with the Council's directions, any entry in the register which the Council directs him to correct as being in the Council's opinion an entry which was incorrectly made; (b) to make, from time to time, any necessary alteration to the registered particulars of registered persons; (c) to remove from the register the name of any registered person who has died; and (d) to record the names of members of the Association who are in default for more than six months in the payment of annual subscriptions, and to take such action in relation thereto (including removal of the names of defaulters from the register) as the Council may direct or require, (5) If the Registrar- (a) sends by post to any registered person a registered letter addressed to him at his address on the register enquiring whether the registered particulars relating to him are correct and receives no reply to the letter within a period of six months from the date of posting it; and (b) upon the expiration of that period, sends in like manner to the person in question a second similar letter and receives no reply to that letter within three months from the date of posting it, the Registrar may remove the particulars relating to the person in question from the register: Provided that, the Council may direct the Registrar to restore to the appropriate part of the register any particulars removed therefrom under this subsection."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Publication of register and list of corrections",
      "content": "7. Publication of register and list of corrections (1) It shall be the duty of the Registrar- (a) to cause the register to be printed, published and put on sale to members of the public not later than two years from the commencement of this Act; and (b) thereafter in each year to cause to be printed, published and put on sale as aforesaid, either a corrected edition of the register or a list of corrections made to the register, since it was last printed; and (c) to cause a print of each edition of the register and of each list of corrections to be deposited at the principal offices of the Association; and (d) to keep the register and lists so deposited to be made available to members of the public at all reasonable times for inspection. (2) A document purporting to be a print of an edition of a register published under this section by authority of the Registrar, or documents purporting to be prints of an edition of a register so published and of the list of corrections to that edition so published, shall (without prejudice to any other means of proof) be admissible in any proceedings as evidence that any person specified in the document, or the documents read together, as being registered was so registered at the date of the edition or of the list of corrections, as the case may be and that any person not so specified was not so registered. (3) Where in accordance with subsection (2) of this section, a person is, in any proceeding shown to have been or not to have been registered at a particular date, he shall, unless the contrary is proved, be taken for the purposes of those proceedings as having at all material times thereafter continued to be, or not to be so registered. PART IV Registration 8. Registration of members (1) Subject to section 9 of this Act and to rules made under section 6 (3) of this Act, a person shall be entitled to be registered as a member of the profession if he satisfies the Council that- (a) immediately before the commencement of this Act, he holds a qualification approved for membership of any of the professional bodies mentioned in the Fourth Schedule to the Act or any other professional accounting body approved by the Minister on the recommendation of the Council; [Fourth Schedule.] (b) before the 1st January 1979, he was a graduate in accountancy of any Nigeria university with three years' post-qualification experience; (c) he is a citizen of Nigeria and was immediately before the commencement of this Act, the Accountant-General, Auditor-General or chief accountant in the public service of the Federation or a Director of the State Internal Revenue or a chief accountant of any company quoted at the Nigerian Stock Exchange provided he possesses a Bachelor's degree in Accountancy or an equivalent qualification in Accountancy; (d) he has obtained an approved degree in Accountancy and passed the professional examination conducted by the Nigerian College of Accountancy and had completed the accountant-in-training programme. (2) Subject as aforesaid, a person shall also be entitled to be registered under the Act if he holds such certificate as may be recognised by the Council from time to time. (3) An application for registration under this Act shall in addition to evidence of qualification, satisfy the Council that- (a) he is of good character; (b) he has attained the age of twenty-five years; and (c) he has not been convicted in Nigeria or elsewhere of an offence involving fraud or dishonesty. (4) The Council may, in its sole discretion provisionally, accept a qualification produced in respect of an application for registration under this section or direct that the application be renewed within such period as may be specified in the direction. (5) Any entry directed to be made in the register, under subsection (4) of this section, shall show that the registration is provisional and no entry so made shall be converted to full registration without the consent of the Council signified in writing in that behalf. (6) The Council shall, from time to time, publish in the Gazette particulars of qualifications for the time being accepted for registration under this Act."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Approval of qualifications, etc.",
      "content": "9. Approval of qualifications, etc. (1) The Council may approve any institution for the purposes of this Act and may for those purposes approve- (a) any course of training at any approved institution which is intended for persons seeking to become or are already members of the accountancy profession and which in the opinion of the Council is designed to confer on persons completing it sufficient knowledge and skill for the practice of the profession; (b) any qualification which, as a result of an examination taken in conjunction with a course of training approved by the Council under this section, is granted to candidates reaching a standard at the examination indicating in the opinion of the Council, that the candidates have sufficient knowledge and skill for the practice of the profession. (2) The Council may, if it thinks fit, withdraw any approval given under this section in respect of any course, qualification or institution; but before withdrawing such an approval the Council shall- (a) give notice that it proposes to do so to persons in Nigeria appearing to the Council to be persons by whom the course is conducted or the qualification is granted or the institution is controlled, as the case may be; (b) afford each such person an opportunity of making to the Council representations with regard to the proposal; and (c) take into consideration any representation made as respects the proposal in pursuance of paragraph (b) of this subsection. (3) A course, qualification or institution shall not be treated as approved during any period the approval is withdrawn under subsection (2) of this section. (4) Notwithstanding the provisions of subsection (3) of this section, the withdrawal of an approval under subsection (2) of this section shall not prejudice the registration or eligibility for registration of any person who by virtue of the approval was registered or was eligible for registration (either unconditionally or subject to his obtaining a certificate of experience) immediately before the approval was withdrawn. (5) The giving or withdrawal of an approval under this section shall have effect from such date, either before or after the execution of the instrument signifying the giving or withdrawal of the approval, as the Council may specify in the instrument and the Council shall- (a) as soon as may be, publish a copy of every such instrument in the Gazette; and (b) not later than seven days before its publication as aforesaid, send a copy of the instrument to the Minister."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Supervision of instructions and examinations leading to approved qualifications",
      "content": "10. Supervision of instructions and examinations leading to approved qualifications (1) It shall be the duty of the Council to keep itself informed of the nature of- (a) the instruction given at approved institutions to persons attending approved courses of training; and (b) the examinations as a result of which approved qualifications are granted, and for the purposes of performing that duty, the Council may appoint, either from among its members or otherwise, persons to visit approved institutions or to observe such examinations. (2) It shall be the duty of a person appointed under this section to report to the Council on- (a) the adequacy of the instruction given to persons attending approved courses of training at institutions visited by him; (b) the adequacy of the examinations attended by him; and (c) any other matters relating to the institutions or examinations on which the Council may, either generally or in a particular case, request him to report, but no such person shall interfere with the giving of any instruction or the holding of any examination. (3) On receiving a report made in pursuance of this section, the Council may, if it thinks fit, and shall, if so required by the institution, send a copy of the report to the person appearing to the Council to be in charge of the institution or responsible for the examination to which the report relates, requesting that person to make an observation on the report to the Council within such period as may be specified in the request, not being less than one month beginning with the date of the request. PART V Professional Discipline"
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Establishment of Disciplinary Tribunal and Investigating Panel",
      "content": "11. Establishment of Disciplinary Tribunal and Investigating Panel (1) There shall be a tribunal to be known as the Association of National Accountants of Nigeria Disciplinary Tribunal (in this Act referred to as \"the Tribunal\") which shall be charged with the duty of considering and determining any case referred to it by the Investigating Panel established by the following provisions of this section and any other case of which the Tribunal has cognisance under the following provisions of this Act. (2) The Tribunal shall consist of the Chairman of the Council and six other members of the Council appointed by the Council. (3) There shall be a body to be known as the Association of National Accountants of Nigeria Investigating Panel (in this Act referred to as \"the Panel\") which shall be charged with the duty of- (a) conducting a preliminary investigation into any case where it is alleged that a person registered has misbehaved in his capacity as a member or should for any other reason be the subject of proceedings before the Tribunal; and (b) deciding whether the case should be referred to the Tribunal. (4) The Panel shall be appointed by the Council and shall consist of four members of the Council one of whom shall not be a member of the Council. (5) The provisions of the Second Schedule to this Act shall, so far as applicable to the tribunal and panel respectively, have effect with respect of those bodies. [Second Schedule.] (6) The Council may make rules not inconsistent with this Act as to acts which constitute professional misconduct."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Penalties for unprofessional conduct, etc.",
      "content": "12. Penalties for unprofessional conduct, etc. (1) Where- (a) a person registered under this Act is judged by the Tribunal to be guilty of infamous conduct in any professional respect; or (b) a person is convicted, by any court or tribunal in Nigeria or elsewhere having power to award imprisonment, of an offence (whether or not punishable with imprisonment) which in the opinion of the Tribunal is incompatible with the status of a member of the profession; or (c) the tribunal is satisfied that the name of any person has been fraudulently registered, the Tribunal may, if it thinks fit, give a direction reprimanding that person or ordering the Registrar to strike his name off the relevant part of the register. (2) The Tribunal may, if it thinks fit, defer its decision as to the giving of a direction under subsection (1) of this section until a subsequent meeting of the Tribunal; but- (a) no decision shall be deferred under this subsection for periods exceeding two years in the aggregate; and (b) no person shall be a member of the Tribunal for the purposes of reaching a decision which has been deferred or further deferred, unless he was present as a member of the Tribunal when the decision was deferred. (3) For the purposes of subsection (1) (b) of this section, a person shall not be treated as convicted, unless the conviction stands at a time when no appeal or further appeal is pending or may (without extension of time) be brought in connection with the conviction. (4) When the Tribunal gives a direction under subsection (1) of this section, the Tribunal shall cause notice of the direction to be served on the person to whom it relates. (5) A person to whom a direction relates may, at any time within 28 days from the date of service on him of notice of the direction, appeal against the direction to the Court of Appeal and the Tribunal may appear as respondent to the appeal and, for the purpose of enabling directions to be given as to the costs of the appeal and of proceedings before Court of Appeal, the Tribunal shall be deemed to be a party thereto whether or not it appears on the hearing of the appeal. (6) A direction of the Tribunal under subsection (1) of this section, shall take effect where- (a) no appeal under this section is brought against the direction within the time limited for the appeal, on the expiration of that time; (b) an appeal is brought and is withdrawn or struck out for want of prosecution, on the withdrawal or striking out of the appeal; (c) an appeal is brought and is not withdrawn or struck out as aforesaid, if and when the appeal is dismissed, and shall not take effect except in accordance with the foregoing provisions of this subsection. (7) A person whose name is struck off the register in pursuance of a direction of the Tribunal under this section, shall not be entitled to be registered again except in pursuance of a direction in that behalf and a direction under this section for the striking off of a person's name from the register, may prohibit an application under this subsection by that person until the expiration of such period from the date of the direction (and where he has duly made such an application, from the date of his last application) as may be specified in the direction. PART VI Miscellaneous"
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Application of this Act to unregistered persons",
      "content": "13. Application of this Act to unregistered persons Any person not a member of the Association of National Accountants of Nigeria incorporated under the then Land Perpetual Succession Act (in this Act referred to as \"the Incorporated Association\") who but for this Act, would have been qualified to apply for and obtain membership of the Incorporated Association may, within the period of three months beginning from the commencement of this Act, apply for membership of the Association in such manner as may be prescribed by rules made by the Council; and if approved, he shall be registered according to his qualification. [Cap. 98 of 1958 Edition.]"
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "When a person is deemed to practice as a member",
      "content": "14. When a person is deemed to practice as a member (1) Subject to subsection (2) of this section, a person shall be deemed to practice as a member of the profession if, in consideration of remuneration received or to be received and whether by himself or in partnership with any other person- (a) he engages himself in the practice of accountancy or holds himself out to the public as a member of the Association; or (b) he renders professional service or assistance in or about matters of principle or detail relating to accountancy; or (c) he renders any other service which may by regulations made by the Council, with the approval of the Minister, be designed as service constituting accountancy practice; or (d) describes himself as a public national accountant. (2) Nothing in this section shall be construed so as to apply to persons who, while in the employment of any Government, or engaged in commerce and industry perform the duties or any of the duties of an accountant."
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Rules as to practice, etc.",
      "content": "15. Rules as to practice, etc. (1) The Council may make rules- (a) for the training of suitable persons in accounting methods and practice; and (b) for the supervision and regulation of the engagement, training and transfer of such persons. (2) The Council may also make rules- (a) prescribing the amount and due date for repayment of the annual subscription; (b) prescribing the form of licence to practice to be issued annually or, if the Council thinks fit, by endorsement on an existing licence; and (c) restricting the right to practice in default of payment of the amount of the annual subscription where the default continues for longer than such period as may be prescribed by the rules. (3) Rules when made under this section shall, if the chairman of the Council so directs, be published in the Gazette ."
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Provision of library facilities, etc.",
      "content": "16. Provision of library facilities, etc. The Association shall- (a) provide and maintain a library comprising books and publications for the advancement of knowledge of accountancy, financial management, and cognate subjects as applied to all or any of the professional services provided by accountants engaged in public practice, industry and commerce or the civil service and such other books and publications as the Council may think necessary for the purpose; (b) encourage research into financial management and such subjects as may be relevant to accountancy to the extent that the Council may, from time to time consider necessary. 17. Offences (1) If any person, for the purpose of procuring the registration of any name, qualification or other matter- (a) makes a statement which he believes to be false in a material particular; or (b) recklessly makes a statement which is false in a material particular, he shall be guilty of an offence. (2) If, on or after the relevant date, any person who is not a member of the Association practices or holds himself out to practice for or in expectation of reward or takes or uses any name, title, addition or description implying that he is a member of the Association shall be guilty of an offence: Provided that, in the case of a person falling within section 13 of this Act- (a) this subsection shall not apply in respect of anything done by him during the period of three months mentioned in that section; and (b) if within that period he duly applies for membership of the Association then, unless within that period he is notified that his application has not been approved, this subsection shall not apply in respect of anything done by him between the end of that period and the date on which he is registered or is notified as aforesaid. (3) If the Registrar or any other person employed by or on behalf of the Association wilfully makes any falsification in any matter relating to the register, he shall be guilty of an offence. (4) A person guilty of an offence under this section shall be liable- (a) on summary conviction, to a fine of an amount not exceeding N 10,000; (b)on conviction on indictment, to a fine of an amount not exceeding N 100,000 or to imprisonment for a term not exceeding two years, or to both such fine and imprisonment. (5) Where an offence under this section which has been committed by a body corporate is proved to have been committed with the consent or connivance of or to be attributable to any neglect on the part of any director, manager, Minister or other similar officer of the body corporate or any person purporting to act in any such capacity, he, as well as the body corporate, shall be deemed to be guilty of that offence and shall be liable to be prosecuted and punished accordingly. (6) In this section, \"the relevant date\" means the third anniversary of the coming into force of this Act or such earlier date as may be prescribed for the purposes of this section by order of the Minister published in the Gazette . 18. Regulations and rules (1) Any regulations made under this Act, shall be published in the Gazette as soon as may be after they are made and a copy of any such regulations shall be forwarded to the Minister not later than seven days before they are published. (2) Rules made for the purposes of this Act, shall be subject to confirmation by the Association at its next general meeting or at any special meeting of the Association convened for that purpose, and if annulled, shall cease to have effect on the day after the date of annulment, but without prejudice to anything done in pursuance or intended pursuance of any such rules. 19. Transfer to the Association of certain assets and liabilities (1) On the commencement of this Act- (a) all assets and liabilities held or incurred immediately before that day by or on behalf of the Incorporated Association shall, by virtue of this Act and without further assurance, vest in the Association and be held by it for the purposes of the Association; (b) the Incorporated Association shall cease to exist; and (c) subject to subsection (2) of this section, any act or thing made or done by the Incorporated Association shall be deemed to have been made or done by the Association. (2) The provision of the Third Schedule to this Act shall have effect with respect to matters arising from the transfer by this section to the Association, of the property of the Incorporated Association and with respect to the other matters mentioned therein. [Third Schedule.] 20. Interpretation In this Act, unless the context otherwise requires- \"accountant-in-training\" means a graduate of the Nigerian College of Accountancy undergoing the prescribed practical experience programme; \"Association\" means the Association of National Accountants of Nigeria established by section 1 of this Act; \"Council\" means the Council established as the governing body of the Association under section 3 of this Act; \"Disciplinary Tribunal\" means the Association of National Accountants of Nigeria Disciplinary Tribunal established under section 11 of this Act; \"fees\" includes annual subscription; \"Incorporated Association\" means the Association of National Accountants of Nigeria incorporated under the Land (Perpetual Succession) Act; [Cap. 98 1958 ed.] \"Investigating Panel\" means the Association of National Accountants of Nigeria Investigating Panel established under section 11 of this Act; \"member of the Association\" means a registered member of the Association; \"Minister\" means the Minister charged with the responsibility for matters relating to Finance; \" Nigerian College of Accountancy\" means the institution established as the training arm of the Association; \"NNA\" means Nigerian National Accountant; \"President and Vice-President\" means respectively the office-holders under those names in the Association; \"profession\" means the profession of accountancy; \"Public National Accountant\" means a member of the Association licenced to practice accountancy; \"register\" means the register maintained in pursuance of section 6 of this Act. 21. Short Title This Act may be cited as the Association of National Accountants of Nigeria Act. ___________________________ SCHEDULES FIRST SCHEDULE [Section 3 (7).] Supplementary Provisions relating to the Council Qualifications and Tenure of Office of Members of the Council 1. (1) Subject to the provisions of this paragraph, a member of the Council shall hold office for a period of three years beginning with the date of his appointment or nomination. (2) Any member of the Association who ceases to be a member thereof shall, if he is also a member of the Council, cease to hold office on the Council. (3) Any nominated member of the Council may, by notice in writing under his hand addressed to the President, resign his office and any appointed members may with the consent of the Minister in the same manner resign his office. (4) A person who retires from or otherwise ceases to be a nominated member of the Council shall be eligible again to become a member of the Council, and any appointed member may be re-appointed. (5) Nominations to the Council shall be held in such manner as may be prescribed by rules made by the Council. (6) If for any reason, a member of Council vacates office and- (a) such member was appointed by the Minister or any other body, the Minister or that body may appoint another fit person to fill that vacancy; or (b) such member was nominated, the Council may, if the time between the unexpired portion of the term of office and the next general meeting of the Association appears to warrant the filling of the vacancy, co-opt a fit person for such time as aforesaid. Proceedings of the Council 2. (1) Subject to the provisions of this Act, the Council may in the name of the Association make standing orders regulating the proceedings of the Association or of any committee thereof. (2) The standing orders made under sub-paragraph (1) of this paragraph shall pr"
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Issue of practising certificates",
      "content": "5. Issue of practising certificates A member of the Association shall not practice the profession of public accountancy unless he possesses a valid certificate issued by the Association authorising him to practice. 6. Entrance fees and subscriptions The fees and subscriptions payable by the members of the Association shall be determined by the rules made by the Association as amended, from time to time, and the annual subscriptions shall be liable to be paid in advance. Admission of Members 7. Application for membership All applications for admission to membership of the Association shall be made to the Council on the appropriate form, accompanied by such other information as the Council may, from time to time, determine and the Council shall have full discretion (subject only to these Regulations and to the Rules made thereunder) to determine the admission of an applicant, and no applicant shall be admitted as a member unless he has first satisfied the Council as to his professional status. 8. Compliance with regulations, etc. A person shall, upon applying for admission, sign an undertaking that he shall, if admitted, and for as long as he is a member, observe the Regulations and Rules of the Association for the time being in force, and he shall not use the professional designation of \"National Accountant\" or such other designatory letters denoting membership except while as a member of the Association. 9. Cessation of membership on death Any person ceasing by death, or otherwise to be a member of the Association, shall not, nor shall his representative have, any claim upon or interest in the funds of the Association and the provisions of these Regulations shall be without prejudice to the rights of the Association, at the time of his ceasing to be a member. Cessation of Membership 10. Resignation of membership (1) A member of the Association may resign his membership on giving notice to the Council, but shall remain liable to pay any subscription due from him as at the date of receipt of such notice. (2) A member of the Association shall ipso facto cease to be member of the Association in the event of his annual subscription or such other contribution to the Association becoming payable, but shall nevertheless be liable to pay the amount of the annual subscriptions and such other arrears of subscription or other sums due by him to the Association, and shall remain liable for the payment of the arrears for the period that his membership continued until the date when all such subscriptions, arrears, and other sums were fully paid. (3) The Council shall have power, in special cases, to suspend the operation of the provisions of sub-paragraph (2) of this regulation in the case of a person who has ceased to be a member under this regulation and the Council may at its discretion, re-admit the person to membership upon such conditions as it may deem fit in each circumstance. 11. Bankruptcy If a member of the Association shall become bankrupt, or shall either individually or in partnership with a firm make or agree to make an assignment for the benefit of his creditors, or shall make any arrangement or composition with his creditors or shall take or attempt to take the benefit of any statutory provision for arrangement with his creditors, he shall cease to be a member, but at the discretion of the Council he may be re-instated with or without the payment of an entrance fee or membership subscription and the Council shall have the right to publish, in the Gazette or such newspaper or journal as it may elect, an announcement of the termination of his membership. General Meeting 12. Annual General Meeting An Annual General Meeting of the Association shall be held subject to the provisions of the Act. 13. Extraordinary and general meetings The Council may convene an extraordinary general meeting and extraordinary general meetings may also be convened on such requisition by members of the Association as may be provided by the Act. 14. Omission to give notice An omission to give notice of a meeting to or the non-receipt of such notice by any member of the Association shall not invalidate any resolution passed or any proceedings of such meeting. Proceedings at General Meetings 15. Special business All businesses of the Association which is transacted at an extraordinary general meeting and all that is transacted at an annual general meeting shall also be deemed special with the exception of the consideration of the accounts and balance sheets and the reports of the Council and of the Auditors, the nomination of members of the Council and of the officers retiring by rotation and fixing of the remuneration of the Auditor. 16. Quorum No business of the association shall be transacted at any general meeting unless a quorum of twenty members is present at the time when the meeting proceeds to business. The quorum at any extraordinary general meeting of the Association shall be fifty."
    },
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "Adjournment or dissolution",
      "content": "17. Adjournment or dissolution If within half-hour from the time appointed for the meeting, a quorum is not formed, the meeting if convened on the requisition of members shall be dissolved and in any other case it shall stand adjourned to the same day in the next week, at the same place or such other place as the President shall appoint, and if at such adjourned meeting a quorum is not present within half-hour from the time appointed for the meeting, the members present shall for purposes of that meeting form a quorum."
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "Unfinished business to be discussed",
      "content": "18. Unfinished business to be discussed (1) The president may, with the consent of the members of any meeting at which a quorum is Present (and shall, if so directed by the meeting,) adjourn the meeting from time to time and from place to place, but no business shall be transacted at any adjourned meeting other than the business left unfinished at the meeting from which the adjournment took place. (2) When a meeting is adjourned pursuant to sub-paragraph (1) of this regulation for ten days or more, notice of the adjourned meeting shall be given as in the case of an original meeting, save as aforesaid it shall not be necessary to give any notice of an adjournment or of the business to be transacted at an adjourned meeting."
    },
    {
      "provision_ref": "s19",
      "section": "19",
      "title": "President of the Council to preside at meetings of the Council",
      "content": "19. President of the Council to preside at meetings of the Council (1) The President of the Council shall preside at every general meeting of the Association and if there be no such Chairman, or if at any meeting he shall not be present within fifteen minutes after the time appointed for holding the meeting, or shall be unwilling to preside, the Vice-President of the Council shall preside and in his absence a member of the Council evaluated by the members present shall preside. (2) Where no member of the Council is present to take the chair, the members present shall appoint one of their number to be the Chairman. 20. How resolutions are decided At all general meetings of the Association, a resolution put to the vote of the meeting shall be decided by a show of hands by a majority of the members present and voting, unless before or upon the declaration of the result of the show of hands a poll be demanded in writing by the President or by elected five members present in person and entitled to vote and unless a poll be so demanded a declaration by the President of the meeting that a resolution has been carried by a particular majority, shall be conclusive and an entry made to that effect in the minute book of the Association, shall be conclusive evidence therefore, without proof of the number or proportion of the votes recorded in favour of or against such resolution."
    },
    {
      "provision_ref": "s21",
      "section": "21",
      "title": "How poll to be taken",
      "content": "21. How poll to be taken If a poll is demanded in the manner specified in regulation 20 of the Regulations, it shall be taken at such time and place, and in such manner as the President of the Council shall direct and the result of the poll shall be deemed to be the resolution of the meeting at which the poll was demanded."
    },
    {
      "provision_ref": "s22",
      "section": "22",
      "title": "No poll in certain cases",
      "content": "22. No poll in certain cases No poll shall be demanded on the election of a President of a meeting or on any question of adjournment."
    },
    {
      "provision_ref": "s23",
      "section": "23",
      "title": "Equality of votes",
      "content": "23. Equality of votes In the case of an equality of votes, whether on a show of hands or on a poll, the Chairman of the meeting at which the show of hands takes place or at which the poll is demanded shall be entitled to a second or casting vote."
    },
    {
      "provision_ref": "s24",
      "section": "24",
      "title": "Consequence of a demand for a poll",
      "content": "24. Consequence of a demand for a poll The demand of a poll shall not prevent the continuance of a meeting for the transaction of any business other than the question on which a poll has been demanded."
    },
    {
      "provision_ref": "s25",
      "section": "25",
      "title": "Votes of members",
      "content": "25. Votes of members Every member of the Association whose subscription shall have been paid for the current year shall be entitled to one vote at every meeting of the Association"
    },
    {
      "provision_ref": "s26",
      "section": "26",
      "title": "Members in arrears",
      "content": "26. Members in arrears Save as herein expressly provided, no person shall, at a general meeting of the Association other than a member duly registered and who has paid every subscription and such other sum (if any) which shall be due and payable to the Association in respect of his membership, be entitled to be present or to vote on any question either personally or by proxy or as proxy for any other member."
    },
    {
      "provision_ref": "s27",
      "section": "27",
      "title": "Proxies",
      "content": "27. Proxies On a poll, votes may be given either personally or by proxy and a proxy shall be a member of the Association entitled to be present and liable to vote."
    },
    {
      "provision_ref": "s28",
      "section": "28",
      "title": "Instrument",
      "content": "28. Instrument (1) The instrument appointing a proxy as provided in the Schedule to these Regulations shall be in writing under the hand of the appointer or his attorney duly authorised in writing. [Schedule.] (2) The instrument appointing a proxy and the power of attorney (if any) under which it is signed or a certified copy thereof shall be deposited at the registered office of the Association at least seventy-two hours before the time appointed for holding the meeting at which the person's name in such instrument proposes to vote, otherwise the person so named shall not be entitled to vote in respect thereof and the instrument appointing him shall be valid only for purposes of that meeting or its adjournment thereof."
    },
    {
      "provision_ref": "s29",
      "section": "29",
      "title": "Effect of vote by proxy",
      "content": "29. Effect of vote by proxy A vote given in accordance with the terms of an instrument of proxy shall be valid notwithstanding the previous death of the appointer or revocation of the proxy, provided that, no intimation in writing of the death or revocation shall have been received during office hours at least before the time fixed for holding that meeting. Council of the Association"
    },
    {
      "provision_ref": "s30",
      "section": "30",
      "title": "Composition of the Council",
      "content": "30. Composition of the Council (1) The Council shall be deemed for all purposes to be the governing body of the Association. (2) The Council shall consist of the number of members specified in the Act and shall be nominated by the Association of an annual general meeting on the recommendation of the Council."
    },
    {
      "provision_ref": "s31",
      "section": "31",
      "title": "Power to appoint additional members of Council",
      "content": "31. Power to appoint additional members of Council The Council may, from time to time, and at any time, appoint any member of the Association as a member of the Council, to fill a vacancy in the Council, provided that the prescribed maximum shall not be exceeded and any member so appointed shall retain his office only until the next annual general meeting and shall be eligible for re-nomination."
    },
    {
      "provision_ref": "s32",
      "section": "32",
      "title": "Age limit for Council membership",
      "content": "32. Age limit for Council membership No person shall be eligible to hold office as a member of the Council, unless he is 40 years old and not more than 65 years of age."
    },
    {
      "provision_ref": "s33",
      "section": "33",
      "title": "Disclosure of personal interest",
      "content": "33. Disclosure of personal interest Any member of the Council or of a committee thereof, who has a personal interest in any contract or arrangement entered into or proposed to be considered by the Council, or a committee thereof, shall forthwith disclose his interest to the Council or the committee, as the case may be, and shall not vote on any question relating to such contract or arrangement."
    },
    {
      "provision_ref": "s34",
      "section": "34",
      "title": "Restriction of voting in Council",
      "content": "34. Restriction of voting in Council No member of the Council shall be disqualified from acting as such only by reason of his being so interested, but he shall not be eligible to vote at the meeting of the Council on any matter relating to any operation, undertaking, or business in which he is interested, either individually or as a member of a partnership or as a director or officer of a body corporate or corporation, and if he shall so vote, his vote shall not be counted. Powers of the Council"
    },
    {
      "provision_ref": "s35",
      "section": "35",
      "title": "Power of the Council",
      "content": "35. Power of the Council (1) The business of the Association shall be managed by the Council which may exercise all the powers of the Association and do on behalf of the Association all such acts as may be exercised and done by the Association and as are not by virtue of this Act or these Regulations required to be so exercised: provided that, it shall be done by the Association at a general meeting. (2) No regulation made by the Association at a general meeting shall invalidate any prior act of the Council, which would have been valid, if such regulation has not been made."
    },
    {
      "provision_ref": "s36",
      "section": "36",
      "title": "Continuing members of the Council may act to fill vacancies or summon meetings",
      "content": "36. Continuing members of the Council may act to fill vacancies or summon meetings Notwithstanding any vacancy in the Council, the continuing membership on the Council may at any time be reduced in number to less than the maximum number prescribed by or in accordance with these Regulations and it shall be lawful for such members to continue to act at a general meeting of the members, but not for any other purpose. Common Seal"
    },
    {
      "provision_ref": "s37",
      "section": "37",
      "title": "Affixing of common seal",
      "content": "37. Affixing of common seal (1) The Association shall have a common seal which shall be kept in the custody of the Registrar who shall produce it when it is required for use by the Association. (2) All legal matters required to be executed by the Association shall be signed by the President and the Registrar and sealed with the common seal of the Association. (3) The common seal of the Association shall not be affixed to any instrument except by authority of a resolution of the Council, and in the presence of at least two members of the Council and the Registrar, and the members and Registrar shall sign every instrument to which the common seal shall be affixed in their presence and in favour of any purchaser or person bona fide dealing with the Association and such signatures shall be conclusive of the fact that the common seal was properly affixed."
    },
    {
      "provision_ref": "s38",
      "section": "38",
      "title": "How rules may be made or varied and the matters to which they may relate",
      "content": "38. How rules may be made or varied and the matters to which they may relate (1) The Council may, from time to time, make rules for carrying on the business of the Association and may at any time at an annual general meeting vary any rules so made, and all rules so made and for the time being in force shall be binding on the members of the Association and shall have full effect accordingly. (2) The subject of the rules referred to in sub-paragraph (1) of this regulation shall, among other things, include the matters set out hereunder, that is- (a) the annual or other subscriptions or payment to be payable by members of the Association; (b) the rights and privileges which shall be accorded to the members of the Association; (c) the qualifications, restrictions and conditions which will be in accordance with the provisions of section 8 of the Act; (d) the qualifying initials and designation to be used by members of the Association; (e) committees connected with the management of the Association, the Registrar and all the officers of the Association (other than the auditors) and the appointment, removal, qualifications, disqualifications, duties, functions, powers and privileges of the Registrar and all other officers, of the Association (other than auditors) and members of the committees; (f) branches or district centres committees; (g) creation and maintenance of the fund of the Association; (h) arrangements with other associations for reciprocal concession; (i) the year-book of the association, journals, publication of papers or books or such other papers as may be conducive to the welfare and advancement of the objectives of the Association; (j) the postal ballot for the purpose of nominating members of the Council and the procedure in connection therewith: Provided that no rules shall be made pursuant to this regulation which would amount to such an addition or an alteration of those Regulations which may only lawfully be made at a special resolution of the Association. Disqualification of Members of the Council"
    },
    {
      "provision_ref": "s39",
      "section": "39",
      "title": "Vacation of office",
      "content": "39. Vacation of office The office of a member of the Council shall become vacant if- (a) a receiving order is made against him; or (b) he makes any arrangement with his creditors; (c) he becomes a lunatic or is of unsound mind; (d) he ceases to be a member of the Association; (e) by notice in writing to the Association he resigns his office; or (f) he ceases to hold office by virtue of any provisions of the Act. Rotation of Membership of the Council"
    },
    {
      "provision_ref": "s40",
      "section": "40",
      "title": "One third of members of Council to retire",
      "content": "40. One third of members of Council to retire (1) At an annual general meeting of the Association one third of the members of the Council for the time being or if their number is not a multiple of three, then the number nearest to but not exceeding one third, shall retire from office. (2) A retiring member of the Council shall retain his office until the dissolution or adjournment of the meeting at which his successor shall be nominated or it is determined not to fill his place."
    },
    {
      "provision_ref": "s41",
      "section": "41",
      "title": "Retirement by rotation",
      "content": "41. Retirement by rotation (1) The members of the Council retiring shall be those who have been longest in office since their last nomination or appointment and as between members of equal seniority, the members to retire shall, in the absence of an agreement, be selected from among them by ballot. (2) The length of time a member has been in office shall be computed from his last nomination or appointment. (3) A retiring member of the Council may be eligible for re-nomination."
    },
    {
      "provision_ref": "s42",
      "section": "42",
      "title": "Renomination of retiring member",
      "content": "42. Renomination of retiring member A retiring member of the Council eligible for re-nomination shall, unless he shall have signified his desire not to offer himself for re-nomination, be deemed to be nominated."
    },
    {
      "provision_ref": "s43",
      "section": "43",
      "title": "Vacancies to be filled",
      "content": "43. Vacancies to be filled The Association may, at the meeting at which any member of the Council retires in any manner whatsoever, fill the vacant office of the member by nominating another member thereto unless at such meeting it shall be determined to reduce the number of members of the Council."
    },
    {
      "provision_ref": "s44",
      "section": "44",
      "title": "Notice to be given for re-nomination",
      "content": "44. Notice to be given for re-nomination (1) No person, except as a member of the Council, retiring at the meeting or seeking re-nomination, and on the recommendation of the Council, shall be eligible for nomination to the Council except if notice in writing shall be given to the Registrar not less than one month before the day appointed for the meeting and the notice shall be required to be signed by ten members duly qualified to vote on such nomination, and also the notice in writing signed by the person nominated of his willingness to be nominated. (2) No nomination shall be valid if the person nominated, or any of his nominators, is under any pecuniary liability to the Association."
    },
    {
      "provision_ref": "s45",
      "section": "45",
      "title": "Removal of members",
      "content": "45. Removal of members (1) In the event of any member of the Council failing to attend six consecutive meetings of the Council, of which he has been duly notified, the Council may, unless his absence was caused by illness (or other circumstances which in the opinion of the Council may cause his absence) resolve that he shall cease to be a member of the Council and the Association may nominate another member to fill the vacancy thus created. (2) The Association may, by an ordinary resolution of which special notice shall have been given, remove any member of the Council before the expiration of his tenure of office, and may by an ordinary resolution appoint another member in his stead provided that any person so appointed shall retain his office for only such period as the member in whose place he was appointed would have held the same if he had not been removed. Proceedings of the Council"
    },
    {
      "provision_ref": "s46",
      "section": "46",
      "title": "Meetings of Council and quorum and casting vote of President",
      "content": "46. Meetings of Council and quorum and casting vote of President (1) The Council may meet together for the dispatch of its business, adjourn and otherwise regulate its meetings as it may think fit, and determine the quorum necessary for the transaction of its business and, unless otherwise determined by the Council, the quorum at every meeting of the Council shall be five. (2) Questions arising at any meeting of the Council shall be decided by a majority of votes and in the case of an equality of votes, the President shall have a second or casting vote."
    },
    {
      "provision_ref": "s47",
      "section": "47",
      "title": "Fourteen days' notice of meeting of Council required",
      "content": "47. Fourteen days' notice of meeting of Council required (1) Council meetings shall be called by the Registrar at any time at the request of the president or of five members of the Council giving fourteen clear days' notice to the members of the Council. (2) A member of the Council who is absent from Nigeria shall not be entitled to notice of a meeting."
    },
    {
      "provision_ref": "s48",
      "section": "48",
      "title": "Nomination of President and Vice-President",
      "content": "48. Nomination of President and Vice-President (1) The Council shall, from time to time nominate one of their number to act as President and another as Vice-President, both of whom shall hold office for two consecutive years after the annual general meeting. (2) The President, or in his absence the Vice-President, shall preside at all meetings of the Council and in their absence within thirty minutes after the time appointed for holding the meeting. The members of the Council present shall appoint one of their number to be the President for purposes of that meeting."
    },
    {
      "provision_ref": "s49",
      "section": "49",
      "title": "Quorum competent to exercise all the powers of Council",
      "content": "49. Quorum competent to exercise all the powers of Council A meeting of the members of the Council for the time being at which a quorum is present shall be competent to exercise all the authority, powers and discretions by or under the regulations of the Association for the time being vested in the Council."
    },
    {
      "provision_ref": "s50",
      "section": "50",
      "title": "Committees of the Council",
      "content": "50. Committees of the Council (1) The Council may appoint committees in accordance with the rules for the time being in force, and subject to any rules, the Council may delegate any of its functions to committees consisting of such number of members of the Council or of the Association as it thinks fit, and any committees so formed shall conform to any regulations imposed on it by the Council. (2) The meetings and proceedings of any such committee shall be governed by the provisions of these regulations for regulating its meetings."
    },
    {
      "provision_ref": "s51",
      "section": "51",
      "title": "All acts done by Council or committees to be valid",
      "content": "51. All acts done by Council or committees to be valid All acts bona fide done at any meeting of the Council for any person acting as a member of the Council, or of any committee, notwithstanding that there was any defect in the appointment on the Council or committee or the appointment of any person or member of the Council or committee acting as aforesaid, or that they or any of them were not qualified at the time of their appointment, or have become disqualified shall be as valid as if such Council or committee were appointed without any defect."
    },
    {
      "provision_ref": "s52",
      "section": "52",
      "title": "Minutes of proceedings",
      "content": "52. Minutes of proceedings The Council shall cause proper minutes to be kept of the proceedings of the meetings of the Association, Council or committees and all businesses transacted at such meetings or any such minutes of any meeting if purporting to be signed by the chairman of the meeting, or by the chairman of all succeeding meetings, shall be conclusive evidence of the proceedings therein without any further proof of the fact therein stated. Disciplinary Tribunal"
    },
    {
      "provision_ref": "s53",
      "section": "53",
      "title": "Disciplinary Tribunal",
      "content": "53. Disciplinary Tribunal (1) A Disciplinary Tribunal shall be constituted with the powers and for purposes specified in section 11 of the Act. (2) The Disciplinary Tribunal shall consist of the Chairman and six other members who shall be appointed by the Council from among the members of the Council and the quorum shall be four."
    },
    {
      "provision_ref": "s54",
      "section": "54",
      "title": "Membership of the Disciplinary Tribunal",
      "content": "54. Membership of the Disciplinary Tribunal All vacancies, from time to time, occurring in the Disciplinary Tribunal shall be filed by the Council, but the Disciplinary Tribunal may act notwithstanding any vacancy in its membership: Provided that, the members shall not be less than four."
    },
    {
      "provision_ref": "s55",
      "section": "55",
      "title": "Suspension of membership",
      "content": "55. Suspension of membership (1) The Disciplinary Tribunal shall meet at such times and in such places as may from time to time, be found expedient and minutes shall be kept of all proceedings of the Disciplinary Tribunal. (2) The Disciplinary Tribunal may suspend any member of the Association, who is proved to the satisfaction of the Disciplinary Tribunal to have been guilty of a discreditable act or conduct and that member shall be stopped from the exercise of all rights and privileges as a member during such period as it may think fit, or it may censure any member for any act or conduct which in its opinion is so expedient: Provided that, at least five members of the Disciplinary Tribunal are present at the meeting at which the suspension or censure shall be resolved. (3) If any member of the Disciplinary Tribunal shall, in the opinion of the Investigation Panel be guilty or if any member shall either before or after his admission to the Association be accused of dishonourable conduct, or of conduct which would, in the absence of a satisfactory explanation, be derogatory to the ethics of the Association or render him unfit to remain a member, then the Investigation Panel shall send to such a member at his last registered address, a statement in writing of the conduct imputed to him and shall afford him an opportunity of giving an explanation personally or in writing, as he may elect. (4) If, on the consideration of such explanation, or in the absence of any explanation, the Investigation Panel shall be of the opinion that the member ought to be excluded from the Association, it shall state its opinion in the form of a report to be laid before the Disciplinary Tribunal for further action."
    },
    {
      "provision_ref": "s56",
      "section": "56",
      "title": "Action on report",
      "content": "56. Action on report On any report being laid before the Council by the Disciplinary Tribunal, recommending the exclusion of a member, a meeting of the Council shall be convened and the member may be dealt with as the Council may think fit."
    },
    {
      "provision_ref": "s57",
      "section": "57",
      "title": "Suspension",
      "content": "57. Suspension (1) In the event of the suspension, removal or exclusion of a member, the Council shall be at liberty to cause a notice thereof to be published in such newspaper or journal as it may elect. (2) In the event of the resignation, suspension, removal, or exclusion of a member, or of a member ceasing to be a member, for any other cause, every certificate of membership held by him, shall be delivered up to the Association to be retained during the period of his suspension."
    },
    {
      "provision_ref": "s58",
      "section": "58",
      "title": "Forfeiture of membership on the Council",
      "content": "58. Forfeiture of membership on the Council If it shall appear that a member failed to give adequate information about himself or that the particulars given therein were incorrect or misleading so that the insufficient, inaccurate or misleading information might have been responsible for or have influenced, the granting of the application, the Council may by vote of two thirds of the members of the Council present exclude such member from further membership of the Association. Register of Members"
    },
    {
      "provision_ref": "s59",
      "section": "59",
      "title": "Register of members",
      "content": "59. Register of members The Council shall keep a register of members in respect of each State of the Federation and the Federal Capital Territory, Abuja and the register shall specify the name and address of every member for the time being resident in that State and the Federal Capital Territory, Abuja and the class in which such member is for the time being placed by the Council and the register shall be open to inspection by members of the public at all reasonable times. Funds"
    },
    {
      "provision_ref": "s60",
      "section": "60",
      "title": "Fund",
      "content": "60. Fund (1) All monies, bills and notes belonging to the Association shall be deposited with the Association's bankers in an account to be kept in the name of the Association. (2) All cheques of the Association's bankers, until otherwise resolved by the Council, shall be signed by the President, Registrar and such other member of the Council authorised so to do. (3) The Association's bank accounts shall be kept with such banker or bankers as the Council may, from time to time, determine. Accounts"
    },
    {
      "provision_ref": "s61",
      "section": "61",
      "title": "Accounts to be kept",
      "content": "61. Accounts to be kept (1) The Council shall cause true and correct accounts to be kept- (a) of the assets and liabilities of the Association; (b) of all monies received and expended by the Association and the matters in respect of which such receipts and expenditure were made; and (c) of all sales and purchases of goods by the Association. (2) The books of account of the Association shall be kept at the office, or at such other place or places as the Council may deem fit, and shall be open to inspection by members of the Council and the Association. (3) The Association at a general meeting may, from time to time, make responsible conditions and regulations as to the time and manner for the inspection of the accounts and books of the Association or any of them by members of the Association or of the Council and subject to such conditions and regulations, the accounts and books of the Association shall be open for inspection by members at all reasonable times during business hours."
    },
    {
      "provision_ref": "s62",
      "section": "62",
      "title": "Annual accounts and reports",
      "content": "62. Annual accounts and reports (1) Once, at least in every year, the Council shall cause to be prepared and laid before the Association at a general meeting an income and expenditure account for the previous year made up to a date not more than six months before such meeting. (2) A balance sheet in respect of the accounts of the Association shall be made out in every year at the same date, and laid before the Association at a general meeting and every balance sheet shall be accompanied by a report of the Council as to the affairs of the Association generally and a report of the auditors, and a printed copy of such account, balance sheets, and reports shall not less than twenty clear days before the meeting be served on the auditors and on the members who are entitled to receive notice from the auditors and on the members who are entitled to receive notices from the Association in the manner in which notices are hereinafter directed to be served. (3) At least once in every year the accounts of the Association shall be examined and the correctness of the income and expenditure of the account and balance sheet shall be ascertained by one or more auditors. Notices"
    },
    {
      "provision_ref": "s63",
      "section": "63",
      "title": "Notices to members",
      "content": "63. Notices to members (1) A notice may be served by the Association upon any member either personally or by sending it through the post in a prepaid letter, addressed to the member at his last known registered address as appearing in the register of members. (2) Any member described in the register of members by an address not within Nigeria, shall, from time to time, give the Association an address within Nigeria at which notices may be served upon him at such address, but save as aforesaid, only those members who are described in the register of members by an address within Nigeria shall be entitled to receive any notice from the Association. (3) Any summons, notice, order or such other document required to be sent to or served upon the Association, or upon any officer of the Association, may be sent or served by leaving the same, or sending it through the post in a pre-paid letter addressed to the Association or to such officers at the office. (4) Any notice, if served by post, shall be deemed to have been served on the day following that on which the letter containing the same is put into the post, and in providing such service it shall be sufficient to prove that the letter containing the notice was properly addressed and put into the post office as a pre-paid letter. Rules for regulating Proceedings"
    },
    {
      "provision_ref": "s64",
      "section": "64",
      "title": "Rules for regulating procedure",
      "content": "64. Rules for regulating procedure (1) It shall be lawful for the Council, from time to time, to make rules regulating proceedings, rescind or alter rules, regulations, and standing orders for regulating its proceedings and the procedure of the Association and the management of the members thereof, for the calling of notices, of procedure at meetings, nominations, the service of documents and for all other matters affecting the Association: Provided always that no rule, regulation or standing order shall have any validity or effect which is contrary to the provisions of these Regulations as can only lawfully be made by a special resolution of the Association; accordingly a rule, regulation or standing order of the Association shall not be made except by a resolution of the Council passed by a majority of two thirds of the members present and voting at a meeting of the Council. Registered Office"
    },
    {
      "provision_ref": "s65",
      "section": "65",
      "title": "Registered office",
      "content": "65. Registered office The registered office of the Association shall be No. 248 Herbert Macaulay Street, Yaba, Lagos or at such other place or places as the Council may, from time to time, determine and where any change in the place of the registered office of the Association shall occur it shall be notified in writing to all members of the Association within seven days of the change being made."
    },
    {
      "provision_ref": "s66",
      "section": "66",
      "title": "Income and property",
      "content": "66. Income and property The income and property of the Association whensoever derived shall, be applied solely towards the promotion of the objectives of the Association as provided in the Act and such other subsidiary legislation made thereunder and no portion thereof shall be paid or transferred directly, or indirectly, by way of dividend, bonus, or otherwise."
    },
    {
      "provision_ref": "s67",
      "section": "67",
      "title": "Remuneration",
      "content": "67. Remuneration (1) Nothing in these regulations shall prevent the payment, in good faith, of reasonable and proper remuneration to any officer or servant of the Association or to any member of the Association in return for any service actually rendered to the Association, provided that no member of the Council shall be appointed to any salaried office of the Association, and no remuneration or other benefit in money or money's worth shall be given by the Association to any member of the Council except repayment of out-of-pocket expenses or reasonable and proper rent for premises demised, or let to the Association. (2) The provisions of sub-paragraph (1) of this regulation shall not apply to any payment to any body corporate or to a member of the Association made by a body corporate in which the member shall hold not more than one hundredth part of the share capital, and the member shall not be bound to account for any share of profits he may receive in respect of any such payment."
    },
    {
      "provision_ref": "s68",
      "section": "68",
      "title": "Submission to Minister",
      "content": "68. Submission to Minister No addition, alteration, or amendment shall be made to these Regulations for the time being in force unless the same shall have been submitted to the Minister. Interpretation"
    },
    {
      "provision_ref": "s69",
      "section": "69",
      "title": "Interpretation",
      "content": "69. Interpretation In these Regulations, unless the context otherwise requires- \"Act\" means the Association of National Accountants of Nigeria Act; [Cap. 26.] \"Minister\" means the Minister charged with responsibility for Finance."
    },
    {
      "provision_ref": "s70",
      "section": "70",
      "title": "Citation",
      "content": "70. Citation These Regulations may be cited as the Association of National Accountants of Nigeria Regulations. SCHEDULE [Regulation 28.] The Association of National Accountants of Nigeria .........................................................................................................of...................................................................................................... &hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;. being a member of the Association of National Accountants of Nigeria hereby appoint..........................................................................................................................................of ........................................................................................................................................................................ a member of the Association of National Accountants of Nigeria and failing him...................................................................................................of &hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;... .......................................................................................................... another member of the Association of National Accountants of Nigeria, as my proxy to vote on my behalf at the annual general meeting of the Association of National Accountants of Nigeria to be held on the ............day of .................................................... 20.................. or at any adjournment date. As witness my hand this ...................day of &hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;................20 .......................... ____________________ ASSOCIATION OF NATIONAL ACCOUNTANTS OF NIGERIA RULES [S.1. 13 of 1995.] under sections 6 and 18 [Commencement. ] [14th September, 1995] 1. Financial year The Association's financial year shall commence on the first day of January in each year and the Association's subscription year shall commence on the first day of January in each year. Membership 2. Direct membership (1) As from the 31st December 1996, the members of the accountancy bodies mentioned in the First Schedule to these Rules shall cease to be accepted for direct membership of the Association and the holders of the qualifications mentioned in the Second and Third Schedules to these Rules shall cease to be admitted as direct members of the Association from 1st January 1996. [First, Second and Third Schedules.] (2) A person shall not be qualified to become a member of the Association unless- (a) he has obtained an approved degree or a Higher National Diploma in Accountancy; or (b) he has passed the professional examination at the Nigerian College of Accountancy which shall be established and administered by the Association; or (c) he has undergone a two-year supervised practical experience training programme as an accountant - in-training. (3) The Council shall, from time to time, publish the list of universities whose award of degrees are approved for admission into the Nigerian College of Accountancy; however, a degree in Accountancy obtained from any of the Nigerian universities and polytechnics shall be deemed an acceptable qualification for membership of the Association. (4) The Council may approve a degree in Accountancy from any overseas universities, if it deems it fit and is satisfied that the course of study and the standard of examination are comparable and equivalent to those of Nigerian universities; however, final certificates of the bodies of accountants recognised by the Act are acceptable as qualification for membership of the Association."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Admission and election of members",
      "content": "3. Admission and election of members All applications for admission to membership of the Association shall be submitted on the prescribed form to the membership committee of the Association, whose duty it shall be to enquire into the professional experience, standing and general character of the applicant and the committee's recommendation in each case shall be submitted to the Council."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Power to grant or refuse admission",
      "content": "4. Power to grant or refuse admission The members of the Council shall consider each application together with the membership committee's report thereon, and shall in its absolute discretion determine the conditions upon which an applicant shall be admitted to membership of the Association, or it may adjourn the consideration of any application and postpone the election of an applicant, or may refuse to admit an applicant to membership without disclosing the reason for such refusal and the Council's decision in all matters relating to admission to membership shall be final. 5. Re-admission to membership In case of a person whose membership has ceased in accordance with the provisions of the Act or the Regulations made thereunder, the Council may, by unanimous resolution at a meeting convened with notice of the object, and upon such conditions as it may think fit, admit or refuse to readmit an applicant without disclosing any reason for such refusal. 6. Age of admission No person shall be eligible for admission as a member of the Association unless he has attained the age of twenty-five years. 7. Entrance fee Every application for membership of the Association shall be accompanied by the entrance fee, which shall be non-refundable."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Members entitled to use designation and distinctive letters",
      "content": "8. Members entitled to use designation and distinctive letters Any person who is elected to membership of the Association shall, while he remains a member of the Association, be entitled to use the professional designation of \"National Accountant\" indicating that he is a member of the Association and to use after his name, the initial NNA (Nigerian National Accountant). 9. Certificate of membership (1) Every member of the Association shall on admission be entitled to a certificate of membership under the common seal of the Association, but such certificate shall at all times remain the property of the Association, and shall be returned to the Association on demand. (2) In the event of the registration, removal, exclusion or suspension of a member, or of a member for any other cause, the certificate of membership held by him shall be delivered up to the Association to be cancelled or retained during the period of suspension. 10. Restriction on use of designation and distinctive letters A member of the Association practising in partnership with any person not being a member of the Association shall not use after the title of that firm the initials \"NNA\" or describe the firm in any way whatsoever as \"Public National Accountants\". Annual subscription 11. Annual subscription (1) Non-practising members of the Association shall, for the time being, pay an annual subscription as may be published annually by the Council. (2) Any member of the Association who fails to pay the annual subscription by the following 1st day of April, shall cease to be a member of the Association, and his name shall be removed from the Association's register without any formal notice. (3) The Council may in its discretion and on the application of a member reduce the subscription payable for any particular year if the member has attained the age of 65 years and has retired from practice and all other business activities or from employment. (4) A full year's subscription shall be payable on application for membership. (5) All subscriptions, other than subscriptions payable on admission, shall be payable in advance on the first day of January in each year. 12. Membership of the Association (1) In accordance with the provisions of section 3 of the Act the membership of the Council shall be eighteen and the members shall from among themselves appoint the following officers for the purpose of executing the Council decisions and policies- (a) the President; (b) the Vice-President; (c) the incoming President; (d) the Treasurer; and (e) the Membership Secretary. (2) The incoming President who shall have held office for a period of twelve months in that capacity, shall be appointed to understudy and succeed the president at the expiration of his tenure of office: Provided that, the ascension to the post of President by the incoming President shall be subject to the approval of the Council on the recommendation of the President or any other member of the Council, not later than six months after the nomination; accordingly if the Council shall decide to change the incoming President to another member of the Council, such replacement shall only be eligible to complete the remaining period of the tenure of office of the President. (3) New members of the Council shall be presented annually at a general meeting of the Association. Committees of the Council 13. Committees (1) The Council at its first meeting shall proceed to appoint the following committees, that is- (a) Finance and General Purposes; (b) Membership; (c) Practising; (d) Education and Training; (e) Law and Parliamentary; (f) Investigation Panel; (g) Disciplinary Tribunal; (h) Commercial and Industrial; (i) Publicity and Conferences; (j) Continuing Professional Education; (k) Branches and District; (l) Benevolent Fund; (m) Research and Technical; (n) Public Sector (Public Services); (o) Examination; and (p) such other committees as may be determined by the Council from time to time. (2) Each committee shall consist of nine members, or such other number of members as the Council may deem necessary, unless otherwise determined by the Council; five members shall form a quorum of each of the committees and shall meet as and when required for the transaction of its business. (3) At the first meeting of each committee, the members thereof shall appoint one of their member to act as chairman; so however, that a Council member shall not be qualified to be the Chairman of a branch or district committee. (4) The Council shall have the power to fill any vacancies on any committee of the Council and to suspend or remove any member for misconduct. (5) The President and Vice-President of the Council, for the time being shall be ex-officio members of all committees of the Council. (6) Each committee of the Council shall exercise such powers and perform such duties as are specified by the Council, or as may be vested in or assigned to it by the Council from time to time, and all matters dealt with shall be submitted to the Council at the next succeeding meeting of the Council. Power and Duties of Committees 14. Powers and duties of Committees The powers and duties of the committees shall be as follows- (a) the Finance and General Purposes Committee shall deal with all matters relating to- (i) the accounts and financial affairs of the Association; (ii) the sanctioning of items of expenditure, and drawing and signing of cheques thereof; and (iii) the investment of the funds of the Association; (b) the Membership Committee shall deal with all matters relating to- (i) the consideration of applications for admission to membership of the Association; (ii) the welfare of members; and (iii) students and accountant-in-training registration; (c) the Practising Committee shall deal with all matters relating to- (i) scrutinising all applications for practising certificates and interviewing of members who wish to set up public practice and make recommendations to the Council; (ii)setting, from time to time, auditing standards and formulating accounting standards to be adhered to by members of the association whether as practitioners or non-practitioners; and (iii) promoting interaction between the Association's practitioners; (d) the Education and Training Committee shall advise and report to the Council on all matters relating to the professional examinations, practical experience training, including regulations for the conduct of professional examinations and supervising the Nigerian College of Accountancy; (e) the Law and Parliamentary Committee shall deal with all matters relating to- (i) bills and proposals made or actions taken by any extra-ministerial department, body corporate or association of individuals affecting the interest of the members of the Association as a whole; and (ii) all legal matters and to investigating all matters reported to it; (f) the Investigating Panel shall deal with the investigation of all matters referred to it by the Council in accordance with section 11 (3) of the Act; (g) the Disciplinary Tribunal, in pursuance of the provisions of section 11 of the Act, shall deal with all reports of the Investigating Panel on matters relating to- (i) unprofessional conduct of members; and (ii) the conduct of members deemed to be derogatory to the Association; (h) the Commercial and Industrial members employed in both the private and public sectors shall deal with- (i) the creation of awareness among members employed in both the private and public sectors; and (ii) the promotion of the image of the Association among various chambers of commerce and other business communities; (i) the Publicity and Conference Committee shall deal with matters relating to the public image of the Association in collaboration with other professional and business organisations; (j) the Continuing Professional Education Committee shall deal with matters relating to continuing professional education of members of the Association by organising and arranging shor"
    },
    {
      "provision_ref": "s20",
      "section": "20",
      "title": "Relationship with overseas bodies",
      "content": "20. Relationship with overseas bodies (1) Members of the Council or of any committee of the Council shall not act or represent the interests of any overseas body of accountants in any capacity whatsoever. (2) Members of the Council or of any committee of the Council who so acts shall cease to be a member of the Council or of any committee of the Council. (3) Furthermore, the case of the member referred to in sub-paragraph (2) of this rule may be referred to the Investigation Panel for necessary action. 21. Interpretation In these Rules, unless the context otherwise requires- \"Act\" means the Association of National Accountants of Nigeria Act. [Cap. A26.] 22. Citation These Rules may be cited as the Association of National Accountants of Nigeria Rules. __________________ FIRST SCHEDULE [Rule 2.] (a) The Association of International Accountants (UK); (b) The Chartered Association of Certified Accountants (UK); (c) The Institute of Chartered Accountant of England and Wales; (d) The Institute of Chartered Accountants (Scotland); (e) The Institute of Chartered Accountant (Ireland); (f) The Institute of Chartered Accountants (Canada); (g) The Institute of Certified Public Accountants (USA); (h) The Institute of Company Accountants (UK); (i) The Chartered Institute of Public Finance and Accountancy (UK); (j) The Chartered Institute of Management Accountants (UK). _________________ SECOND SCHEDULE [Rule 2.] A graduate in accountancy from any Nigerian university or other approved overseas university who obtained his bachelor's degree or Higher National Diploma in accountancy not later than 30 June 1975, and has been continuously engaged in a senior accounting position. _________________ THIRD SCHEDULE [Rule 2.] A citizen of Nigeria who was, immediately before the commencement of this Act, an Accountant-General, Auditor-General, chief accountant in the public service of the Federation or of a State, Extra-Ministerial Department, or a Director of State Internal Revenue, or a chief accountant of any company quoted on the Nigerian Stock Exchange, provided that he possesses a Bachelor's degree in Accountancy or its equivalent qualification in Accountancy."
    }
  ],
  "definitions": [
    {
      "term": "Act",
      "definition": "the Association of National Accountants of Nigeria Act",
      "source_provision": "s69"
    },
    {
      "term": "Minister",
      "definition": "the Minister charged with responsibility for Finance",
      "source_provision": "s69"
    }
  ]
}