{
  "id": "carriage-of-goods-by-sea-act",
  "type": "statute",
  "title": "CARRIAGE OF GOODS BY SEA ACT",
  "title_en": "CARRIAGE OF GOODS BY SEA ACT",
  "short_name": "CARRIAGE OF GOODS BY SEA ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=58",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title and saving",
      "content": "1. Short title and saving (1) This Act may be cited as the Carriage of Goods by Sea Act. (2) Nothing in this Act shall affect the operation of sections 247, 248, 249, 252, 382 and 383 of the Merchant Shipping Act as amended by any subsequent enactment, or the operation of any other enactment for the time being in force limiting the liability of the owner of sea-going vessels. [Cap. M11.] (3) The Rules shall not by virtue of this Act apply to any contract for the carriage of goods by sea made before the 1st day of January, 1926, or to any bill of lading or similar document of title issued, whether before or after the 1st day of January, 1926, in pursuance of any such contract as aforesaid."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Application of Rules in Schedule",
      "content": "2. Application of Rules in Schedule Subject to the provisions of this Act, the Rules shall have effect in relation to and in connection with the carriage of goods by sea in ships carrying goods from any port in Nigeria to any other port whether in or outside Nigeria."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Absolute warranty of seaworthiness not to be implied in contracts to which Rules apply",
      "content": "3. Absolute warranty of seaworthiness not to be implied in contracts to which Rules apply There shall not be implied in any contract for the carriage of goods by sea to which the Rules apply any absolute undertaking by the carrier of the goods to provide a seaworthy ship."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Statement as to application of Rules to be included in bills of lading",
      "content": "4. Statement as to application of Rules to be included in bills of lading Every bill of lading or similar document of title issued in Nigeria, which contains or is evidence of any contract to which the Rules apply, shall contain an express statement that it is to have effect subject to the provisions of the said Rules as applied by this Act."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Modification of Article VI of Rules in relation to coasting trade",
      "content": "5. Modification of Article VI of Rules in relation to coasting trade Article VI of the Rules shall, in relation to the carriage of goods by sea in ships carrying goods from any port in Nigeria to any other port in Nigeria, have effect as though the said Article referred to goods of any class instead of to particular goods and as though the proviso to the second paragraph of the said Article were omitted."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Modification of Rules 4 and 5 of Article III in relation to bulk cargoes",
      "content": "6. Modification of Rules 4 and 5 of Article III in relation to bulk cargoes Where under the custom of any trade the weight of any bulk cargo inserted in the bills of lading is a weight ascertained or accepted by a third party other than the carrier or the shipper, and the fact that the weight is so ascertained or accepted is stated in the bills of lading, shall not be deemed to be prima facie evidence against the carrier of the receipt of goods of the weight so inserted in the bill of lading, and the accuracy thereof at the time of shipment shall not be deemed to have been guaranteed by the shipper. ______________________________ SCHEDULE Rules relating to bills of lading ARTICLE I Definitions In these Rules the following expressions have the meanings hereby assigned to them respectively, that is to say- \"carriage of goods\" covers the period from the time when the goods are loaded on to the time when they are discharged from the ship; \"carrier\" includes the owner or the charterer who enters into a contract of carriage with a shipper; \"contract of carriage\" applies only to contracts covered by a bill of lading or any similar document of title, in so far as such document relates to the carriage of goods by sea, including any bill of lading or any similar document as aforesaid issued under or pursuant to a charter party from the moment at which such bill of lading or similar document of title regulates the relations between a carrier and a holder of the same; \"goods\" includes goods, wares, merchandises, and articles of every kind whatsoever, except live animals and cargo which by the contract of carriage is stated as being carried on deck and is so carried; \"ship\" means any vessel used for carriage of goods by sea. ARTICLE II Risks Subject to the provisions of Article VI, under every contract of carriage of goods by sea the carrier, in relation to the loading, handling, stowage, carriage, custody, care and discharge of such goods, shall be subject to the responsibilities and liabilities, and entitled to the rights and immunities, hereinafter set forth. ARTICLE III Responsibilities and liabilities 1. The carrier shall be bound, before and at the beginning of the voyage, to exercise due diligence to- (a) make the ship seaworthy; (b) properly man, equip, and supply the ship; (c) make the hold, refrigerating and cool chambers, and all other parts of the ship in which goods are carried, fit and safe for their reception, carriage and preservation. 2. Subject to the provisions of Article IV, the carrier shall properly and carefully load, handle, stow, carry, keep, care for and discharge the goods carried. 3. After receiving the goods into his charge, the carrier, or the master or agent of the carrier, shall, on demand of the shipper, issue to the shipper a bill of lading showing among other things- (a) the leading marks necessary for identification of the goods as the same are furnished in writing by the shipper before the loading of such goods starts: Provided such marks are stamped or otherwise shown clearly upon the goods if uncovered, or on the cases or coverings in which such goods are contained, in such a manner as should ordinarily remain legible until the end of the voyage; (b) either the number of packages or pieces, or the quantity, or weight, as the case may be, as furnished in writing by the shipper; (c) the apparent order and condition of the goods: Provided that no carrier, master or agent of the carrier shall be bound to state or show in the bill of lading any marks, number, quantity, or weight which he has reasonable grounds for suspecting not accurately to represent the goods actually received, or which he has had no reasonable means of checking. 4. Such a bill of lading shall be prima facie evidence of the receipt by the carrier of the goods as therein described in accordance with sub-paragraphs 3 (a), (b), and (c) of this Schedule. 5. The shipper shall be deemed to have guaranteed to the carrier the accuracy at the time of shipment of the marks, number, quantity, and weight, as furnished by him, and the shipper shall indemnify the carrier against all loss, damages and expenses arising or resulting from inaccuracies in such particulars. The right of the carrier to such indemnity shall in no way limit his responsibility and liability under the contract of carriage to any person other than the shipper. 6. Unless notice of loss or damage and the general nature of such loss or damage be given in writing to the carrier or his agent at the port of discharge before or at the time of the removal of the goods into the custody of the person entitled to delivery thereof under the contract of carriage, or, if the loss or damages be not apparent, within three days, such removal shall be prima facie evidence of the delivery by the carrier of the goods as described in the bill of lading. The notice in writing need not be given if the state of the goods has at the time of their receipt been the subject of joint surveyor inspection. In any event the carrier and the ship shall be discharged from all liability in respect of loss or damage unless suit is brought within one year after delivery of the goods or the date when the goods should have been delivered. In the case of any actual or apprehended loss or damage, the carrier and the receiver shall give all reasonable facilities to each other for inspecting and tallying the goods. 7. After the goods are loaded the bill of lading to be issued by the carrier, master or agent of the carrier, to the shipper shall, if the shipper so demands, be a \"shipped\" bill of lading, provided that if the shipper shall have previously taken up any document of title to such goods, he shall surrender the same as against the issue of the \"shipped\" bill of lading, but at the option of the carrier such document of title may be noted at the port of shipment by the carrier, master, or agent with the name or names of the ship or ships upon which the goods have been shipped, and the date or dates of shipment, and when so noted the same shall for the purpose of this Article be deemed to constitute a \"shipped\" bill of lading. 8. Any clause, covenant or agreement in a contract of carriage relieving the carrier or the ship from liability for loss or damage to or in connection with goods arising from negligence, fault or failure in the duties and obligations provided in this Article or lessening such liability otherwise than as provided in these Rules, shall be null and void and of no effect. A benefit of insurance or similar clause shall be deemed to be a clause relieving the carrier from liability. ARTICLE IV Rights and immunities 1. Neither the carrier nor the ship shall be liable for loss or damage arising or resulting from unseaworthiness unless caused by want of due diligence on the part of the carrier to make the ship seaworthy, and to secure that the ship is properly manned, equipped and supplied, and to make the holds, refrigerating and cool chambers and all other parts of the ship in which goods are carried fit and safe for their reception, carriage and preservation in accordance with the provisions of paragraph 1 of Article III. Whenever loss or damage has resulted from unseaworthiness, the burden of proving the exercise of due diligence shall be on the carrier or other person claiming exemption under this section. 2. Neither the carrier nor the ship shall be responsible for loss or damage arising or resulting from- (a) act, neglect, or default of the master, mariner, pilot, or the servants of the carrier in the navigation or in the management of the ship; (b) fire, unless caused by the actual fault or privity of the carrier; (c) perils, dangers and accidents of the sea or other navigable waters; (d) act of God; (e) act of war; (f) act of public enemies; (g) arrest or restraint of princes, rulers or people, or seizure under legal process; (h) quarantine restrictions; (i) act or omission of the shipper or owner of the goods, his a"
    }
  ],
  "definitions": []
}