{
  "id": "centre-for-black-and-african-arts-and-civilisation-act",
  "type": "statute",
  "title": "CENTRE FOR BLACK AND AFRICAN ARTS AND CIVILISATION ACT",
  "title_en": "CENTRE FOR BLACK AND AFRICAN ARTS AND CIVILISATION ACT",
  "short_name": "CENTRE FOR BLACK AND AFRICAN ARTS AND",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=62",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Establishment of the Centre for Black and African Arts and Civilisation",
      "content": "1. Establishment of the Centre for Black and African Arts and Civilisation (1) There is hereby established a body to be known as the Centre for Black and African Arts and Civilisation (in this Act referred to as \"the Centre\") which shall be a body corporate with perpetual succession and a common seal. (2) The affairs of the Centre shall be managed by a body to be known as the Centre for Black and African Arts and Civilisation Management Board."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Membership of the Board",
      "content": "2. Membership of the Board The Board shall consist of a chairman and the following other members, that is to say- (a) the Director of the Centre; (b) an eminent librarian; (c) an eminent archivist; (d) a university scholar in African studies; (e) a representative of the Federal Department of Antiquities; (f) a representative of the Federal Radio Corporation of Nigeria; (g) a representative of the Nigerian Television Authority; (h) a representative of the Federal Ministry of Information and National Orientation; (i) the chairman of the National Committee of the United Nations Educational, Scientific and Cultural Organisation; and (j)three persons appointed for their significant contributions to or interest in cultural matters."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Tenure and other matters relating to members",
      "content": "3. Tenure and other matters relating to members (1) A member of the Board who is not a public officer shall be appointed by the President on the recommendation of the Minister and shall hold office on first appointment for a period of three years and shall be eligible for re-appointment for one further term of three years. (2) A member of the Board who is not a public officer may resign his appointment by a letter addressed to the Minister and that member's resignation shall take effect as from the date of the receipt of the letter by the Minister. (3) Any member of the Board may be removed by the President on the recommendation of the Minister for inability to discharge the functions of his office or for misconduct. (4) Members of the Board who are public officers shall cease to be members of the Board upon ceasing to hold the office entitling them to appointment to the Board. (5) The provisions of the Schedule to this Act shall have effect with respect to the proceedings of the Board and the other matters therein stated. [Schedule.]"
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Functions of the Centre",
      "content": "4. Functions of the Centre (1) The Centre shall be a multi-disciplinary institution and shall, subject to this Act, have responsibility for the promotion of public interest in Black and African arts and civilisation and for the preservation of such creative work of value- (a) of each participating country during the Second World Black and African Festival of Arts and Culture 1977 (in this Act referred to as \"the 1977 Festival\") or similar cultural manifestations; or (b) of any other country or individual where such creative work has emanated from or pertains to the 1977 Festival or similar cultural manifestations, donated to the Centre either directly or through the International Festival Committee of the 1977 Festival or hereafter donated to the Centre by any person or organisation. (2) In pursuance of subsection (1) of this section, it shall be the duty of the Centre- (a) to locate, identify and assemble for better preservation all recorded matter, published materials and museum artefacts relating to the 1977 Festival and to prepare an inventory of these works; (b) to promote understanding and appreciation of Black and African arts and culture by involving the general public in its activities through lectures, discussions, symposia, exhibitions, performances and demonstrations of arts and crafts; (c) to acquire from zonal secretariats of the 1977 Festival and any other source, creative records relating to past and future world, regional or national festivals of arts and culture of relevance to Black and African arts and civilisation; (d) to produce guides, catalogues, bibliographies, abstracts and indices to facilitate the use of the materials preserved at the Centre; (e) to make the facilities of the Centre available to members of the public on such terms as the Board may, with the approval of the Minister, determine; (f) to organise exhibitions, displays and such other manifestations as are calculated to achieve the objects of the Centre; (g) to make appropriate arrangements for the exchange either by way of lending or gift of materials held at the Centre; (h) to supplement the materials held at the Centre by acquiring copies of materials relating to past and future, world, regional or national festivals of arts and culture of relevance to Black and African arts and civilisation; (i) to safeguard the property of the Centre; and (j) to provide such services (other than research) as are usually provided by cultural resources centres."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Director of the Centre",
      "content": "5. Director of the Centre (1) There shall be a director of the Centre (in this Act referred to as \"the Director\") who shall be appointed by the President on the recommendation of the Minister. (2) The Director shall be the chief executive officer of the Centre and shall be charged with the general responsibility for matters affecting the day-to-day management and operations of the Centre."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Secretary and other staff of the Centre",
      "content": "6. Secretary and other staff of the Centre (1) The Board may appoint a Secretary to the Centre who shall- (a) keep the records and conduct the correspondence of the Board; (b) perform such other duties of a secretarial nature as the Board or, as the case may be, the Director may from time to time direct. (2) The Board shall, subject to the provisions of this Act, have power- (a) to appoint such other employees as it may determine; (b) to pay its employees such remuneration and allowances as are payable to persons of equivalent grades in the public service of the Federation; and (c) to determine the conditions of service (including pensions and other retirement benefits) of such employees."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Appointments and Establishments Committee",
      "content": "7. Appointments and Establishments Committee The Board shall set up an Appointments and Establishments Committee consisting of not more than six members of the Board whose functions shall be to advise the Board on matters relating to the appointment (including appointments on promotion and transfer and confirmation of appointments), conditions of service, advancement, determination of appointment of, and other disciplinary measures against, employees holding or acting in any offices in the Centre."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Power of the Minister to give directions",
      "content": "8. Power of the Minister to give directions Subject to this Act, the Minister may give to the Board directions of a general nature or relating generally to particular matters, but not to any particular individual or case with regard to the exercise by the Board of its functions under this Act and it shall be the duty of the Board to comply with the directions."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Financial provisions",
      "content": "9. Financial provisions (1) The Board shall establish and maintain a fund from which shall be defrayed all expenditure incurred by the Centre. (2) There shall be paid and credited to the fund established in pursuance of subsection (1) of this section- (a) such moneys as may, from time to time, be lent or granted to the Centre by the Government of the Federation or of a State; (b) all moneys raised for the purposes of the Centre by way of gift, loan, grant-in-aid, testamentary disposition or otherwise; (c) all subscriptions, fees or charges for services rendered by the Centre; (d) all other assets that may, from time to time, accrue to the Centre. (3) Subject to any general or special direction that may be given in that behalf by the Minister pursuant to this Act, the Board may invest the funds of the Centre and maintain general financial reserves. (4) The Board shall cause to be kept proper accounts of the Centre and proper records in relation thereto and shall, not later than 30 June in each financial year, prepare and submit to the Minister an estimate of the income and expenditure of the Centre during the next succeeding financial year. (5) The Board shall, as soon as may be after the end of the financial year to which the accounts relate, cause the accounts of the Centre to be audited by auditors appointed by the Board from the list and in accordance with the guidelines supplied by the Auditor-General for the Federation."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Annual reports",
      "content": "10. Annual reports The Board shall submit to the President not later than 30 June in each year a report of the activities of the Centre during the preceding financial year and shall include in the report a copy of the audited accounts of the Centre for that year and of the auditors' report thereon."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Regulations",
      "content": "11. Regulations The Minister may, with the approval of the President, make regulations generally for the purpose of giving effect to the provisions of this Act."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Power to make rules",
      "content": "12. Power to make rules The Board may, with the approval of the Minister, make rules in respect of any of its functions under this Act; and without prejudice to the generality of the foregoing, the Board may make rules- (a) for securing the safety of the cultural property at the Centre; and (b) for preserving order within the Centre and preventing damage to property therein."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Interpretation",
      "content": "13. Interpretation In this Act, unless the context otherwise requires- \"the Board\" means the Management Board of the Centre for Black and African Arts and Civilisation established under section 1 (2) of this Act; \"the Centre\" means the Centre for Black and African Arts and Civilisation established under section 1 (1) of this Act; \"the Director\" means the Director of the Centre appointed pursuant to section 5 (1) of this Act; \"the 1977 Festival\" means the Second World Black and African Festival of Arts and Culture held in Nigeria in 1977; \"the Minister\" means the Minister charged with responsibility for cultural matters."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Short title",
      "content": "14. Short title This Act may be cited as the Centre for Black and African Arts and Civilisation Act. _________________ SCHEDULE [Section 3 (5).] SUPPLEMENTARY PROVISIONS RELATING TO THE BOARD Proceedings of the Board 1. (1) There shall be paid to every member of the Board who is not a public officer such remuneration, fees and other allowances in respect of any period spent on the business of the Board as the President may, from time to time, approve for payment to members of the boards of statutory corporations. (2) The travelling, subsistence and other allowances shall be paid out of the funds of the Centre. 2. The chairman of the Board shall preside at meetings of the Board and if he is absent from a meeting the members present shall elect one of their number to preside at that meeting. 3. At a meeting of the Board- (a) seven members shall form a quorum; (b) questions shall be decided by a majority of those present and voting; and (c) in the case of an equality of votes, the chairman or other person presiding shall have a second or casting vote. 4. Subject to this Act, the Board may make standing orders regulating the proceedings of the Board or of any committee thereof, and subject to such standing orders, the Board may function notwithstanding any vacancy in its membership or the absence of any member. Committees 5. Subject to its standing orders, the Board may appoint such committees as it thinks fit to consider any matter referred to it by the Board but the decision of any committee appointed under this paragraph shall be of no effect until confirmed by the Board. 6. Where the Board desires to obtain the advice of any person on a particular matter, the Board may co-opt him as a member for such period as it thinks fit, but a person who is a member of the Board by virtue of this paragraph shall not be entitled to vote at any meeting of the Board and shall not count towards a quorum. 7. The quorum of any committee of the Board shall be determined by the Board. Miscellaneous 8. The fixing of the seal of the Centre shall be authenticated by the signature of the chairman of the Board or the Director or any other person authorised either generally or specially in that behalf by the Board. 9. Any document purporting to be a contract, instrument or other document duly signed or sealed on behalf of the Centre shall be received in evidence and unless the contrary is proved, be presumed without further proof to have been so signed or sealed. 10. Any member of the Board or a committee thereof who has a personal interest in any contract or arrangement entered into or proposed to be considered by the Board or committee shall disclose such interest and shall not vote on any question relating to the contract or arrangement. _______________________ SUBSIDIARY LEGISLATION ______________________ No Subsidiary Legislation"
    }
  ],
  "definitions": [
    {
      "term": "the Board",
      "definition": "the Management Board of the Centre for Black and African Arts and Civilisation established under section 1 (2) of this Act",
      "source_provision": "s13"
    },
    {
      "term": "the Centre",
      "definition": "the Centre for Black and African Arts and Civilisation established under section 1 (1) of this Act",
      "source_provision": "s13"
    },
    {
      "term": "the Director",
      "definition": "the Director of the Centre appointed pursuant to section 5 (1) of this Act",
      "source_provision": "s13"
    },
    {
      "term": "the 1977 Festival",
      "definition": "the Second World Black and African Festival of Arts and Culture held in Nigeria in 1977",
      "source_provision": "s13"
    },
    {
      "term": "the Minister",
      "definition": "the Minister charged with responsibility for cultural matters",
      "source_provision": "s13"
    }
  ]
}