{
  "id": "currency-offences-act",
  "type": "statute",
  "title": "CURRENCY OFFENCES ACT",
  "title_en": "CURRENCY OFFENCES ACT",
  "short_name": "CURRENCY OFFENCES ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=100",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. Short title This Act may be cited as the Currency Offences Act."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. Interpretation In this Act, unless the context otherwise requires- \"coin\" means any coin which is for the time being legal tender in Nigeria; \"note\" means any note which is for the time being legal tender in Nigeria by virtue of any enactment now or hereafter in force."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Discounting of any kind of currency prohibited",
      "content": "3. Discounting of any kind of currency prohibited If any person shall- (a) buy or sell or offer or attempt to buy or sell; (b) induce or attempt to induce any other person to buy or sell; (c) offer or accept or offer to accept in payment of a debt or otherwise, any note or coin at or for a lower rate or value than the same imports, he shall be guilty of an offence and liable on conviction to imprisonment for a term of five years or a fine of N 1000or to both such imprisonment and fine."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Purchase of coin beyond face value prohibited",
      "content": "4. Purchase of coin beyond face value prohibited If any person shall- (a) buy or sell or offer or attempt to buy or sell; (b) induce or attempt to induce any other person to buy or sell; (c) offer or accept or offer to accept in payment of a debt or otherwise, any coin for an amount exceeding the face value of such coin, he shall be guilty of an offence and liable on conviction to imprisonment for a term of five years or a fine of N 1,000 or to both such imprisonment and fine."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Separate offence in respect of each note or coin",
      "content": "5. Separate offence in respect of each note or coin If in the same act or transaction any person shall have committed an offence under section 3 or 4 of this Act in respect of more such notes or coins than one, he shall be deemed to have committed a separate offence in respect of each of such notes or coins."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Price not to be variable according to kind of currency in which payment is made",
      "content": "6. Price not to be variable according to kind of currency in which payment is made If at any sale or bargain for the sale of goods or property of any description any person shall agree or stipulate or attempt to make it a condition of such sale that the price of such goods or property shall be increased or decreased or in any manner be variable as payment or part thereof is or is not made in any particular kind of currency which is legal tender in Nigeria, he shall be guilty of an offence and liable on conviction to imprisonment for a term of five years or a fine of N l,000 or to both such imprisonment and fine. __________________________ CURRENCY OFFENCES ACT SUBSIDIARY LEGISLATION ___________________________ N0 Subsidiary Legislation __________________________"
    }
  ],
  "definitions": [
    {
      "term": "coin",
      "definition": "any coin which is for the time being legal tender in Nigeria",
      "source_provision": "s2"
    },
    {
      "term": "note",
      "definition": "any note which is for the time being legal tender in Nigeria by virtue of any enactment now or hereafter in force",
      "source_provision": "s2"
    }
  ]
}