{
  "id": "directorate-of-food-roads-and-rural-infrastructures-act",
  "type": "statute",
  "title": "DIRECTORATE OF FOOD, ROADS AND RURAL INFRASTRUCTURES ACT",
  "title_en": "DIRECTORATE OF FOOD, ROADS AND RURAL INFRASTRUCTURES ACT",
  "short_name": "DIRECTORATE OF FOOD, ROADS AND RURAL",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=121",
  "provisions": [
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Functions of the Directorate",
      "content": "5. Functions of the Directorate Subject to this Act, the Directorate shall be charged with the following functions, that is- ( a ) to identify, involve and support viable local community organisations in the effective mobilisation of the rural population for sustained rural developmental activities, bearing in mind the need for promoting greater community participation and economic self reliance of the rural community; ( b ) to identify areas of high production potential for the country's priority food and fibre requirement and to support production of such commodities along agro-ecological zones within the context of one national market with unimpeded inter-State trade in farm produce; ( c ) to formulate and support a national rural feeder-road network programme involving construction, rehabilitation, improvement and maintenance especially in relation to the nation's food self-sufficiency programme as well as general rural development; ( d ) to formulate and support a national rural water-supply programme with emphasis on full initial involvement of local communities and local government personnel to ensure sustained maintenance of built infrastructures; ( e ) to identify and promote other programmes that would enhance greater productive economic activities in the rural areas as well as help to improve the quality of life and standard of living of the rural people; ( f ) to encourage contribution of labour, time and materials by local communities to be complemented by a system of matching grants from the Directorate, local and State Governments; ( g ) to support the development of information gathering, maintenance and evaluation of culture in rural development programming, with emphasis on utilisation of existing agencies with demonstrated competence in the area of management information systems in agriculture and rural development, rural infrastructures, agronomy, agricultural extension, including the continuous generation of basic data on rural infrastructures in each of the local government areas in Nigeria; ( h ) to commission and support studies and research projects that will facilitate the execution of the functions of the Directorate; ( i ) to determine within each local government area the community basis of rural productive organisation as a means of mobilising food and other products for more effective service delivery, infra structural development and enhanced productivity; (j) to identify and involve local community leaders and organisations in the effective mobilisation of the rural population for sustained development activities, bearing in mind the need for promoting greater social participation and economic self-reliance in the community; ( k ) to liaise with Federal Government Ministries and agencies in the design and implementation of programmes and projects in the field of food production and processing, rural water supply, road construction and maintenance and the provision of rural infrastructures, and any other rural development activities; ( l ) to define, encourage and support any activity calculated to enhance food production, road development, rural water, supply the provision of other infrastructures to rural areas, and any other rural development activities; ( m ) to encourage the implementation of physical development plans at the community level in order to increase the rural productivity and improve rural accessibility; ( n ) to prescribe the criteria and determine the level of corresponding financial grant which will adequately stimulate the expansion of food production and processing, rural water supply, road construction and maintenance of rural roads and the provision of other rural infrastructures; ( o ) to establish an efficient, expeditious and accurate system of financial disbursement to rural communities; ( p ) to supervise and monitor on a continuous or regular basis the entire range of rural development activities, carried out or supported by the Directorate pursuant to this Act; ( q ) to develop a system of statistical and non-statistical reporting relative to local communities in order to measure the achievements of the Directorate in the areas of food production, rural water supply, road construction and repair, rural infrastructural development and other rural development activities; and ( r ) to do all such other things as will enable the Directorate more effectively to perform its functions under this Act. 6. Participation by States and local government councils (1) The Government of a State and each local government council in every State shall participate in the functions of the Directorate in such manner as the President may determine. (2) Accordingly, and without prejudice to the establishment of State equivalents of the Directorate under section 4 of this Act, all local government councils shall be constituted into committees for the development of rural areas as envisaged in this Act. (3) The chairman of each local government council shall be the chairman of the Committee constituted under subsection (2) of this section. 7. Special functions of the Directorate (1) The Directorate shall gear all its efforts towards the development of the entire rural areas of Nigeria in order to improve the quality of life of the rural dwellers. (2) For the purpose of achieving the objective in subsection (1) of this section, the Directorate shall use its best endeavours to- ( a ) encourage and organise increased agricultural and any other activities towards an increased earning power of the rural dwellers; ( b ) encourage increased agricultural and any other activities in the rural areas to provide agricultural and industrial raw materials; ( c ) undertake the construction and repair of roads to facilitate communication and distribution of agricultural products; ( d ) liaise with the appropriate Federal, State and local Governments for the provision of water, health facilities, electricity, means of communication and such other things as the Directorate may determine within the rural areas; (e) enlighten the rural communities in order to give them a sense of belonging to the country. (3) The Directorate shall also encourage communities to form their own village, community or town improvement or development unions or associations under their own democratically elected leaders to serve as the apex organisation for mobilising their communities for the successful participatory implementation of all rural development programmes as initiated by the Directorate, each tier of Government or by the communities themselves. 8. Officers of the Directorate &nb"
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Funds of the Directorate",
      "content": "10. Funds of the Directorate (1) The funds of the Directorate shall consist of such sums as the Federal Government may, from time to time, provide. (2) The Directorate shall keep proper accounts in respect of each financial year and proper records in relation to those accounts and shall submit same annually for auditing by the Auditor-General for the Federation."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Quarterly reports",
      "content": "11. Quarterly reports The Board shall prepare and submit to the President once in every quarter, a report on the activities of the Directorate during the immediate preceding quarter."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Procedures of the Directorate",
      "content": "12. Procedures of the Directorate (1) The Board shall have power to regulate its own procedures and may make standing orders not inconsistent with this Act for that purpose and, subject to such standing orders, may function notwithstanding any vacancy in its membership or the absence of a member. (2) The Board shall meet for the due performance of its functions under this Act whenever the chairman convenes a meeting of the Directorate. (3) Where upon any special occasion the Board desires to obtain the advice of any person on any particular matter, the Board may co-opt that person to be a member for as many meetings as may be necessary and that person while so co-opted shall have all the privileges of a member except that he shall not be entitled to vote."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Interpretation",
      "content": "13. Interpretation In this Act, unless the context Roads and Rural Infrastructures established by section 1 of this Act; otherwise requires- \"Directorate\" means the Directorate of Food, Roads and Rural Infrastructures established by section 1 of this Act; \"functions\" include duties and powers; \"State formation\" means State equivalent of the Directorate, the Local Government Rural Development Committees and the communities improvement of development unions or associations."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Short title",
      "content": "14. Short title This Act may be cited as the Directorate of Food, Roads and Rural Infrastructures Act. ______________________________ DIRECTORATE OF FOOD, ROADS AND RURAL INFRASTRUCTURES ACT SUBSIDIARY LEGISLATION ______________________________ No Subsidiary Legislation ______________________________"
    }
  ],
  "definitions": [
    {
      "term": "Directorate",
      "definition": "the Directorate of Food, Roads and Rural Infrastructures established by section 1 of this Act",
      "source_provision": "s13"
    },
    {
      "term": "State formation",
      "definition": "State equivalent of the Directorate, the Local Government Rural Development Committees and the communities improvement of development unions or associations",
      "source_provision": "s13"
    }
  ]
}