{
  "id": "exclusive-economic-zone-act",
  "type": "statute",
  "title": "EXCLUSIVE ECONOMIC ZONE ACT",
  "title_en": "EXCLUSIVE ECONOMIC ZONE ACT",
  "short_name": "EXCLUSIVE ECONOMIC ZONE ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=140",
  "provisions": [
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Exploitation, etc., of Exclusive Zone",
      "content": "2. Exploitation, etc., of Exclusive Zone (1) Without prejudice to the Territorial Waters Act, the Petroleum Act or the Sea Fisheries Act, sovereign and exclusive rights with respect to the exploration and exploitation of the natural resources of the sea bed, subsoil and superjacent waters of the Exclusive Zone shall vest in the Federal Republic of Nigeria and such rights shall be exercisable by the Federal Government or by such Minister or agency as the Government may, from time to time, designate in that behalf either generally or in any special case. [Cap. T5. Cap. P10. Cap. S4.] (2) Subsection (1) of this section shall be subject to the provisions of any treaty to which Nigeria is a party with respect to the exploitation of the living resources of the Exclusive Zone."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Power to erect installations, etc., and offences in relation thereto",
      "content": "3. Power to erect installations, etc., and offences in relation thereto (1) For the purpose of exploring and exploiting, conserving and managing the natural resources and other activities for the economic exploitation and exploration of the Exclusive Zone, the appropriate authority may establish, or permit the establishment, operation and use by any other person subject to such conditions as may be prescribed, in designated areas- (a) artificial islands; (b) installations and structures. (2) The appropriate authority may, for the purpose of protecting any installation in a designated area by order published in the Federal Gazette, prohibit ships, subject to any exceptions provided in the order, from entering without its consent such part of that area as may be specified in such order. (3) If any ship enters any part of a designated area in contravention of an order made under this section, its owner or master shall be liable on conviction to a fine of N5,000 or imprisonment for a term of twelve months or to both such fine and imprisonment unless he proves that the prohibition imposed by the order was not, and would not on reasonable inquiry have become, known to the master. (4) In this section, \"designated area\" means any area of the Exclusive Zone so designated by the appropriate authority for the purposes of subsection (1) of this section. 4. Applicability of criminal and civil laws,etc. (1) Any act or omission which- (a) takes place on, under or above an installation in a designated area or any waters within 200 meters of such an installation; and (b) would, if taking place in any part of Nigeria, constitute an offence under the enactment in force in that part, shall be treated for the purposes of that law as taking place in Nigeria. (2) Offences under subsection (1) of this section shall be triable by the Federal High Court whether or not such offence would, if actually committed in Nigeria, be triable under the applicable enactment by a court other than the Federal High Court. (3) The prosecution of any offence under this Act shall be at the instance of the Attorney-General of the Federation. (4) In this section , \"enactment\" means any Act or law relating to criminal or civil law (including torts) and any subsidiary instrument made thereunder including rules of court and, in matters other than criminal matters, rules of law applicable to or adopted in any part of Nigeria."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Offences by bodies corporate",
      "content": "5. Offences by bodies corporate (1) Where a body corporate is guilty of an offence under this Act and the offence is proved to have been committed with the consent or connivance of, or to be attributable to any neglect on the part of, any director, manager, secretary, or other similar officer of the body corporate or of any person who was purporting to act in any such capacity he, as well as the body corporate shall be guilty of the offence and shall be liable to be proceeded against and punished accordingly. (2) For the purposes of this section, \"director\" in relation to a body corporate established for the purpose of carrying on under national ownership any industry or part of an industry or undertaking being a body corporate whose affairs are managed by its members, means a member of that body corporate."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Interpretation",
      "content": "6. Interpretation In this Act, unless the context otherwise requires- \"appropriate authority\" means the Federal Government or any other person or authority designated in that behalf by the Federal Government by virtue of section 2 of this Act; \"designated area\" has the meaning assigned thereto by section 3 (4) of this Act; \"the Exclusive Zone\" means the Exclusive Economic Zone of Nigeria as delimited by section 1 of this Act; \"territorial waters of Nigeria\" has the meaning assigned thereto by the Territorial Waters Act. [Cap. T5.]"
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Short title",
      "content": "7. Short title This Act may be cited as the Exclusive Economic Zone Act. _______________________________ EXCLUSIVE ECONOMIC ZONE ACT SUBSIDIARY LEGISLATION _________________________ No Subsidiary Legislation _____________________"
    }
  ],
  "definitions": [
    {
      "term": "appropriate authority",
      "definition": "the Federal Government or any other person or authority designated in that behalf by the Federal Government by virtue of section 2 of this Act",
      "source_provision": "s6"
    },
    {
      "term": "designated area",
      "definition": "assigned thereto by section 3 (4) of this Act",
      "source_provision": "s6"
    },
    {
      "term": "the Exclusive Zone",
      "definition": "the Exclusive Economic Zone of Nigeria as delimited by section 1 of this Act",
      "source_provision": "s6"
    },
    {
      "term": "territorial waters of Nigeria",
      "definition": "assigned thereto by the Territorial Waters Act. [Cap. T5.]",
      "source_provision": "s6"
    }
  ]
}