{
  "id": "extradition-treaty-between-the-government-of-the-federal-rebublic-of-nigeria-and",
  "type": "statute",
  "title": "EXTRADITION TREATY BETWEEN THE GOVERNMENT OF THE FEDERAL REBUBLIC OF NIGERIA AND THE GOVERNMENT OF THE REBUPLIC OF SOUTH AFRICA (RATIFICATION AND ENFORCEMENT) ACT",
  "title_en": "EXTRADITION TREATY BETWEEN THE GOVERNMENT OF THE FEDERAL REBUBLIC OF NIGERIA AND THE GOVERNMENT OF THE REBUPLIC OF SOUTH AFRICA (RATIFICATION AND ENFORCEMENT) ACT",
  "short_name": "EXTRADITION TREATY BETWEEN THE",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=149",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "",
      "content": "Section 1.] EXTRADITION TREATY BETWEEN THE FEDERAL REPUBLIC OF NIGERIA AND THE REPUBLIC OF SOUTH AFRICA Table of Contents Article 1: Obligation to Extradite. Article 2: Extraditable Offences. Article 3: Optional Grounds for Extradition. Article 4: Nationality. Article 5: Political and Military Offences. Article 6: Prior Prosecution. Article 7: Lapse of Time. Article 8: Extradition Procedures and Required Documents. Article 9: Admissibility of Documents. Article 10: Provisional Arrest. Article 11: Decision and Surrender. Article 12: Temporary and Deferred Surrender. Article 13: Requests for Extradition by more than one State. Article 14: Seizure and Surrender of Property. Article 15: Rule of Specialty. Article 16: Surrender to a Third State or an International Tribunal. Article 17. Simplified Surrender. Article 18: Transit. Article 19: Expenses and Representation. Article 20: Consultation. Article 21: Scope of Application. Article 22: Amendment. Article 23: Ratification, Entry into Force, and Termination. ____________________________ EXTRADITION TREATY BETWEEN THE FEDERAL REPUBLIC OF NIGERIA AND THE REPUBLIC OF SOUTH AFRICA The Government of the Federal Republic of Nigeria and the Government of the Republic of South Africa, (hereinafter referred to as &ldquo;the Contracting States&rdquo;); DESIRING to enhance effective co-operation between the two States in the suppression of crime and, for that purpose, to conclude a treaty for the extradition of offenders; HAVE AGREED as follows- ARTICLE 1 Obligation to Extradite The Contracting States agree to extradite to each other, pursuant to the provisions of this Treaty, persons whom the authorities in the Requesting State have charged with or convicted of an extraditable offence. ARTICLE 2 Extraditable Offences 1. An offence shall be an extraditable offence if it is punishable under the laws in both Contracting States by deprivation of liberty for a period of more than one year, or by a more severe penalty. 2. An offence shall also be an extraditable offence if it consists of attempting or conspiring to commit, aiding, abetting, inducing, counselling or procuring the commission of, or being an accessory before or after the fact to, any offence contemplated in paragraph 1. 3. For the purposes of this article, an offence shall be an extraditable offence whether or not the laws of the Contracting States place the offence within the same category of offences or describe the offence by the same terminology. 4. If an offence has been committed outside the territory of the Requesting State, extradition shall be granted where the laws of the Requested State provide for the punishment of an offence committed outside its territory in similar circumstances. Where the laws of the Requested State do not so provide, the executive authority of the Requested State may, in its discretion, grant extradition. 5. Extradition shall also be granted in respect of a person convicted of but not yet sentenced, or convicted of and sentenced for an offence as contemplated in this article, for the purpose of sentence, or for enforcing such sentence or the remaining portion thereof, as the case may be. 6. Where extradition of a person is sought for an offence against a law relating to taxation, customs duties, exchange control, or other revenue matters, extradition may not be refused on the ground that the law of the Requested State does not impose the same kind of tax or duty or does not contain a tax, customs duty, or exchange regulation of the same kind as the law of the Requesting State. 7. Where extradition has been granted for an extraditable offence, it shall also be granted for any other offence specified in the request even if the latter offence is punishable by less than one year&rsquo;s deprivation of liberty, provided that all other requirements of extradition are met. ARTICLE 3 Optional Grounds for Extradition 1. Extradition shall be granted unless the offence for which extradition is sought is punishable by death under the laws of the Requesting State, and is not punishable by death under the laws of the Requested State and the Requested State may refuse extradition unless the Requesting State provides assurances that the death penalty will not be imposed or, if imposed, will not be carried out. 2. In instances in which a Requesting State provides an assurance in accordance with this Article, the death penalty, if imposed by the courts of the Requesting State, shall not be carried out. 3. Extradition may be refused unless the Requesting State undertakes or gives such assurance as considered sufficient by the Requested State that the person sought will not be&mdash; (a) detained without trial; (b) tortured in any way; and (c) treated in a cruel, inhuman or degrading way. ARTICLE 4 Nationality Extradition shall not be refused on the ground that the person sought is a citizen or national of the Requested State. ARTICLE 5 Political and Military Offences 1. Extradition shall not be granted if the offence for which extradition is requested is an offence of a political character. 2. For the purposes of this Treaty, the following shall not be considered to be offences of a political character&mdash; (a ) the murder or other willful crime against the person of a Head of State of one of the Contracting States, or a member of the Head of State&rsquo;s family; (b) an offence for which both contracting States have the obligation pursuant to a multilateral international agreement to extradite the person sought or to submit the case to their competent authorities for decision as to prosecution; (c) murder; (d) an offence involving kidnapping, abduction, or any form of unlawful detention, including the taking of a hostage; and (e) attempting or conspiring to commit, aiding, abetting, inducing, counselling or procuring"
    }
  ],
  "definitions": []
}