{
  "id": "federal-government-staff-housing-board-act",
  "type": "statute",
  "title": "FEDERAL GOVERNMENT STAFF HOUSING BOARD ACT",
  "title_en": "FEDERAL GOVERNMENT STAFF HOUSING BOARD ACT",
  "short_name": "FEDERAL GOVERNMENT STAFF HOUSING BOARD",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=170",
  "provisions": [
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Funds of the Board",
      "content": "8. Funds of the Board (1) The funds of the Board shall consist of- (a) the funds vested in the Board under section 10 of this Act; (b) such funds as may from time to time be provided by the Federal Government; and (c) such other sums as may be collected or received by the Board in the execution of its functions under this Act. (2) Disbursements from the fund shall be made in accordance with the rules made under section 23 of the Finance (Control and Management) Act and, without prejudice to the foregoing, rule 17 of the Public Funds of the Federation (Disbursement) Rules shall continue in force and have effect as if made under this subsection. [Cap. F26.] 9. Accounts and audit The Board shall keep proper accounts of its payments, receipts, assets and liabilities and shall submit the same once every year for auditing by the Auditor-General of the Federation."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Vesting of assets, etc., in respect of the African Staff Housing Scheme",
      "content": "10. Vesting of assets, etc., in respect of the African Staff Housing Scheme All assets, liabilities, rights and obligations vested in the Board established under a scheme known as the African Staff Housing Scheme or vested in any person or authority (including the Government of the Federation) in respect of or in connection with the said Scheme (not being assets, liabilities, rights or obligations of a person on account of an advance received under the said Scheme) shall as from the commencement of this Act vest in the Board established by this Act and- (a) all pending applications under that Scheme; (b) all advances granted; and (c) anything whatsoever done, under or in connection with the said Scheme shall be deemed to have been made, granted or done under this Act. 11. Regulations The Board may, with the approval of the Minister, make regulations generally for the purposes of this Act; and without prejudice to the generality of the foregoing the regulations may- (a) provide for the making of applications for advances; (b) prescribe the amount of advance available in any particular case and the conditions applicable to the granting of such advance; (c) specify the nature of title to land acceptable to the Board; (d) prescribe the manner of repayment of advances granted. 12. Execution of documents by or on behalf of the Board, etc. (1) Any contract or instrument which, if entered into or executed by a person not being a body corporate, would not be required to be under seal, may be entered into or executed on behalf of the Board by any person generally or specifically authorised by it for the purpose. (2) The fixing of the seal of the Board shall be authenticated by the signature of the chairman or some other member authorised generally or specifically by the Board to act for that purpose. (3) Any document purporting to be a document duly executed under the seal of the Board shall be received in evidence and shall, unless the contrary is proved, be deemed to be so executed. 13. Interpretation In this Act, unless the context otherwise requires- \"Board\" means the Federal Government Staff Housing Board established by section 1 of this Act; \"Minister\" means the Minister charged with responsibility for matters relating to works and housing; \"Secretary\" means the Secretary appointed pursuant to section 5 of this Act. 14. Short title This Act may be cited as the Federal Government Staff Housing Board Act. FEDERAL GOVERNMENT STAFF HOUSING BOARD ACT SUBSIDIARY LEGISLATION List of Subsidiary Legislation 1. Federal Government Staff Housing Board Regulations. FEDERAL GOVERNMENT STAFF HOUSING BOARD REGULATIONS ARRANGEMENT OF REGULATIONS REGULATIONS 1. Application for advance. 2. Production of offer guaranteeing clear title or vacant possession. 3. Board to be satisfied as to general suitability of land or house. 4. Amount of advances. 5. Further advance. 6. Deposit where cost of building exceeds advance. 7. Mode of payment of advance. 8. Land or house to be mortgaged to the Board. 9. Plans, specifications, etc. 10. Interest on advances. 11. Repayment of advances. 12. Monthly instalments to be a charge on applicant's income. 13. Variation of monthly instalments. 14. Compounding of advances in certain cases. 15. Deductions from pensions, gratuities. 16. Resignation. 17. Death. 18. Special power to order repayment of advance. 19. Insurance. 20. Letting. 2l. Structural alterations. 22. House to be kept in proper repair 23. Supplementary powers. 24. Interpretation. 25. Short title Schedule. SCHEDULE FEDERAL GOVERNMENT STAFF HOUSING BOARD REGULATIONS [L.N. 32 of 1974.] under section 11 [Commencement. ] [10th May, 1974] 1. Application for advance An application for an advance shall be in the form specified in the Schedule to these Regulations and shall be addressed to the Secretary through the applicant's Head of Department. 2. Production of offer guaranteeing clear title or vacant possession (1) An application for an advance to purchase land shall not be considered by the Board unless the applicant produces a written offer of sale from the vendor guaranteeing to transfer a clear title immediately upon completion of the purchase. (2) An application for an advance to purchase a house shall not be considered by the Board unless the applicant produces a written offer from the vendor guaranteeing vacant possession of the house to the applicant immediately upon completion of the purchase. 3. Board to be satisfied as to general suitability of land or house (1) The Board shall not grant an advance to purchase land or a house unless it is satisfied as to- (a) the size, situation and general suitability of the land or house for residential purposes; (b) the value of the land or house as assessed by or on behalf of the Board; (c) in the case of a house, the state of repair of the house; and (d) the adequacy of the title which the vendor is able to transfer to the applicant. (2) The Board shall not grant an advance to build a house unless it is satisfied that the applicant has a clear title to the land on which the house is to be built and that the site is suitable in size, location, healthiness and value. (3) The Board shall not grant an advance in any case in which it is satisfied, after taking into consideration the financial and other circumstances of the applicant, that it will be inexpedient for the Board to grant such advance."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Amount of advance",
      "content": "4. Amount of advance (1) Without prejudice to paragraph (2) of this regulation, the amount of advances that may be granted shall be as follows- (a) to build or improve a house, an amount equal to five times the applicant's annual salary or N 20,000 whichever is less; (b) to purchase a house, the value of the house as assessed by the Board or an amount equal to five times the applicant's annual salary or N 20,000 whichever of the three is the least; (c) to purchase land, the value of the land as assessed by the Board or an amount equal to the applicant's annual salary, whichever is less. (2) Notwithstanding the provision of paragraph (1) of this regulation, where the applicant is not less than 45 years old, the advance may be further limited to an amount which the applicant is, in the opinion of the Board, in a position to refund in instalments equated to the number of years by which his age, at the date the advance is approved, falls short of 54 years. (3) Fees chargeable for stamp duties, registration of title, preparation of plans and other incidental expenses in respect of an advance, shall be payable by the borrower but the Board may, at the request of the borrower, pay such fees if the total loan to be granted does not exceed the amount of the advance to which the applicant is entitled under paragraph (1) of this regulation. 5. Further advance An applicant who has been granted an advance to purchase land may be granted a further advance to build a house thereon but the amount of the advance shall be such that the amount outstanding at any time shall not exceed a total of five times the applicant's annual salary or N20,000 whichever is less. 6. Deposit where cost of building exceeds advance Where an application is for an advance to build or complete the building of a house and the estimated completed cost of the house exceeds the amount of the advance to which the applicant is entitled under regulation 4 of these Regulations, the Board shall only grant the advance if- (a) the difference between the advance required and the estimated cost of the building is deposited with the Board; or (b) a certificate is received from an officer appointed by the Board that the value of the work executed and fixed in position is not less than the difference between the advance and the estimated completed cost of the building. 7. Mode of payment of advance Advances for the purpose of building, improving or extending a house shall be paid out in two instalments only. 8. Land or house to be mortgaged to the Board A person who has received an advance to purchase land or to build, improve or purchase a house under these Regulations, shall mortgage the land or building as a first mortgage to the Board and shall deposit the title deeds to the land or house with the Secretary. 9. Plans, specifications, etc. Plans, specifications and bills of quantities required for the purposes of these Regulations shall be prepared under the direction of an architect and shall be submitted to the Board for approval. 10. Interest on advances All advances made under these Regulations shall bear interest at a rate to be determined from time to time by the Accountant-General of the Federation."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Repayment of advances",
      "content": "11. Repayment of advances Advances under these Regulations shall be payable as follows- (a) in the case of advances to purchase land, within a period of not more than five years, the first instalment being paid in the month following the month of payment for the land; (b) in the case of advances to build, extend or purchase a house, within a period of not more than 25 years, the first instalment being paid in the month following the completion, extension or improvement or purchase of the house: Provided that the Board may at its discretion, order the repayment of an advance or part thereof or any instalment repayment thereof at any stage before the completion or extension of the house or purchase of the land or house, if it considers that there is an unreasonable delay in the completion or extension of the house or transaction relating to the purchase of the land or house."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Monthly instalments to be a charge on applicant's income",
      "content": "12. Monthly instalments to be a charge on applicant's income Repayment of an advance together with interest thereon shall be by consecutive equated monthly instalments and shall be a standing charge on the salary or income of the borrower over the period of the advance."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Variation of monthly instalments",
      "content": "13. Variation of monthly instalments (1) The Board may, upon application by the borrower, agree that the amount of monthly repayment be increased so as to effect a speedier repayment but the method of repayment shall remain by consecutive equated monthly instalments. (2) Repayment of the advance in whole or in part, together with interest, may be made by the payment of lump sums, so however that if the repayment is not made in full, the amount of the monthly instalments of repayment of the balance shall be recomputed."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Compounding of advances in certain cases",
      "content": "14. Compounding of advances in certain cases Where building operations are commenced within twelve months of the receipt of an advance to purchase land and a further advance is granted for the purpose of the building, the outstanding balance of the first advance shall, on the completion of the house, be compounded with the subsequent one and the compounded advance shall be repayable thereafter as though it were a single advance to build a house."
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Deductions from pensions, gratuities",
      "content": "15. Deductions from pensions, gratuities (1) A pensionable officer shall be required by the Board to agree to deduction being made from any pension or gratuity which may be granted to him upon retirement if he retires before completing the repayment of any advance granted to him or from any gratuity which may be granted to his personal representatives in the event of his death whilst in the public service. (2) An officer who contributes to a provident fund shall be required by the Board to provide, as security for an advance to him, any sum outstanding to his credit in such provident fund."
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Resignation",
      "content": "16. Resignation In the event of a person resigning his appointment or being dismissed from the public service before any advance received is fully repaid, the Board may thereupon exercise its right of foreclosure under the mortgage unless- (a) the outstanding balance of the advance is paid upon such resignation; or (b) arrangements satisfactory to the Board are made by the borrower to liquidate the advance."
    },
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "Death",
      "content": "17. Death In the event of an officer dying before the repayment of an advance granted to him is completed, the Board may exercise its right of foreclosure under the mortgage unless arrangements satisfactory to the Board are made by the officer's personal representatives for the repayment of the advance."
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "Special power to order repayment of advance",
      "content": "18. Special power to order repayment of advance Where it appears to the Board that any sum, being the whole or part of an advance, has not been applied for the purposes for which the advance was granted, the Board may order such sum to be repaid to the Board within the time mentioned in the order, and any sum so ordered to be repaid shall thereupon become a debt due to the Board."
    },
    {
      "provision_ref": "s19",
      "section": "19",
      "title": "Insurance",
      "content": "19. Insurance (1) A house built, improved, extended or purchased under these Regulations shall be insured by the Board, at the borrower's expense, with the National Insurance Corporation of Nigeria (or any other insurance company sponsored by the Federal Government) against damage by fire, flood and lightning for its full established value or actual cost throughout the period of repayment of the advance. (2) The insurance policy shall be taken out in the joint names of the Board and the borrower. (3) The cost of the premiums in respect of the insurance shall be deducted from the salary of the borrower."
    },
    {
      "provision_ref": "s20",
      "section": "20",
      "title": "Letting",
      "content": "20. Letting (1) Where a borrower who has received an advance to build, improve or purchase a house lets or sublets the house or any part thereof when the advance has not been fully repaid, the Board may require him to enter into an agreement with the Board whereby a proportion of the rent collected may be paid to the Board. (2) Any sum paid to the Board pursuant to paragraph (1) of this regulation shall be credited to the borrower's account."
    },
    {
      "provision_ref": "s21",
      "section": "21",
      "title": "Structural alterations",
      "content": "21. Structural alterations Except with the prior approval of the Board, no structural alteration to any house in respect of which an advance has been obtained shall be undertaken during the period when any part of the advance remains to be repaid."
    },
    {
      "provision_ref": "s22",
      "section": "22",
      "title": "House to be kept in proper repair",
      "content": "22. House to be kept in proper repair A person who has received an advance from the Board to build, improve, extend or purchase a house, shall keep the house in a proper state of repair during the period of the repayment of the advance."
    },
    {
      "provision_ref": "s23",
      "section": "23",
      "title": "Supplementary powers",
      "content": "23. Supplementary powers Notwithstanding anything to the contrary in these Regulations, the Board may grant an advance for any of the purposes specified in these Regulations, subject to such other terms and conditions as the Board may at its discretion determine."
    },
    {
      "provision_ref": "s24",
      "section": "24",
      "title": "Interpretation",
      "content": "24. Interpretation In these Regulations, unless the context otherwise requires- \"applicant\" means an officer who has applied for an advance pursuant to these Regulations; \"the Board\" means the Federal Government Staff Housing Board established under section 1 of the Act; \"clear title\" means the best title obtainable in any particular case and is one which, in the opinion of the Board, is good and reasonable security for a loan under these Regulations; \"Secretary\" means the Secretary to the Federal Government Staff Housing Board appointed under section 5 of the Act."
    },
    {
      "provision_ref": "s25",
      "section": "25",
      "title": "Short title",
      "content": "25. Short title These Regulations may be cited as the Federal Government Staff Housing Board Regulations. SCHEDULE Federal Government Staff Housing Board Application form [Regulation 1. (FGSHB 1).] 1. (a) Surname &hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;. Mr/Mrs/Miss) (b) Other names (in full)&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip; 2. (a) Ministry or Department &hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip; (b) Section/Division&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;.. 3. Date of birth&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip; 4. Age &hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip; 5. (a) Date of original appointment&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip; (b) Is appointment pensionable, or subject to a contributory provident fund&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip; (b) Number of years served in (b)&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip; 6 Rank&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;... 7. (a) Present salary&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;... (b) Salary scale &hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;.. (c) Incremental date &hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;.. 8. If a married woman, state: (a) Name and official address of husband&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;.. (b) Whether or not husband is a civil servant&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip; (c) Number of children&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip; (d) Ages&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;.. 9. (a) Whether confirmed in a pensionable appointment&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;.. (b) If so, Gazette or other particulars&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;. 10. If a contributor to the provident fund, please state: (a) Name of provident fund &hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;. (b) Registration number in provident fund&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;. (c) Amount standing to your credit in provident fund&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;................. 11. (a) Residential address &hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip; (b) Name and address of landlord &hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;..&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;. (c) Rent payable &hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hellip;&hell"
    }
  ],
  "definitions": [
    {
      "term": "applicant",
      "definition": "an officer who has applied for an advance pursuant to these Regulations",
      "source_provision": "s24"
    },
    {
      "term": "the Board",
      "definition": "the Federal Government Staff Housing Board established under section 1 of the Act",
      "source_provision": "s24"
    },
    {
      "term": "clear title",
      "definition": "the best title obtainable in any particular case and is one which, in the opinion of the Board, is good and reasonable security for a loan under these Regulations",
      "source_provision": "s24"
    },
    {
      "term": "Secretary",
      "definition": "the Secretary to the Federal Government Staff Housing Board appointed under section 5 of the Act",
      "source_provision": "s24"
    }
  ]
}