{
  "id": "high-court-of-the-federal-capital-territory-abuja-number-of-judges-act",
  "type": "statute",
  "title": "HIGH COURT OF THE FEDERAL CAPITAL TERRITORY, ABUJA (NUMBER OF JUDGES) ACT",
  "title_en": "HIGH COURT OF THE FEDERAL CAPITAL TERRITORY, ABUJA (NUMBER OF JUDGES) ACT",
  "short_name": "HIGH COURT OF THE FEDERAL CAPITAL",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=159",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Number of Judge",
      "content": "Number of Judge s of the High Court of the Federal Capital Territ o ry The High Court of the Federal Capital Territory, Abuja, shall consist of- (a) a Chief Judge of the High Court of the Federal Capital Territory, Abuja; and (b) a maximum number of thirty-seven Judges of the Court."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Federal Character in the appointment of Judg",
      "content": "Federal Character in the appointment of Judg e s , etc . The principle of \"Federal Character of Nigeria\" shall be applied in the appointment of judges of the Court provided that nothing in this Act shall affect or negate the proceeding of the Court by reason only that the number of judges of the Court remains at any time below thirty-seven."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Cap. 49 L",
      "content": "Cap. 49 L . N.N ., 1963 In the event of a conflict between the provisions of this Act and those of the High Court Law of Northern Nigeria, 1963, the provisions of this Act shall prevail and the relevant provisions of the said High Court Law in so far as they affect the Federal Capital Territory shall be deemed repealed to the extent of the conflict. 4. Interpre t ation In this Act- \" Constitut i on\" means the Constitution of the Federal Republic of Nigeria, 1999; \"Court\" means the High Court of the Federal Capital Territory, Abuja established by section 255 of the Constitution; \" F ederal Character of Nigeria\" has the meaning assigned to it in section 318 of the Constitution."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "C",
      "content": "C itation This Act may be cited as the High Court of the Federal Capital Territory, Abuja (Number of Judges) Act, 2003. SU B SIDIARY L E G IS LAT ION No Subsidiary Legislation"
    }
  ],
  "definitions": []
}