{
  "id": "import-prohibition-act",
  "type": "statute",
  "title": "IMPORT (PROHIBITION) ACT",
  "title_en": "IMPORT (PROHIBITION) ACT",
  "short_name": "IMPORT (PROHIBITION) ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=200",
  "provisions": [
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "",
      "content": "section 2 of the Export (Prohibition) Act. [Cap. E22. Schedule.] (2) In addition to the penalty specified in subsection (1) of this section- (a) the goods, as well as any vehicle, vessel, aircraft or other thing whatsoever used in connection with the importation; (b) all the assets, movable or immovable, including motor vehicles, of any person convicted of the offence, shall be forfeited to the Federal Government. (3) Any customs officer or other person who aids, counsels, procures, or conspires with any other person to commit an offence under this section, shall be guilty of an of- fence and liable on conviction to the same punishment as prescribed for the offence under subsection (1) ofthis section. (4) An offence committed under this Act shall be triable by the Federal High Court. 3 . Short title This Act may be cited as the Import (Prohibition) Act. SCHEDULE [Section"
    },
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "",
      "content": "s 1 and 2.] Goods , the importation of whic h is absolutely prohibit e d Meat (whether frozen or not). Chicken (whether frozen or not). Fish (whether frozen or not except those caught and landed by vessels licensed and authorised by the appropriate Nigerian Authority). Expired food products (whether in can or any other packages). All imported foodstuff items (including fruits and vegetables) for which the Minister of Health or the Director-General of the Federal Environmental Agency has issued a certificate of contamination with any toxic or nuclear substance or any other harmful waste as defined in the Harmful Waste (Special Criminal Provisions, etc.) Act. [Cap. H1.] IMPORT (PROHIBITION) ACT SUBSIDIARY LEGISLATION No Subsidiary Legis l ation"
    }
  ],
  "definitions": []
}