{
  "id": "interpretation-act",
  "type": "statute",
  "title": "INTERPRETATION ACT",
  "title_en": "INTERPRETATION ACT",
  "short_name": "INTERPRETATION ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=218",
  "provisions": [
    {
      "provision_ref": "s32",
      "section": "32",
      "title": "Law in force with respect to Federal matters",
      "content": "32. Law in force with respect to Federal matters (1) Subject to the provisions of this section and except in so far as other provision is made by any Federal law, the common law of England and the doctrines of equity, to- gether with the statutes of general application that were in force in England on the 1st day of January, 1900, shall, in so far as they relate to any matter within the legislative com- petence of the Federal legislature, be in force in Nigeria. [L.N. 47 of 1955.] (2) Such Imperial laws shall be in force so far only as the limits of the local jurisdic- tion and local circumstances shall permit and subject to any Federal law. (3) For the purpose of facilitating the application of the said Imperial laws they shall be read with such formal verbal alterations not affecting the substance as to names, lo- calities, courts, officers, persons, moneys, penalties and otherwise as may be necessary to render the same applicable to the circumstances. (4) Every judge or officer of a High Court having or exercising function of the like kind, or analogous to the function of any judge or officer referred to in any such law, shall be deemed to be within the meaning of the enactments thereof relating to such last- mentioned judge or officer, and every magistrate or officer of a magistrate's court having or exercising functions of the like kind, or analogous to the functions of any magistrate, justice of the peace or officer referred to in any such law, shall be deemed to be within the meaning of the enactments thereof relating to such last-mentioned magistrate or offi- cer or such justice of the peace. (5) Where the great seal or any other seal mentioned in any law it shall be read, in its application to a High Court, as if the seal of the High Court were substituted therefor, and, in its application to a magistrate's court, as if the seal of the magistrate's court were substituted therefor. [L.N. 47 of 1955.)"
    },
    {
      "provision_ref": "s33",
      "section": "33",
      "title": "Evidence of signature of fiat or consent of President or public officer",
      "content": "33. Evidence of signature of fiat or consent of President or public officer Whenever the fiat or consent of the President or of any public officer is necessary be- fore any prosecution of action is commenced, any document purporting to bear the fiat or consent of the President or of the public officer concerned shall be received as pr ima fa- cie evidence in any proceeding without proof being given that the signature to such fiat or consent is that of the President or the public officer concerned. 34. Ex-officio proceedings not to abate on death Any civil or criminal proceedings taken by or against any person by virtue of his office shall not be discontinued or abated by his death, resignation, or absence or removal from office, but may be carried on by or against, as the case may be, the person appointed to perform the duties of the office."
    },
    {
      "provision_ref": "s35",
      "section": "35",
      "title": "Carrying out of certain orders",
      "content": "35. Carrying out of certain orders Where in any Act or Law power is given to any authority to impose any fine or make any order or give any directions whatever and it is stated that such fine, order or direction shall be imposed, be recoverable or in any manner have effect as if the same were a fine, order or direction, imposed, made or given by a court or by a judicial or other officer, any such court or judicial or other officer having jurisdiction in the place where such fine, order or direction was imposed, made or given, or where the person who was ordered to pay the tine or who is required to obey the order or direction resides or may happen to be, may take the necessary steps to enforce the payment of the fine or the carrying out of the order or direction, as the case may be, in all respects as if the fine, order or direction had in fact been imposed, made or given by such court or judicial or other officer. [Order 47 of 1951.)"
    },
    {
      "provision_ref": "s36",
      "section": "36",
      "title": "Application of fees, fines and forfeitures",
      "content": "36. Application of fees, fines and forfeitures (1) Where under any Act or Law any person is required to pay any charge or fee for any act or thing done, or document issued, or signature or seal affixed to any document, by any public officer or department, or where any person is adjudged by any court, or other authority duly authorised by law, to payor forfeit any sum of money, such charge or fee and such sum of money shall be paid into the appropriate Treasury, unless the contrary is otherwise provided; and if any such charge or fee, or if any commission on money received or taken possession of, realised, or otherwise dealt with, is required to be paid to any public office or department, such officer or department receiving the same shall pay it into or account for the same in due course to the appropriate Treasury. [Order 47 of 1951. L.N. 131 of 1954.] (2) Nothing in this section shall affect any provision in any Act or Law whereby any shares of fines or forfeitures, or of proceeds of forfeitures, are expressed to be recover- able by any person, or may be granted by any authority to any person. [Order 47 of 1951.] (3) Except where the requirement, judgment or commission referred to in subsec- tion (1) of this section relates to a function of the Government of the Federation, the ex- pression \"appropriate Treasury\" shall be interpreted as meaning the Treasury in the State concerned: Provided that nothing contained in this section shall affect the rights inter se of the Treasuries of the States of the Federation. [L.N. 131 of 1954.]"
    },
    {
      "provision_ref": "s37",
      "section": "37",
      "title": "Interpretation of this Act, etc.",
      "content": "37. Interpretation of this Act, etc. (1) Without prejudice to the provisions of section 18 of this Act, in this Act the fol- lowing expressions have the meanings hereby assigned to them respectively, that is to say&minus; \"Act\" means an Act of the National Assembly, whether passed before or after the commencement of this Act, and includes this Act and an instrument made before the first day of October, 1960, in so far as the instrument has effect as an Act; \"enactment\" means any provision of an Act or subsidiary instrument; \"subsidiary instrument\" means any order, rules, regulations, rules of court or bye- laws made either before or after the commencement of this Act in exercise of powers conferred by an Act. (2) Nothing in this Act shall be construed as purporting to prejudice the provisions of the Constitution of the Federal Republic of Nigeria 1999. [Cap. C23 . ] (3) This Act binds the State."
    },
    {
      "provision_ref": "s38",
      "section": "38",
      "title": "Repeals and savings, etc.",
      "content": "38. Repeals and savings, etc. The enactment specified in the first and second columns of the Schedule to this Act is hereby repealed to the extent shown in the third column of that Schedule. [Schedule.]"
    },
    {
      "provision_ref": "s39",
      "section": "39",
      "title": "Short title",
      "content": "39. Short title This Act may be cited as the Interpretation Act. SCHEDULE [Section 38.] Enactment repealed Chapter or number Short title Extent of repeal Cap. A2 Acts Authentication Act I n section 3, in subsection (1), the words from \"and unless\" onwards. INTERPRETATION ACT SUBSIDIARY LEGISLATION No Subsidiary Legislation"
    }
  ],
  "definitions": [
    {
      "term": "Act",
      "definition": "an Act of the National Assembly, whether passed before or after the commencement of this Act, and includes this Act and an instrument made before the first day of October, 1960, in so far as the instrument has effect as an Act",
      "source_provision": "s37"
    },
    {
      "term": "enactment",
      "definition": "any provision of an Act or subsidiary instrument",
      "source_provision": "s37"
    },
    {
      "term": "subsidiary instrument",
      "definition": "any order, rules, regulations, rules of court or bye- laws made either before or after the commencement of this Act in exercise of powers conferred by an Act. (2) Nothing in this Act shall be construed as purporting to prejudice the provisions of the Constitution of the Federal Republic of Nigeria 1999. [Cap. C23 . ] (3) This Act binds the State",
      "source_provision": "s37"
    }
  ]
}