{
  "id": "minor-offences-miscellaneous-provisions-act",
  "type": "statute",
  "title": "MINOR OFFENCES (MISCELLANEOUS PROVISIONS) ACT",
  "title_en": "MINOR OFFENCES (MISCELLANEOUS PROVISIONS) ACT",
  "short_name": "MINOR OFFENCES (MISCELLANEOUS",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=255",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Abolition of th",
      "content": "Abolition of th e offence of wandering, etc. Notwithstanding anything to the contrary in the Criminal Code, Penal Code (Northern States) Federal Provisions Act, Criminal Procedure Act, Criminal Procedure Code (Northern States) Act or any other enactment or law, as from the commencement of this Act- [Cap. C41. Cap. C42. Cap. C38. Cap. P3.] (a) a person shall not be accused of or charged with- (i) the offence of wandering (by whatever name called); or (ii) any other offence by reason only of his being found wandering (by whatever name called), and, accordingly, any person accused of or charged with such offence shall be released or discharged, as the case may be, forthwith; (b) a person who is accused of a simple offence shall not, by reason only of being accused of such offence, be detained in police or prison custody."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "Interpretation In this Act, unless the context otherwise requires- \" simple offenc e \" means any offence which is declared by law to be a simple offence or is punishable by imprisonment for less than six months."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "S",
      "content": "S hort title This Act may be cited as the Minor Offences (Miscellaneous Provisions) Act. MINOR OFFENCES (MISCELLANEOUS PROVISIONS) ACT SUBSIDIARY LEGISLATION N o Sub s idi a r y L egis l a ti o n"
    }
  ],
  "definitions": [
    {
      "term": "simple offenc e",
      "definition": "any offence which is declared by law to be a simple offence or is punishable by imprisonment for less than six months",
      "source_provision": "s2"
    }
  ]
}