{
  "id": "national-mathematical-centre-act",
  "type": "statute",
  "title": "NATIONAL MATHEMATICAL CENTRE ACT",
  "title_en": "NATIONAL MATHEMATICAL CENTRE ACT",
  "short_name": "NATIONAL MATHEMATICAL CENTRE ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=320",
  "provisions": [
    {
      "provision_ref": "s23",
      "section": "23",
      "title": "",
      "content": "section 23 thereof, is hereby vested in and shall be exercisable by the Council and not by any other person or authority. PART IV A c adem ic Boa r d 10. Establishment of an Academic Board for the Centre (I) There is hereby established as an integral part of the Centre, an Academic Board which shall consist of- (a) the Director of the Centre; ( b) the Deputy Director; (c ) the librarian; ( d) four representatives drawn in rotation from among the universities in Nigeria in the discipline of mathematical sciences; and ( e ) tive other persons, for the time being holding such appointments on the staff of the Centre as the Director of the Centre may, with the approval of the Council, specify. (2) A person other than an ex- o ffi c i o member shall hold an appointment on the Academic Board under paragraphs Cd) and (e ) of subsection (I) of this section for a period of two years and shall be eligible for reappointment for one further period of two years. (3) The Academic Board shall- (a) formulate and continuously evaluate the academic programme of the Centre; and ( b) perform such other functions as are traditional to such bodies as the Council may, from time to time, direct. (4) The Director shall be the chairman at the meeting of the Academic Board and in his absence, the Deputy Director shall preside at such meeting but, in the absence of both, the members present at the meeting shall appoint one of their number to preside at the meeting. (5) Subject to subsection (4) of this section, the Academic Board shall have power to regulate its own procedure. PART V Fi na n c i a l pro v i sio n s 11 . F und of the C e ntr e (I) The Centre shall establish and maintain a fund from which shall be defrayed all expenditure incurred by the Centre in the performance of its functions under this Act. (2) There shall be paid and credited to the fund established pursuant to subsection (I) of this section- ( a) such sums as may, from time to time, be granted to the Centre by the Federal Government; ( b ) fees charged for services rendered by the Centre; and (c) subject to"
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "",
      "content": "section 6 (c) of this Act, all sums accruing to the Centre by way of gifts, grants-in-aid, testamentary disposition and endowments or contribution from philanthropic persons or organisations or otherwise howsoever. 12 . A nnual e s tim a te , account s and audit (I) The Council shall cause to be prepared, not later than 30 September in each year, an estimate of the expenditure and income of the Centre during the next succeeding year, and when prepared, they shall be submitted to the President. (2) The Council shall cause to be kept proper accounts of the Centre and proper records in relation thereto and when certified by the Council, such accounts shall be audited as provided in subsection (3) of this section. (3) The accounts of the Centre shall be audited within six months after the end of each year by auditors appointed by the Council from the list and in accordance with the guidelines supplied by the Auditor-General for the Federation; and the fees of the auditors and the expenses of the auditors generally shall be paid from the funds of the Centre. 1 3 . A nnual r e por t The Council shall, not later than 31 December in each year, submit to the President a report in such form as the Minister may, from time to time, direct, on the activities of the Centre during the preceding year and shall include in such report the audited accounts of the Centre. PART VI Miscellaneous 14. Regulations The Minister may make regulations for the purpose of giving effect to the provisions of this Act. 15. Interpretation In this Act, unless the context otherwise requires- \"Centre\" means the National Mathematical Centre, established by section I (I) of this Act; \"chairman\" means the chairman of the Council; \"Council\" means the Governing Council of the Centre, established by"
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "",
      "content": "section 2 of this Act; \"Director\" means the Director of the Centre, appointed under"
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "",
      "content": "section 7 of this Act; \"member\" means a member of the Council and includes the chairman; \"Minister\" means the Minister charged with responsibility for matters relating to higher education. 16. Short title This Act may be cited as the National Mathematical Centre Act. SCHEDULE [Section 2 (5).] Pr ocee din gs o f th e C o uncil 1. (I) Subject to this Act and to"
    },
    {
      "provision_ref": "s27",
      "section": "27",
      "title": "",
      "content": "section 27 of the Interpretation Act (which provides for the decisions of a statutory body to be taken by a majority of the members of the body and for the person presiding to have a second or casting vote), the Council may make standing orders regulating the proceedings of the Councilor of any committee thereof. [Cap. /23.] (2) The quorum of the Council shall be seven and the quorum of any committee of the Council shall be as determined by the Council. 2. (I) The Council shall meet not less than three times in each year and, subject thereto, the Council shall meet whenever it is summoned by the chairman; and if the chairman is required to do so by notice given to him by not less than three other members, he shall summon a meeting of the Council to be held within fourteen days from the date on which the notice is given. (2) At any meeting of the Council, the chairman shall preside, but if he is absent, the members present at the meeting shall appoint one of their number to preside at that meeting. (3) Where the Council desires to obtain the advice of any person on a particular matter, the Council may co-opt him as a member for such period as it thinks fit, but a person who is a member by virtue of this sub-paragraph shall not be entitled to vote at any meeting of the Council and shall not count towards the quorum. C o mmitt e e s 3. (I) The Council may appoint one or more committees to carry out, on its behalf, such of its functions as the Council may determine. (2) A committee appointed under this paragraph shall consist of such number of persons (not necessarily members of the Council), as may be determined by the Council; and a person other than a member of the Council shall hold office on the committee in accordance with the terms of his appointment. (3) A decision of a committee of the Council shall be of no effect until it is confirmed by the Council. Mis c e llan eo u s 4. (1) The fixing of the seal of the Centre shall be authenticated by the signature of the chairman or of some other members authorised generally or specially to act for that purpose by the Council. (2) Any contract or instrument which, if made or executed by a person not being a body corporate, would not be required to be under seal, may be made or executed on behalf of the Centre by the Director or any person generally or specially authorised to act for that purpose by the Council. (3) Any document purporting to be a document duly executed under the seal of the Centre shall be received in evidence and shall, unless the contrary is proved, be presumed to be so executed. (4) Members of the Council who are not public officers shall be paid out of monies at the disposal of the Council such remunerations, fees or allowances in accordance with such scales as may be approved, from time to time, by the President. (5) The validity of any proceeding of the Councilor of a committee thereof, shall not be affected by any vacancy in the membership of the Councilor a committee or by any defect in the appointment of any member of the Councilor a committee, or by reason that a person not entitled to do so, took part in the proceedings. (6) Any member of the Councilor any person holding office on a committee of the Council who has a personal interest in any contract or arrangement entered into or proposed to be considered by the Councilor a committee thereof, shall forthwith disclose his interest to the Council and shall not vote on any question relating to the contract or arrangement. SUBSIDIARY LEGISLATION N o Sub si d iary L eg i s l a ti o n"
    }
  ],
  "definitions": []
}