{
  "id": "national-theatre-and-the-national-troupe-of-nigeria-board-act",
  "type": "statute",
  "title": "NATIONAL THEATRE AND THE NATIONAL TROUPE OF NIGERIA BOARD ACT",
  "title_en": "NATIONAL THEATRE AND THE NATIONAL TROUPE OF NIGERIA BOARD ACT",
  "short_name": "NATIONAL THEATRE AND THE NATIONAL",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=341",
  "provisions": [
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "C",
      "content": "12. C apital maintenance of the National Theatre Capital maintenance of the National Theatre shall be the responsibility of the Government of the Federation. 13. Borrowing power s (1) The Board may, with the consent or in accordance with the general authority given by the President, borrow by way of loan such sums as it may require in the exercise of its functions under this Act. (2) The Board may, subject to the provisions of this Act and the conditions of any trust created in respect of any property, invest all or any of its funds in securities as may be approved by the Minister."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "A",
      "content": "14. A c c ount s and audit The Board shall keep proper accounts in respect of each year and proper records relating thereto and shall cause the accounts to be audited within six months after the end of each year by auditors appointed from the list and in accordance with the guidelines supplied by the Auditor-General for the Federation; and the fees and expenses of the auditors shall be paid from the funds of the Board."
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "A",
      "content": "15. A nnual report The Board shall, within six months after the end of each year, submit through the Minister to the President, a report on the activities of the Board during the last preceding year and shall include in such report the audited accounts of the Board for that year and the auditor's comments thereon. Miscellaneous 16. Power of the Minister to give directives The Minister may give to the Board directives of a general nature with respect to any of the functions of the Board and it shall be the duty of the Board to comply with such directives or cause them to be complied with. 17. Regulations The Minister may make regulations generally for carrying into effect the provisions of this Act and without prejudice to the generality of the foregoing, regulations may provide for- (a) the functions and responsibilities of the general manager and the deputy general manager of the National Theatre, the Artistic Director and the deputy Ar- tistic Director of the Troupe; (b) the disciplinary control of all officers and employees of the National Theatre and the Troupe; (c) such other matters as may appear to the Minister expedient to facilitate the operation of the provisions of this Act. 18. Interpretation In this Act, unless the context otherwise requires- \"Board\" means the National Theatre and the National Troupe of Nigeria Board established by section 1 of this Act; \"chairman\" means the chairman of the Board; \"members\" includes the chairman; \"Minister\" means the Minister charged with responsibility for matters relating to culture; \"Troupe\" means the National Troupe of Nigeria. 19. Short title This Act may be cited as the National Theatre and the National Troupe of Nigeria Board Act. S uppl e mentar y provisi o ns relating t o the Board , e tc . 1. Subject to this Act and section 27 of the Interpretation Act the Board may make standing orders regulating the proceedings of the Board or any committee thereof. 2. Every meeting of the Board shall be presided over by the chairman and if the chairman is unable to attend any particular meeting, a member may be appointed by the members present to act as chairman for that particular meeting. 3. (I) The Board shall meet for the conduct of business at such times, places and on such dates as the chairman may appoint but shall meet not less than twice in a year. (2) The chairman may at any time and shall at the request in writing of the Minister or not less than four members, summon a meeting of the Board. (3) Particulars of the business to be transacted at any meeting shall be circulated to members with the notice of the meeting. 4. (I) Every question put before the Board at a meeting shall be decided by a majority of the votes of the members present and voting. (2) The Chairman shall at any meeting of the Board have a vote and in case of an equality of votes, may exercise a casting vote. S. (1) Fi ve members of the Board shall form a quorum at any meeting of the Board. (2) The quorum of any committee set up by the Board shall be as may be determined by the Board. 6. Where any standing order made by the Board provides for a committee of the Board to consist of co-opted persons who are not members of the Board, the committee may advise the Board on any matter referred to it by the Board. 7. The fixing of the seal of the Board shall be authenticated by the signature of the chairman or of the general manager of the National Theatre or such other member or officer of the Board as the Board may determine. 8. Any contract or instrument which, if made by a person not being a body corporate, would not be required to be under seal, may be made or executed on behalf of the Board by the gen- eral manager of the National Theatre or by any other person generally or specifically authorised to act for the purpose by the Board. 9. Any document purporting to be a contract, instrument or other document duly signed or sealed on behalf of the Board shall be received in evidence and, unless the contrary is proved, be presumed without further proof to have been so signed or sealed. 10. The validity of any proceeding of the Board or committee thereof shall not be adversely affected- (a) by any vacancy in the membership of the Board or committee; or (b) by any defect in the appointment of a member of the Board or committee. 11. Any member of the Board or committee thereof who has personal interest in any matter proposed to be considered by the Board or committee thereof shall forthwith disclose his in- terest to the Board or committee and shall not vote on any question relating to the contract or arrangement. Miscellaneous"
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Power of the Minister to give directives",
      "content": "16. Power of the Minister to give directives The Minister may give to the Board directives of a general nature with respect to any of the functions of the Board and it shall be the duty of the Board to comply with such directives or cause them to be complied with."
    },
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "Regulations",
      "content": "17. Regulations The Minister may make regulations generally for carrying into effect the provisions of this Act and without prejudice to the generality of the foregoing, regulations may provide for- (a) the functions and responsibilities of the general manager and the deputy general manager of the National Theatre, the Artistic Director and the deputy Ar- tistic Director of the Troupe; (b) the disciplinary control of all officers and employees of the National Theatre and the Troupe; (c) such other matters as may appear to the Minister expedient to facilitate the operation of the provisions of this Act."
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "Interpretation",
      "content": "18. Interpretation In this Act, unless the context otherwise requires- \"Board\" means the National Theatre and the National Troupe of Nigeria Board established by section 1 of this Act; \"chairman\" means the chairman of the Board; \"members\" includes the chairman; \"Minister\" means the Minister charged with responsibility for matters relating to culture; \"Troupe\" means the National Troupe of Nigeria."
    },
    {
      "provision_ref": "s19",
      "section": "19",
      "title": "Short title",
      "content": "19. Short title This Act may be cited as the National Theatre and the National Troupe of Nigeria Board Act. SCHEDULE [Section 3 (3).] Supplementary provisions relating to the Board , etc. 1. Subject to this Act and section 27 of the Interpretation Act the Board may make standing orders regulating the proceedings of the Board or any committee thereof. 2. Every meeting of the Board shall be presided over by the chairman and if the chairman is unable to attend any particular meeting, a member may be appointed by the members present to act as chairman for that particular meeting. 3. (I) The Board shall meet for the conduct of business at such times, places and on such dates as the chairman may appoint but shall meet not less than twice in a year. (2) The chairman may at any time and shall at the request in writing of the Minister or not less than four members, summon a meeting of the Board. (3) Particulars of the business to be transacted at any meeting shall be circulated to members with the notice of the meeting. 4. (I) Every question put before the Board at a meeting shall be decided by a majority of the votes of the members present and voting. (2) The Chairman shall at any meeting of the Board have a vote and in case of an equality of votes, may exercise a casting vote. 5. (I) Five members of the Board shall form a quorum at any meeting of the Board. (2) The quorum of any committee set up by the Board shall be as may be determined by the Board. 6. Where any standing order made by the Board provides for a committee of the Board to consist of co-opted persons who are not members of the Board, the committee may advise the Board on any matter referred to it by the Board. 7. The fixing of the seal of the Board shall be authenticated by the signature of the chairman or of the general manager of the National Theatre or such other member or officer of the Board as the Board may determine. 8. Any contract or instrument which, if made by a person not being a body corporate, would not be required to be under seal, may be made or executed on behalf of the Board by the gen- eral manager of the National Theatre or by any other person generally or specifically authorised to act for the purpose by the Board. 9. Any document purporting to be a contract, instrument or other document duly signed or sealed on behalf of the Board shall be received in evidence and, unless the contrary is proved, be presumed without further proof to have been so signed or sealed. 10. The validity of any proceeding of the Board or committee thereof shall not be adversely affected- (a) by any vacancy in the membership of the Board or committee; or ( b ) by any defect in the appointment of a member of the Board or committee. 11. Any member of the Board or committee thereof who has personal interest in any matter proposed to be considered by the Board or committee thereof shall forthwith disclose his in- terest to the Board or committee and shall not vote on any question relating to the contract or arrangement. SUBSIDIARY LEGISLATION No Subsidiar y Legi s lation"
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "the National Theatre and the National Troupe of Nigeria Board established by section 1 of this Act",
      "source_provision": "s18"
    },
    {
      "term": "chairman",
      "definition": "the chairman of the Board",
      "source_provision": "s18"
    },
    {
      "term": "members",
      "definition": "the chairman",
      "source_provision": "s18"
    },
    {
      "term": "Minister",
      "definition": "the Minister charged with responsibility for matters relating to culture",
      "source_provision": "s18"
    },
    {
      "term": "Troupe",
      "definition": "the National Troupe of Nigeria",
      "source_provision": "s18"
    }
  ]
}