{
  "id": "national-human-rights-commission-act",
  "type": "statute",
  "title": "NATIONAL HUMAN RIGHTS COMMISSION ACT",
  "title_en": "NATIONAL HUMAN RIGHTS COMMISSION ACT",
  "short_name": "NATIONAL HUMAN RIGHTS COMMISSION ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=308",
  "provisions": [
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Annual estimates, accounts and audit",
      "content": "15. Annual estimates, accounts and audit (1) The Council shall cause to be prepared, not later than 30th September in each year, an estimate of the expenditure and income of the commission during the next succeeding year and when prepared they shall be submitted, through the Attorney-General of the Federation, to the Federal Executive Council for approval. (2) The Council shall cause to be kept proper accounts and proper records in relation thereto and when certified by the Council such account shall be audited as provided in subsection (3) ofthis section. (3) The accounts of the Commission shall be audited by auditors appointed from the list of auditors and in accordance with the guidelines issued by the Auditor-General for the Federation and the fees of the auditors and the expenses for the audit generally shall be paid from the funds of the Commission."
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Annual reports",
      "content": "16. Annual reports The Council shall, not later than six months after the end of each year, submit, through the Attorney-General of the Federation, to the President a report on the activities of the Commission and its administration during the immediately preceding year and shall include in the report the audited accounts of the Commission and the auditor's comments thereon. PART V Miscellaneous"
    },
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "Power of the Attorney-General of the Federation to give directives",
      "content": "17. Power of the Attorney-General of the Federation to give directives Subject to the provisions of this Act, the Attorney-General of the Federation may give to the Council such directives of a general nature with regard to the exercise by the Council of its functions under this Act."
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "Regulations",
      "content": "18. Regulations The Attorney-General of the Federation may make such regulations as he deems to be necessary or expedient for giving full effect to the provisions of this Act. 19. Interpretation In this Act, unless the context otherwise requires- \"Commission\" means the National Human Rights Commission established under section I (I) of this Act; \"Council\" means the Governing Council established for the Commission under sec- tion 2 (I) of this Act; \"President\" means the President of the Federal Republic of Nigeria. 20. Short title This Act may be cited as the National Human Rights Commission Act. SCHEDULE [Section 2 (4).] Supplementary provisions relating to the Council, etc . Proceedings of the Council 1. (I) Subject to this Act and section 27 of the Interpretation Act, the Council may make standing orders regulating its proceedings or those of any of its committees. [Cap. 123.] (2) The quorum of the Council shall be nine members, including the chairman or, in his absence, the person elected under paragraph 2 (2) of this Schedule to preside, and seven other members and the quorum of any committee of the Council shall be determined by the Council. 2. (I) The Council shall meet at least once a month in each calendar year and subject thereto, the Council shall meet whenever it is summoned by the chairman, and if the chairman is required to do so, by notice given to him by not less than four other members, he shall summon a meeting of the Council to be held within fourteen days from the date on which the notice is given. (2) At any meeting of the Council, the chairman shall preside but if he is absent, the members present at the meeting shall elect one of their number to preside at that meeting. (3) Where the Council desires to obtain the advice of any person on a particular matter, the Council may co-opt him to the Council for such period as it thinks fit, but a person who is in attendance by virtue of this sub-paragraph shall not be entitled to vote at any meeting of the Council and shall not count towards a quorum. (4) The decision of the Council shall be by simple majority. Committees 3. (l) The Council may appoint one or more committees to carry out, on behalf of the Council, such of its functions as the Council may determine. (2) A committee appointed under sub-paragraph (1) of this paragraph shall consist of such number of persons (not necessarily members of the Council) as may be determined by the Council, and a person other than a member of the Council shall hold office on the committee in accordance with the terms of his appointment. (3) A decision of a committee of the Council shall be of no effect until it is confirmed by the Council. Mi sce LL aneous 4. (I) The fixing of the seal of the Commission shall be authenticated by the signature of the chairman or of any person specifically authorised to act for that purpose by the Council. (2) Any contract or instruments which, if made or executed by a person, not being a body corporate, would not be required to be under seal may be made or executed on behalf of the Commission by the chairman or any person specifically authorised to act for that purpose by the Council. (3) Any document purporting to be a document duly executed under the seal of the Commission shall be received in evidence and shall, unless and until the contrary is proved, be presumed to be so executed. (4). The validity of any proceedings of the Councilor of a committee thereof shall not be adversely affected by any vacancy in the membership of the Councilor committee, or by any defect in the appointment of a member of the Councilor of a committee, or by reason that a person not entitled to do so took part in the proceedings of the Councilor committee. (5). Any member of the Councilor of a committee of the Council who has a personal interest in any contract or arrangement entered into or proposed to be considered by the Councilor committee shall disclose his interest to the Councilor committee and shall not vote on any question relating to the contract or arrangement. SUBSIDIARY LEGISLATION No Sub s idiar y L eg i s lation"
    }
  ],
  "definitions": []
}