{
  "id": "national-security-agencies-act",
  "type": "statute",
  "title": "NATIONAL SECURITY AGENCIES ACT",
  "title_en": "NATIONAL SECURITY AGENCIES ACT",
  "short_name": "NATIONAL SECURITY AGENCIES ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=336",
  "provisions": [
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "",
      "content": "section 9 of the Official Secrets Act. [Cap. 03.] Principal officers of the Agencies (I) There shall be appointed for each of the agencies, a principal officer, who shall be known by such designation as the President may determine. (2) The principal officers of the agencies shall in the discharge of their functions under this Act- (a) in the case of the State Security Service and the National Intelligence Agency, be responsible directly to the President; and (b) in the case of the Defence Intelligence Agency, be directly responsible to the Chief of Defence Staff. Co-ordinator on National Security (1) For the purpose of co-ordinating the intelligence activities of the National Security Agencies set up under section I of this Act, there shall be appointed by the President a Co-ordinator on National Security. (2) The Co-ordinator on National Security shall be a principal staff officer in the office of the President. (3) The Co-ordinator on National Security shall be charged with the duty of- (a) advising the President on matters concerning the intelligence activities of the agencies; (b) making recommendations in relation to the activities of the agencies to the President, as contingencies may warrant; (c) correlating and evaluating intelligence reports relating to the national security and providing the appropriate dissemination of such intelligence within Government, using existing facilities as the President may direct; (d) determining the number and level of staff to be employed by each agency established pursuant to section I of this Act and organising the transfer and posting of staff, especially the transfer and posting of existing staff of the Nigerian Security Organisation established pursuant to the Nigerian Security Organisation Act 1976, repealed by"
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "",
      "content": "section 7 (1) of this Act; (e) doing such other things in connection with the foregoing provisions of this section as the President may, from time to time, determine. Establishment of advisory councils (1) There shall, in the interest of national security, be established two advisory councils, that is to say- (a) the National Defence Council; (b) the National Security Council. (2) The National Security Council shall be charged with responsibility for matters relating- (a) to public security; and (b) generally to the structure, staff and other matters concerning the agencies set up under this Act. (3) The National Defence Council shall advise the President on all matters concerning the defence of the sovereignty and territorial integrity of Nigeria. Instruments relating to the advisory councils, the structure, etc., of the Agencies The President may by an instrument under his hand make provisions with respect to the following matters, that is to say- (a) the composition, membership and appointment to the advisory councils established by"
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "",
      "content": "section 5 (1) of this Act; (b) the structure of each of the agencies set up under this Act (including the designation and the appointment of the principal officers of the agency concerned) and the manner in which each agency is to be administered; (c) the manner in which the powers of each agency is to be exercised and the conferment on specified officers of the agencies, of the powers of a superior police officer; and (d) such other matters concerning or incidental to any of the matters mentioned in this Act as the President may deem fit. Repeal, etc. (I) The Nigerian Security Organisation Act is hereby repealed. (2) If any other law is inconsistent with the provisions of this Act, the provisions of this Act shall prevail and that other law shall, to the extent of the inconsistency, be void. 8. Short title This Act may be cited as the National Security Agencies Act. SUBSIDIARY LEGISLATION No Subsidiary Legislation"
    }
  ],
  "definitions": []
}