{
  "id": "national-inland-waterways-authority-act",
  "type": "statute",
  "title": "NATIONAL INLAND WATERWAYS AUTHORITY ACT",
  "title_en": "NATIONAL INLAND WATERWAYS AUTHORITY ACT",
  "short_name": "NATIONAL INLAND WATERWAYS AUTHORITY ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=309",
  "provisions": [
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "",
      "content": "section 6 of this Act any member who is ab sent from two consecutive ordinary meetings of the Board shall file his explanation in writing wi th the secretary for consideration by the Board and where the explanation is unacceptable to th e Board the Board may recommend to the Minister that the member be removed, and th e Minister may declare, in writing, such a removal. PART II F un ct i o n s a nd p owe r s G eneral functions of the Authority It shall be the functions of the Authority to- (a) provi de regulations for inland navigation; ( b ) ensure the development of infrastructural facilities for a national inlan d water- ways network connecting the creeks and the rivers with the economic cen tres using the river-ports as nodal points for intermodel exchange; and (c ) ensure the development of indigenous technical and managerial skill to meet t he challenges of modern inland waterways transportation. Other functions a nd powers of the Authority O ther functions and powers of the Authority shall be to- (a ) undertake capital and maintenance dredging; (b) und ertake hydrological and hydrographic surveys; (c) d esign ferry routes; (d) s urvey, remove, and receive derelicts, wrecks and other obstructions from in- land waterways; (e) o perate ferry services within the inland waterways system; (f ) undertake installation and maintenance of lights, buoys and all navigational a ids along water channels and banks; (g) i ssue and control licences for inland navigation, piers, jetties, dockyards; ( h ) examine and survey inland water crafts and shipyard operators; ( i ) grant permit and licences for sand dredging, pipeline construction, dredgin g of slots and crossing of waterways by utility lines, water intake, rock blasting a nd remova l; (j) gra nt licences to private inland waterway operators; ( k ) approve designs and construction of inland river crafts; ( l ) approve and control all- (i) j etties, dockyards, piers within the inland waterways ; (ii) advertising within the right-of-way of the waterways; (m) re claim land within the right-of-way; ( n ) undertake the construction, administration and maintenance of inland riverports and jetties; (0) p rovide hydraulic structures for river and dams, bed and bank stabilisation , barrages, groynes; ( P ) collect river tolls; (q) und ertake the production, publication and broadcasting of navigationa l publica tions, bulletins and notices, hydrological year books, river charts and river maps; (r) ca rry out consultancy and contractual services; (s) re present the Government of Nigeria at national and international commission s that deal with navigation and inland water transportation; (t ) subject to the provisions of the Environmental Impact Assessment Act, carr y out environmental impact assessment of navigation and other dredging activi ties within the inland water and its right-of-ways; [Cap . ] (v) unde rtake erection and maintenance of gauges, kilometre boards, horizonta l and vertical control marks; (v) a dvise government on all border matters that relate to the inland waters ( w) undertake acquisition, leasing and hiring of properties; (x) r un cruise boats; (y ) carry out boat repairs, boat construction and dockyard services; and (z ) clear water hyacinth and other aquatic weeds. PART III D ec la r at i o n o f na v i g abl e wa t e r ways, e t e . 10 . Declaration of navigable waterways T he rivers and their tributaries, distributaries, creeks, lakes, lagoons and intra-coasta l waterways specified in the Second Schedule to this Act are hereby declared Federal navigable waterways. [S econd Schedule.] 11. Area under control of the Authority A ll navigable waterways, inland waterways, river-ports and internal waters of Nigeri a, excluding all direct approaches to the ports listed in the Third Schedule to this Act and a ll other waters declared to be approaches to ports under or pursuant to the Nigerian Ports Authority Act, up to 250 metres beyond the upstream edge of the quay of such ports, sha ll be under the exclusive management, direction and control of the Authority. [Thir d Schedule. Cap. N 126.] 1 2. Right to land use for navigable purposes including right of way, (I) Sub ject to the provisions of the Lands (Title Vesting, etc.) Act, the right of l and u sage for improvement of navigability and provision of infrastructure shall cover areas o n both banks of the waterways which would be submerged in a flood of 100 years return p eriod. [ Cap, L7,] (2) In case of waterways with steep banks where such flood have no overban k flow, th e right of way shall include the areas of land along the waterway measu red 100 metres perpendicular from the edge of the channel. 13 . Right to land within right of way (I) N otwithstanding the provisions of the Land Use Act or any other enactment, but subject to the provisions of the Lands (Title Vesting, etc.) Act, the Authority shall have right to all land within the right-of-way of declared waterways and shall use such lan d in the interest of navigation. [ Cap, L5. Cap, L7. ] (2) No person including a State shall- (a) obs truct a declared waterway, take sand, gravel or stone from any declare d waterway ; or (b) erec t permanent structures within the right-of-way or divert water from a dec lared waterway; (c) ca rry out any of the activities as specified in"
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "",
      "content": "section 9 of this Act, with out the written consent, approval or permission of the Authority. PART IV Staff of the Authority 14. Appointment, etc., of the Managing Director ( 1) There shall be for the Authority a Managing Director who shall be- (a) a ppointed by the President; ( b ) the Chief Executive of the Authority. (2) The Managing Director shall be responsible for- (a) th e execution of the policies of the Authority; and ( b ) the day-to-day running of the affairs of the Authority. (3) S ubject to the provisions of this Act, a person appointed to be the Man aging Di rector of the Authority, shall hold office for a period of four years from the date of hi s appointment and may be eligible for re-appointment for a further four-year period. ( 4) The Managing Director may be removed by the President on grounds of misco n duct or inability to perform the functions of his office. 15 . Appointment of secretary and other staff of the Authority ( 1) The Authority shall appoint a secretary to the Authority who- (a) s hall keep records as well as conduct the correspondence of the Authority; and (b ) perform such other duties as the Board or the Managing Director m ay, from time to time, direct. ( 2) The Authority may appoint such other staff and agents as it deems necessary fo r the efficient performance of its duties under this Act. 16. Condition s of service of staff ( 1) The Authority may, with the approval of the Minister, make rules relating gene ra lly to the conditions of service of the officers and other employees of the Authority, a nd w ithout prejudice to the generality of the foregoing, the rules may provide for- (a) th e appointment and disciplinary control of all employees of the Authority; and (b) a ppeals by such employees against dismissal or other disciplinary measures. (2) Rules made under subsection (I) of this section need not be published in th e Ga ze t te but the Authority shall bring them to the notice of all affected persons in suc h manner as it may, from time to time, determine. 17. Applicatio n of Pensions Act ( 1) It is hereby declared that service in the employment of the Authority shall b e an approved service under the Pensions Act, and accordingly, employees of the Authority sha ll, in respect of their services, be entitled to pensions, gratuities and other retireme nt benefits as are prescribed thereunder. [ Cap. P4.J (2) Notwithstanding the provisions of subsection (I) of this section, nothing in thi s Ac t shall prevent the appointment of a person to any office on terms which preclude th e gra nt of a pension and gratuity in respect of that office. ( 3) For the purposes of the application of the Pensions Act, any power exercisabl e the reunder by the Minister or authority other than the Federal Government (not being th e power to make regulations under"
    },
    {
      "provision_ref": "s23",
      "section": "23",
      "title": "",
      "content": "section 23 thereof) is hereby vested in and shall be exer cisa ble by the Authority and not by any other person or authority. [ Cap. P4.] (4) S ubject to subsection (2) of this section, the Pensions Act shall, in its applicatio n by virtue of subsection (3) of this section to any office, have effect as if the office were in the public service of the Federation within the meaning of the Constitution of the Federa l Republic of Nigeria 1999. [Cap. P4 . Cap. C23. ] PART V Financial pr ov i s i o n s 18. Fund of the Authority T he Authority shall establish a fund which shall consist of- (a) t ake-off grants provided to it by the Government for the running expen ses of the Authority; (b) s uch sums as may be collected or received by the Authority by way of du es, rates and taxes; and (c) s uch sums as may be collected or received by the Authority from other sour ces e ither in respect of any property vested in the Authority or otherwise howsoever. 19. Surplus funds T he Authority shall have the power to invest its funds, and maintain a general reserve. 20. Borrowing power ( I) The Authority may, with the approval of the Minister, from time to time, borro w such sums as it may require in the exercise of its functions under this Act. (2) The Authority shall not, without the approval of the Minister, borrow any sum of money . 21 . Annual estimates, accounts and audit (I) The Authority shall submit to the Minister, not later than 30 September in eac h year, an estimate of its expenditure and income during the next succeeding year. (2) T he Authority shall keep proper accounts and shall prepare in respect of each yea r a sta tement of audited accounts in such form as the Minister may direct. ( 3) The Authority shall as soon as is possible after the end of the year to which th e accounts relate cause its accounts to be audited by qualified auditors appointed by th e Authority from the list and in accordance with the guidelines supplied by the Audit or- General for the Federation. (4) T he auditors shall on completion of the audit of the accounts of the Authorit y for each year prepare and submit to the Authority the following two reports that is to say- (a) a g eneral report setting out the observations and recommendations of the auditors on the financial affairs of the Authority generally for that year and on an y important matters which the auditors may consider necessary to bring to th e notice of the Authority; and ( b ) a detailed report containing the observations and recommendations of th e auditors on all aspects of the operations of the Authority for the year. 22. Annual report s T he Authority shall prepare and submit to the President, through the Minister, not later than 30 June in each year a report in such form as may be directed on the activiti es of the Authority during the immediately preceding year, and shall include in such report a copy of the audited account of the Authority for that year and the auditor's report thereon. P ART VI M isce ll aneo u s 23. Offence s and penaltie s ( I) Subject to the provisions of the Lands (Title Vesting, etc.) Act and the Nigeri an Ports Authority Act any person who wilfully or negligently and without the consent of th e Authority- [ Cap. L7. Cap. N126.] (a) u ses the area of land along the waterfront measured 100 metres perpendicul ar from the edge of both banks; ( b ) obstructs the waterways with rafts, nets, logs, cask of oil, dredgers, bar ges, pipelines, pylons, bridges; (c) t akes sand, gravel or stone from the waterways either by manual, hydraulic o r mechanical means; ( d ) erects or operates permanent structures of any kind such as gauges, jetti es, piers, wharves, slipway, floating or mobile dry-docks within the waterways; ( e) diverts water from the waterways either through suction or canalisation me tho ds; ( j) performs hydrographic surveys, seismic surveys, drilling, blasting, underwate r e ngineering works within the waterways; (g) e rects pylon, electricity and telephone or telegraphic cables within or across th e right-of-way of the waterways; ( h ) operates river crafts within inland waterways; and (i) dama ges or tampers with the structures of the Authority, including gauges , buoys, kilometre boards, navigation aids, horizontal and vertical control marks, i s guilty of an offence under this Act. (2) A person who is guilty of an offence under subsection (I) of this section is liabl e on co nviction to a fine not exceeding #50,000 or to imprisonment for a period of si x mo nths or to both such tine and imprisonment and, in the case of a continuing offen ce, to an a dditional fine or # I 00 for every day or part of a day that the offence continues. (3) With respect to subsection (I) paragraph (c) of this section, the offender shall p ay 100 per cent of the prevailing market price of the sand dredged, or forfeit the sa nd dredged on failure to pay tine. ( 4) Where an offence under this Act has been committed by a body corporate or fi rrn or association of individuals, it shall be liable upon conviction to a tine of #200,000 a nd in the case of a continuing offence, to an additional fine of # I ,000 for every day or pa rt of a day that the offence continues. 24 . Power to own land T he Authority shall have the power to acquire, develop and use landed property. 25. Power to accept gifts ( I) The Authority may accept gifts of land, money or other property, upon such term s and conditions, if any, as may be specified by the person or organisation making the gift. (2) The Authority shall not accept any gift if the conditions attached by the person or orga nisation making the gift are inconsistent with the objectives and functions of th e Autho rity. 26. Time limitation of suits against the Authority ( I) Notwithstanding anything in any other enactment, no suit against the Authority, a mem ber or any staff of the Authority for any act done in pursuance or execution of an y enac tment or law or any public duty or authority, or in respect of any alleged neglect o r default in the execution of such enactment or law, duty or authority, shall lie or be ins ti tuted in any court unless it is commenced within three months next after the act, neglect o r default complained of or, in the case of a continuance of damage or injury, within thr ee mont hs next after the ceasing thereof. (2) E very member, agent, auditor or staff for the time being of the Authority shall b e inde mnified out of the assets of the Authority against any liability incurred by him in d efendi ng any proceeding whether civil or criminal, in which judgment is given in hi s favo ur or in which he is acquitted, if any such proceeding is brought against him in hi s capac ity as such member, agent, auditor or staff as aforesaid. (3) In any action or suit against the Authority no execution or attachment or pr ocess in the nature thereof shall be issued against the Authority, but any sums of money whic h may by the judgment of the court be awarded against the Authority shall, subject to any d irections given by the court where notice of appeal has been given by the Authori ty in res pect of the said judgment, be paid by the Authority from the funds of the Authority. 27. Dissolution of Inland Waterways Department and transfer of assets an d l i ability (1 ) The Inland Waterways Department of the Federal Ministry of Transport (in thi s section referred to as \"the Department\") is hereby dissolved. (2) By virtue of this Act, there shall be vested in the Authority immediately at th e commencement of this Act, without further assurance, all assets, funds, resources an d ot her moveable or immovable property which immediately before the commencement of this Act were vested in the Department. (3) As f rom the commencement of this Act- ( a ) all rights, interests, obligations and liabilities of the Department existin g im mediately before the commencement of this Act under any contract or instru m ent or at law or in equity shall by virtue of this A"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "",
      "content": "Section 3 (3). ) Su p p l emen t ary pr ov i sio n s r e l a ti n g t o t h e A u t h or i t y Pr o c ee d i n gs o f th e B o ard 1. Subject to this Act and"
    },
    {
      "provision_ref": "s27",
      "section": "27",
      "title": "",
      "content": "section 27 of the Interpretation Act (which provides for decision s of a statutory body to be taken by a majority of its members and for the person presiding a t any meeting when a vote is ordered to have a second or casting vote), the Board may mak e standing orders regulating its proceedings or that of any of its committee thereof. [Ca p. 123) 2. Every meeting of the Board shall be presided over by the chairman or, if the chairman i s un able to attend a particular meeting, the members present at the meeting shall elect one person amongst them to preside at the meeting. 3. T he quorum at a meeting of the Board shall consist of the chairman (or, in an appropriat e case, the person presiding at the meeting pursuant to paragraph 2 of this Schedule) and fiv e other members. 4 . Where in any special occasion the Board desires to obtain the advice of any person on an y particular matter, it may co-opt that person to be a member for as many meetings as may b e necessary, and that person while so co-opted shall have all the rights and privileges of a member except that he shall not be entitled to vote. Co mmitt ees 5 . (I) Subject to its standing orders, the Board may appoint such number of standing and ad hoc committees as it thinks fit to consider and report on any matter with which the Authorit y or Board is concerned. ( 2) A committee appointed under this paragraph shall be presided over by a member o f the Board and shall be made up of such number of persons (not necessarily members of th e Board) as may be determined by the Board. (3 ) The quorum of any committee set up by the Board shall be as may be determine d by the Board. 6. (I) Where standing orders made pursuant to paragraph I of this Schedule provid e for a committee of the Board to consist of persons who are not members of the Board, the committee may advise the Board on any matter referred to it by the Board. (2) The decision of a committee shall be of no effect until it is confirmed by the Board. Mi s c e l l a n eo u s 7. The fixing of the seal of the Authority shall be authenticated by the signature of th e chairman of the Board or that of the Managing Director. 8. A ny contract or instrument which, if made by a person not being a body corporate, woul d n ot be required to be under seal may be made or executed on behalf of the Authority by th e Managing Director or by any other person generally or specially authorised to act for that pu rp ose by the Board. 9. Any document purporting to be a contract, instrument or other document duly signed or sealed on behalf of the Authority shall be received in evidence and shall, unless the contrary i s proved, be presumed without further proof to have been so signed or sealed. 10. The validity of any proceedings of the Board or of a committee of the Board shall not b e affected- ( a ) by any vacancy in the membership of the Board, or of the committee; or ( b ) b y any defect in the appointment of a member of the Board or any committee th ereof. 11. Any member of the Board or a committee of the Board who has a personal interest in an y contract or arrangement entered into or proposed to be considered by the Board or committ ee s hall forthwith disclose his interest to the Board or the committee and shall not vote on an y question relating to the contract or arrangement. 12 . No member of the Board shall be personally liable for any act or omission done or mad e in good faith while engaged in the business of the Board. SECOND SCHEDULE ["
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "",
      "content": "Section 10.] F e d e ral na v igabl e wat e r ways 1. The River Niger from the NigerianJNiger/Benin border, through the Nun and Forcad os distributaries to the Atlantic Ocean. 2. The River Benue from the Nigerian/Cameroun border to its confluence with River Nige r a t Lokoja. 3. The Cross River from the Nigerian/Cameroun border to the Atlantic Ocean, and all it s distributaries. 4. Rivers Sokoto, Kaduna, Geriny, Gongola, Taraba, Donga, Katsina-Ala, Anambra, Ogun , Oluwa, Osse, Benin, Imo, Kwa Tho. 5 . The Intra-coastal route from Badagry, along the Badagry Creek to Lagos, through Lag os Lagoon to Epe, Lekki Lagoon to Iwopin, along Omu Creek, Talifa River to Atijere, Akata , Aboto, Oluwa River to Okitipupa and onto Gbekebo, Arogbo, Of un am a, Benin Creek t o Warri. Also the canal running from Araromi through Aiyetoro, Imelumo to Benin River a nd f rom Aiyetoro through Mahin Lagoon to Igbokoda. 6. The waterway from Warri along the Forcados River, through Frukana, Siama, Bomadi , Angalabiri, Patani, Torofani, down River Nun to Agberi, Kiama, Sabagreia, Gbaran Cr eek, Agudama, Ekpetional into Ekole Creek to Yanaka, Yenegoa, Sangata to Mbiakpaba, ont o Okokokiri, Of ok pot a, Olagaga, Nembe, Adema, Agoribiri Creek to Egbema, Degema, Som - breiro River to Hanya Town, Ogbakiri to Port Harcourt. 7 . The waterway from Port Harcourt, through Amadi Creek down Bonny River, into Opob o Channel Adoni River, through Andoni Flats. Tellifer Creek, Imo River, Shooter Creek, Kw a Tho Creek, Kwa Ibo River, Stubbs Creeks, Widenham Creek, Effiat-Mbo Creek, Cross R iver estuary to Oron and Calabar. 8. Rivers Benin, Ethiope, Ossiomo, Onne, Aba, Azumini, Olomum, Siluko, Talifa, Forcad os, Penington, Escravos, Warri, Ramos, Dodo, Bonny, Middleton, Fishtown, Sengana, Brass o f Nicholas, Santa Barbara, San Batholomew, Sambriero, New Calabar, Mbo, Rio del R ey, Uruan, Akwayafe. 9. Creeks Odiama, Agamama Tora, Nembe, Krakama, Buguma, Bille, Finima, New Calab ar, Eko le, Cawthpme Channel, Ikane-Bakassi, Omu, Kwato (Gwato], Adagbrassa, Chananomi, Okpoko, Jones Kulama, Ik ebiri, Nikorogba, Sagbama, Egbedi, Kolo, Laylor, Hughes Channel. 10. La kes Mahin, Oguta, Osiam Ehoma. 11. T he Orashi River from Oguta Lake to Ebocha, Omoku, Kreigani, Moiama, Okariki , Egberna, S ombreiro River. 12. Lake Chad, that part within Nigeria. THIRD SCHEDULE [S ection II.] Ri ve r p or t s who se a ppr o a c h es are exe mpt e d f ro m th e co ntrol of the A uth o r i t y I. Lagos. Po rt Harcourt. War ri. Ca labar. B urutu. A kassa. Bo nny. Dege ma. Forca dos. Koko To wn. FOURTH SCHEDULE [S ection 27.] As se t s o f th e D e partm e nt v e s t e d i n t h e A uth o rit y I. Prope rty. Bu ildings. Doc kyards. La nds. Office e quipment. Mac hinery and plants. Boats a nd ferries, including : ( I) B/V Anam. (2) B/V Bajibo. (3 ) B/V Nembe. ( 4) B/V Lekki. ( 5) B/V Numan. (6) M IF Apapa. ( 7) MIF Calabar. (8) MIF Baro. ( 9) MIF Yelwa. ( 1 0) WfB Jebba . (11) Mff Ti ga Dam . (12) MID Yenaka . (13) MID Itobe. (14) M I D Siama . (15) MID Obosi. ( 16 ) MID Sh etland . (17) MIF Orono ( 18) Ml F Lokoja . (19) W/B Maroko . (20) W/B Jamata. (21) MIF Effiat-Mbo . (22) MIF Idah. ( 23) MIF Asaba. (2 4) MIF Ibi. ( 25) MIF Yola . (26) MIF New Bu ssa. (27) MIF Onitsha . (28) MIF Donga. (2 9) MIF Warri. (30) M /T Kainji Dam . ( 31 ) BN Varvil. ( 32 ) BN Cosmos. ( 33) WfB Ya uri. (34) SN Woodcock. ( 35 ) SN Woodpecker . (36) SIL Woodpegeon . (37) MIL Wagtail. (38) M IL Wood lack SUBSIDIARY LEGISLATION No Subsidiary Legis l ation"
    }
  ],
  "definitions": []
}