{
  "id": "national-library-act",
  "type": "statute",
  "title": "NATIONAL LIBRARY ACT",
  "title_en": "NATIONAL LIBRARY ACT",
  "short_name": "NATIONAL LIBRARY ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=318",
  "provisions": [
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "",
      "content": "section 6 of this Act and to contingencies or any other reserve as may in the opinion of the Board, be appropriate; (h) grants for purposes conducive to the welfare of persons employed by the Board; (i) such contributions to such charitable objects as the Board, with the approval of the Minister, may determine; (j) the purchase of books, equipment and other related material; and (k) such other charges as may be reasonably incurred in the exercise of the Board's functions,and the balance, if any, shall be applied to such charitable or public purposes and in such manner as the Minister may direct. (4) The financial year of the Board shall coincide with that of the Federal Government. 6. General reserve (I) Without prejudice to the power of the Board to set aside from revenue appropriate amounts for replacements, contingencies or other purposes, the Board may establish and maintain a general reserve. (2) The management of the general reserve, the sums to be carried from time to time to the credit of the general reserve, the charges to be made against the general reserve and any other application of the monies comprised therein, shall be as the Board may with the approval of the Minister determine: Provided that no part of the monies comprised in the general reserve shall be applied otherwise than for the purposes of the Board. 7. Power to borrow and invest (I) The Board may, with the consent of or in accordance with any general authority given by the President, borrow by way of loan from the Federal Government, or by way of temporary overdraft approved by the Minister, sums required by the Board for meeting its obligations and discharging its functions under this Act. (2) The Board may invest all or any of its funds in such manner as may be approved by the Minister. (3) Subject to"
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "",
      "content": "section 5 of this Act, the Minister may, with the approval of the President, issue to the Board directives as to the disposal of surplus funds. 8. Accounts and audit (I) The Board shall keep proper accounts and other records relating thereto and shall prepare in respect of each financial year a statement of accounts in such form, as the Minister may direct. (2) The accounts of the Board shall be audited by auditors appointed from the list of auditors and in accordance with the guidelines supplied by the Auditor-General for the Federation. (3) As soon as the accounts of the Board have been audited, the Board shall furnish a copy of the statement of accounts to the Minister, together with a copy of any report made by the auditors on their statement or on the accounts of the Board. Annual report, etc. (1) The Board shall prepare and submit to the Minister not later than 30 May in each financial year, a report in such form as the Minister may direct on the activities of the Board during the last preceding financial year, and shall include in the report a copy of the audited accounts of the Board for the last preceding financial year and of the auditors' report on those accounts. (2) The Minister shall cause a copy of each report made to him under this section to be laid before the Federal Government. (3) The Minister may, by notice in writing served on the Director, require the Board to furnish the Minister with all information within its power relating to such matters connected with any activity of the Board as may be specified in the notice; and it shall be the duty of the Board to comply with the requirements of the notice. 10. Legal proceedings, service of documents, etc. (1) No suit against the Board, and no suit against any member, officer or servant of the Board in his capacity as such, shall lie or be instituted in any court unless it is commenced within the twelve months following the act, neglect or default complained of or, in the case of a continuance of damage or injury, within the twelve months following the cessation thereof. (2) No suit shall be commenced against the Board or against any member, officer or servant of the Board in his capacity as such, until one month at least after there has been served on the Board by or on behalf of the intending plaintiff, written notice of intention to commence the suit, stating- (a) the cause of action; (b ) the particulars of the claim; and (c) the name and place of abode of the intending plaintiff and the relief claimed. (3) The notice referred to in subsection (2) of this section and any summons, notice or other document required or authorised to be served on the Board may, except where there is express provision to the contrary, be served- (a ) by delivering it to the chairman or the Director; or (b ) by sending it by registered post, addressed to the Director, at the principal office of the Board. (4) In any suit, the Board, without prejudice to any other right of representation, may be represented at any stage of the proceedings by any member, officer or servant of the Board who is duly authorised in writing by the Board in that behalf. (5) In any suit against the Board, no execution or attachment or process in the nature thereof shall be issued against the Board, but any sums of money which may by the judgment of the court be awarded against the Board shall (subject to any directions given by the court where notice of appeal has been given by the Board in respect of the judgment), be paid by the Board from the funds of the Board. (6) In this section, \"suit\" means any civil proceedings however commenced. 11. Compulsory acquisition of land (I) Whenever there is any hindrance to the acquisition by the Board of any land required for any purpose of the Board under this Act (including any failure by the Board to reach agreement as to the amount to be paid in respect of the acquisition), the Minister, on the application of the Board and after such enquiry as he may think fit, may declare that the land is required for the service of the Board. (2) Where a declaration is made under subsection (I) of this section, the land to which the declaration relates shall be deemed to be land required for a public purpose of the Federation, within the meaning of the Land Use Act, and the President- [Cap. LS.] ( a) may cause action to be taken under that Act for acquiring the land for the Federal Government; or ( b) if the land is customary land, may issue a requisition under"
    },
    {
      "provision_ref": "s28",
      "section": "28",
      "title": "",
      "content": "section 28 (3) of the Land Use Act for the revocation of any rights relating to the land. (3) Where a declaration has been made under subsection (I) of this section in respect of any land other than customary land and- ( a) the land has been acquired pursuant to subsection (2) (a) of this section; or ( b) the President is satisfied that there are no rights subsisting in respect of the land,the President may vest the land in the Board by means of a certificate under the hand and seal of the Registrar of Deeds. (4) Where a declaration has been made under subsection (I) of this section in respect of any customary land and- ( a) the rights relating thereto have been revoked pursuant to subsection (2) (b ) of this section; or ( b) the Governor of the State in which the land is situated is satisfied that there are no rights subsisting in respect of the land,the Governor in question may grant to the Board a right of occupancy of the land on such terms and conditions as he thinks fit. (5) The compensation, if any, payable under the Land Use Act for the acquisition of any land under this section or payable under the Land Use Act for the revocation of any rights relating to the land, as the case may be, shall in the first instance be paid by the Federal Government, but the Board shall refund to that Government any compensation so paid and all incidental expenses incurred by that Government. [Cap. LS.] (6) A plan of any land referred to in subsection (I) of this section- (a) containing measurements of the boundaries of the land; (b) showing the relationship of the land to any sufficient identifying mark; and ( c ) signed by the Director,shall be a sufficient description of the land for the purposes of an application under that subsection. (7) The Board shall not, without the approval in writing of- (a) the President; or (b) in the case of customary land, the Governor of the State in which the land is situated,alienate, mortgage, charge or demise any immovable property which has been vested in the Board under this section or in respect of which a right of occupancy has been so granted to the Board. (8) In this section \"customary land\" has the same meaning as in the Land Use Act. 12. Repeal, etc., of 1964 No.6 (1) The National Library Act 1964 is hereby repealed, and the National Library Board established by that Act, is hereby dissolved. (2) The transitional and saving provisions in the Second Schedule to this Act, shall have effect notwithstanding any other provision of this Act. [Second Schedule.] 13. Interpretation In this Act, unless the context otherwise requires- \"Board\" means the National Library Board, established by this Act; \"chairman\" means the chairman of the Board; \"Director\" means the Director of the National Library; \"Minister\" means the Minister charged with responsibility for information; \"National Library\" means the National Library of Nigeria, established and main- tained by the Board; \"State\" means a State of the Federation. 14. Short title This Act may be cited as the National Library Act. SCHEDULES FIRST SCHEDULE [Section I (3).] Suppl e m en tar y pr ov isi o n s r e latin g t o th e B o ard M e mb e r s hip [1987 No. 26.] 1. (I) Subject to this Schedule, the Board shall consist of twelve members, one of whom shall be the Director and the others shall be appointed by the Minister with the prior approval of the President and shall comprise- (a) one member to represent each zone of States and the Federal Capital Territory, Abuja as listed in sub-paragraph (2) of this paragraph, rotating every two years within the zones in alphabetical order, who shall be appointed after consultation with the Governors of the States in question and shall be a person appear- ing to the Minister to have wide experience in at least one of the following fields, that is to say- (i) newspapers, broadcasting and other media of communication; (ii) university education and research; (iii) education other than university; (iv) law; (v) the activities of legislatures; (vi) business and industry; (vii) trade unions; (viii) finance relating to the provision of public services; (ix) science and technology; (x) the creative arts; and (xi) the book industry; ( b ) one person appearing to the Minister to represent the interest of the Nigeria Library Association or any other body or association of librarians established in Nigeria and approved by the Minister; (c) three persons (additional to those appointed under sub-paragraph (a) of this paragraph), appearing to the Minister to have wide experience in at least one of the fields mentioned in that paragraph, one of whom shall be a person appearing to the Minister to have wide experience in the handling of financial matters; (d) the Permanent Secretary, Federal Ministry of Education or his representative; ( e) one representative of the Armed Forces Education Corps; and (f) one representative of the Nigerian Association of University Librarians. (2) The States in each zone referred to in sub-paragraph (I) of this paragraph are as Folows- Zone States A Adamawa, Benue, Kaduna, Katsina, Nasarawa, Plateau, Taraba. B Bauchi, Borno, Gombe, Jigawa, Kana, Kebbi, Sakata, Yobe and Zamfara. zones states C Ekiti, Federal Capital Territory, Abuja, Kogi, Kwara, Niger, Ondo. D Delta, Edo, Lagos, Ogun, Osun, Oyo. E Abia, Akwa-Ibom, Anambra, Bayelsa, Cross River, Ebonyi, Enugu, Imo, Rivers. 2. The Minister shall, with the prior approval of the President, nominate one of the members of the Board appointed by him to be the chairman of the Board. Terms of service 3. (I) Subject to the provisions of this Act, a person appointed to be a member of the Board, not being a public officer, shall hold office for a period of three years from the date of his appointment and shall be eligible for reappointment for one further period of three years. (2) Any member, not being a public officer, may resign his appointment by a letter addressed to the Minister. 4. (1) If it appears to the Minister that a member of the Board should be removed from office on the ground of misconduct or inability to perform the functions of his office, the Minister shall, after consultation with the interests, if any, represented by that member, make a recommendation to that effect to the President and if the President approves the recommendation the Minister shall declare, in writing, the office of that member vacant. (2) Subject to sub-paragraph (1) of this paragraph- (a) any member who is absent from two consecutive ordinary meetings of the Board, shall file his explanation in writing with the secretary for consideration by the Board and if the explanation is not accepted by the Board, the Board may recommend to the Minister that the member be removed, and the Minister may declare, in writing, the office of that member vacant; (b) where the Board is satisfied that the continued presence on the Board of any member is not in the national interest or the interest of the Board, the Board may recommend to the Minister that the member be removed, and the Minister may declare, in writing, the office of that member vacant. 5. There shall be paid to members of the Board out of monies at the disposal of the Board such remuneration and such travelling and subsistence allowances in respect of any periods of time spent on the business of the Board as the President may determine. 6. References in paragraph"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "",
      "content": "s 3, 4 and 5 to this Schedule to members of the Board do not include references to the Director. [1979 No.6.] Proceedings 7. Subject to this Act and"
    },
    {
      "provision_ref": "s27",
      "section": "27",
      "title": "",
      "content": "section 27 of the Interpretation Act (which provides for decisions of a statutory body to be taken by a majority of its members and for the chairman to have a second or casting vote), the Board may make standing orders regulating the proceedings of the Board or any committee thereof. 8. The quorum of the Board shall be seven, and the quorum of any committee of the Board shall be determined by the Board. 9. The Board shall elect a member of the Board to be the deputy chairman of the Board for such period as the Board may determine, so however that a deputy chairman who ceases to be a member shall cease to be deputy chairman. 10. At any time while the office of the chairman is vacant or the chairman is in the opinion of the Board, permanently or temporarily unable to perform the functions of his office, the deputy chairman shall perform those functions, and the references in this Act to the chairman shall be construed accordingly. 11.The Board shall meet at least twice in each calendar year. 12. Subject to paragraph 14 of this Schedule and standing orders of the Board, the Board shall meet whenever it is summoned by the chairman; and if the chairman is required to do so by notice given to him by not less than seven other members, he shall summon a meeting of the Board to be held within fifteen days from the date on which the notice is so given. 13. At any meeting of the Board the chairman, or in his absence the deputy chairman, shall preside, but if both are absent, the members present at the meeting shall elect one of their number to preside at that meeting. 14. Where the Board desires to obtain the advice of any person on a particular matter, the Board may co-opt him as a member for such period as it thinks fit; but a person who is a member by virtue of this paragraph, shall not be entitled to vote at any meeting of the Board and shall not count towards a quorum. Co mmitt ees 15. The Board shall appoint an Executive Committee to which the Board shall delegate its executive functions and which shall meet as often as may be determined by the Board or by the chairman acting on behalf of the Board. 16. The Executive Committee shall consist of the chairman of the Board (who shall be chairman of the Executive Committee) and six other members of the Board, at least two of whom shall be members of the Board, nominated for membership of the Executive Committee by the Minister. 17. The Executive Committee shall have the power to implement its decisions without prior approval by the Board, but the proceedings of the Executive Committee shall be reported to the Board as soon as possible. 18. The Board shall be responsible for all acts of the Executive Committee done in the lawful exercise of its delegated powers, and accordingly, the Board shall have the power to review and, if it thinks fit, to rescind any decision taken by the Executive Committee. 19. Subject to its standing orders, the Board may appoint such other committees as it thinks fit, but the decision of a committee appointed under this paragraph shall be of no effect until it is confirmed by the Board. Th e Dir ec t o r , o ffi ce r s and se rv a nt s 20. The Board- (a) shall appoint a secretary to the Board, who shall be an officer but not a member of the Board and shall perform such duties as the Board or the Director may determine; and ( b ) may appoint such other officers and servants as it thinks fit. 21. Without prejudice to the generality of the powers conferred by"
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "",
      "content": "section 2 (3) of this Act, the Board shall have power- (a) to pay to the Director and to any officer or servant of the Board, such remuneration and allowances as the Board may determine; ( b ) to pay to or in respect of the Director, and (subject to any regulations made under sub-paragraph (c) of this paragraph), to or in respect of any officer or servant of the Board, in whose case it may decide to do so, such pensions and gratuities as the Board may determine; (c ) with the approval of the Minister, to make staff regulations (which need not be published in the Federal Ga zet t e ) , regulating the conditions of service of servants of the Board and in particular, without prejudice to the generality of the foregoing, providing for- (i) the appointment, dismissal, discipline, pay and leave of, and the security to be given by, its servants; (ii) appeals by its servants against dismissal or other disciplinary measures; (iii) the grant of pensions, gratuities and other retiring allowances to its servants and their dependants, and the grant of gratuities to the estates or dependants of deceased servants of the Board; and (iv) the establishment and maintenance of medical benefit funds, superannuation funds and provident funds, and the contributions payable thereto and the benefits receivable therefrom. 22. In connection with any scheme for the payment of pensions or gratuities under paragraph 25 ( b ) of this Schedule or under any regulations made under paragraph 25 (c) of this Schedule, the Minister may, by order in the Federal G a ze t te, declare service as the Director or as an officer or servant of the Board (including service regarded as service under the Board by virtue of an order made under paragraph 5 of the Second Schedule to this Act) to be public service for the purposes of the Pensions Act. [Cap. P4.] Mi scel lan eo u s 24. The fixing of the seal of the Board shall be authenticated by the signature of the chairman or of some other member of the Board authorised generally or specially by the Board to act for that purpose. 25. Any contract or instrument which, if made or executed by a person not being a body cor- porate, would not be required to be under seal, may be made or executed on behalf of the Board by any person generally or specially authorised to act for that purpose by the Board. 26. Any document purporting to be a document duly executed under the seal of the Board shall be received in evidence and shall, unless the contrary is proved, be presumed to be so executed. 27. The validity of any proceedings of the Board or a committee thereof shall not be affected- (a) by any vacancy in the membership of the Board or committee; or (b) by any defect in the appointment of a member of the Board; or (c) by reason that a person not entitled to do so took part in the proceedings. 28. Any member of the Board who has a personal interest in any contract or arrangement entered into or proposed to be considered by the Board or a committee thereof shall forthwith disclose his interest to the Board and shall not vote on any question relating to the contract or arrangement. SECOND SCHEDULE ["
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "",
      "content": "Section 12 (2).] T ra nsiti o nal and s av i n g pr o visi o ns 1. By virtue of this Act, there shall be vested in the Board (hereinafter referred to as \"the new Board\") on the commencement of this Act, without any further assurance, all assets, funds, resources and other movable or immovable property which immediately before the commencement of this Act were vested in the National Library Board dissolved by this Act (hereinafter referred to as \"the former Board\"). 2. As from the commencement of this Act- (a) the rights, interests, obligations and liabilities of the former Board exrstmg immediately before the commencement of this Act under any contract or instrument, or at law or in equity apart from any contract or instrument, shall by virtue of this Act be assigned to and vested in the new Board; ( b ) any such contract or instrument as is mentioned in sub-paragraph (a) of this paragraph shall be of the same force and effect against or in favour of the new Board and shall be enforceable as fully and effectively as if, instead of the former Board, the new Board had been named therein or had been a party thereto; and (c) the new Board shall be subject to all the obligations and liabilities to which the former Board was subject immediately before the commencement of this Act, and all other persons shall as from the commencement of this Act have the same rights, powers and remedies against the new Board as they had against the former Board immediately before the commencement of this Act. 3. Any proceeding or cause of action pending or existing immediately before the commencement of this Act by or against the former Board in respect of any right, interest, obligation or liability of the former Board, may be commenced, continued or enforced, subject to"
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "",
      "content": "section 10 (5) of this Act, by or against the new Board as it might have been against the former Board if this Act had not been made. 4. In this Act \"financial year\", in relation to the new Board, includes the financial year in which this Act comes into force. S. Within the twelve months next following the commencement of this Act, the Minister, if he thinks fit, may by order in the Federal Ga ze t t e make additional transitional or saving provisions not inconsistent with this Schedule; and, without prejudice to the generality of the foregoing, any such order may provide for service under the former Board to be regarded as service under the new Board for pensions purposes. 6. As part of its functions under section 2 (2) i f ) of this Act, the Board shall on the commencement of this Act, in accordance with arrangements to be made between the Director and the librarian of the Ibadan University Library, assume responsibility for continuing the National Bibliography heretofore known as Nigerian Publications which, before the commencement of this Act, was compiled in the lbadan University Library and published by the Ibadan University Press. SUBSIDIARY LEGISLATION N o Sub s idi a r y L eg i s l a ti on"
    }
  ],
  "definitions": []
}