{
  "id": "national-institute-for-nigerian-languages-act",
  "type": "statute",
  "title": "NATIONAL INSTITUTE FOR NIGERIAN LANGUAGES ACT",
  "title_en": "NATIONAL INSTITUTE FOR NIGERIAN LANGUAGES ACT",
  "short_name": "NATIONAL INSTITUTE FOR NIGERIAN",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=312",
  "provisions": [
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Functions of the Institute",
      "content": "Functions of the Institute T he functions of the Institute shall be to- ( a ) encourage the learning of Nigerian languages in an environment which shall prepare the students in the Institute to- (i ) speak Nigerian languages fluently; ( ii) acquire proficiency in the teaching of Nigerian languages; ( iii) acquire competence in research on problems of teaching Nigerian lan g uages at all levels of education in Nigeria; ( iv) adapt the theories and practice of using Nigerian languages into classroom practices especially for secondary schools, colleges and the teaching and learning for non-native speakers of the Nigerian languages; and ( v) stimulate general concepts, practices and interests in communicati ng in Nigerian languages; ( b ) hold out to all persons without distinction, race, creed, sex or political convic t ion, the opportunity of acquiring proficiency in the learning and pragmatic u se of the Nigerian languages as a means of communication among different la ng uage groups in Nigeria; (c) pr ovide courses of instruction and other facilities for the pursuit of learnin g Nigerian languages; ( d) develop appropriate curricula to suit the needs of the various users of the I n stitute; ( e ) award testimonials, certificates, diplomas and degrees to persons who complete the courses of study at the Institute; (f) o perate for the benefit of- ( i) primary and secondary school teachers of Nigerian language s; ( ii) tertiary educational institution teachers of Nigerian languages; ( iii) government and non-governmental personnel interested in acquirin g co mmunication skills in Nigerian languages; ( iv) diplomats, foreigners, business associates, etc., willing to learn Nigerian languages; and such other persons interested in research int o Nigerian languages; (g) se rve as a centre for the exchange of information in the study of Nigerian la ng uages and research centre in teaching and learning of Nigerian languages; ( h ) encourage research into problems of learning and teaching of Nigerian la nguages, with a view to carrying out research into those problems and findin g solutions to them; ( i) compile, assemble and publish the results of researches into Nigerian langu age studies and make popular those findings where their general recognition, in th e opinion of the Institute, is of importance to Nigerian languages; and (j) ca rry out other activities which are necessary for the performance of its fun c tions under this Act. Fu n ctions of the Council The Council shall- (a) s ubject to the provisions of this Act and relating to the directives of the President, be the governing body of the Institute and shall be charged with the ge n eral control and superintendence of the policy, finances and property of the In stitute; (b) e nsure that the Institute is staffed by persons with high communicati ve com petence in Nigerian languages; ( c ) ensure that proper accounts of the Institute are kept and that those account s are a udited annually as specified in this Act; (d) orga nise and control courses of studies of the Institute and the examination s held in conjunction with those courses; (e) o rganise and control the halls of residence and the other facilities provided b y t he Institute; (f) p erform such other duties as the President may, from time to time, assign to it. 9. Pow ers of the Institute For ca rrying out its objectives and functions under this Act, the Institute shall h ave power - (a) t o establish such units within the Institute as may, from time to time, b e deemed necessary or desirable; (b) to institute professorships, readerships, lectureships and other posts and offices a nd make appointments thereto; (c) to institute and award fellowships, scholarships, bursaries, medals, prizes a nd other titles, distinctions, awards and other forms of assistance; (d) to provide for the residence, discipline and welfare of staff of the Institute; (e) t o hold examinations and grant diplomas, degrees, certificates and other di s tinctions to persons approved by the Institute and have satisfied such other req uirements as the Institute may require; (f) to g rant fellowships or titles to deserving individuals; (g) t o determine and demand from any student or any other person attending th e Institute for the purpose of instruction, such fees as the Institute may, fro m tim e to time, determine; (h) to acquire, hold, grant, charge or otherwise deal with or dispose of movabl e a nd immovable property wherever situated; (i) not to accept gifts, legacies and donations for a particular purpose unl ess it a pproves the terms and conditions attached to it; (j) to e nter into contracts, establish trusts, act as trustees solely or jointly with an y o ther persons and employ and act through agents; ( k ) to erect, provide, equip and maintain libraries, lecture halls or residence, sport g rounds, dining halls and other buildings suitable for the obj ectives of the In stitute; ( I) to undertake publishing and book sales and liaise constantly with the Ni gerian E ducational Research and Development Council in respect of book publishing; (m) s ubject to any limitation or condition imposed by this Act- (i ) to invest any money accruing to the Institute by way of endowment , whether for general or special purposes, and such other money as m ay not be immediately required for current expenditure in investments, se c urities or in the purchase or improvement of land, with p ower from t ime to time to vary any such investments; and (i i) to deposit money, for the time being not invested, with a bank ap - pr oved by the Federal Government, on deposit or current account; ( n ) to make gifts for any charitable purpose; and (0) to do all such other things which are incidental to the foregoing. 10 . Powers of the Council Subj ect to the provisions of this Act, the Council shall-- (a) exerc ise on behalf of the Institute, the powers conferred on it under this Act ; a nd (b) d o such other things as are necessary for the successful performance of it s functions and those of the Institute. 11 . Power of the President to give directives T he President may give to the Institute or the Council, directives of a general natur e or relating generally to matters of policy with regard to the performance by the Institut e or the Council and it shall be the duty of the Institute or the Council to comply with th ose directives. PART ill S t aff o f th e In st it u t e 12. Appointment of principal officers of the Institute (1) Th e principal officers of the Institute shall consist of-- (a) th e Executive Director; ( b ) the Deputy Director; ( c ) the Registrar; (d) th e Bursar; (e) th e Director of Works; (f) the Librarian; and (g)"
    },
    {
      "provision_ref": "s29",
      "section": "29",
      "title": "Composition and functions of the Appointments and Promotion Committ",
      "content": "29. Composition and functions of the Appointments and Promotion Committ ee (1) The Appointments and Promotion Committee shall consist of- ( a ) the Executive Director of the Institute as chairman; ( b ) the Deputy Director; (c) th ree members of the Council to be selected by the Council; ( d ) the Dean of Schools; (e) th e Librarian; and (f) the Registrar who shall act as the secretary to the Committee. (2) Subject to such policies as may be laid down, from time to time, by the Council , the Ap pointments and Promotion Committee shall- (a) co-ordinate and regulate the appointment and promotion of members of staff o f the In stitute; (b) con sider applications for special training, sabbatical leave, leave of absen ce and for fellowships; and (c) pe rform such other functions ancillary to those in paragraphs (a ) and (b) of thi s subsection as the Council may, from time to time, assign to it. (3) The Appointments and Promotion Committee shall regulate its own procedure. 30. Appointment of other committees (I) T he Council may subject to its standing orders, appoint such other standing a nd ad hoc committees as the Council may think fit to consider and report on any matte r with which the Institute is concerned. (2) Subject to the provisions of subsection (I) of this section, a committee appointe d by virtue of that subsection shall be presided over by a member of the Council, and sha ll consist of such number of persons, not necessarily members of the Council, as the Coun cil may determine. PART VI Financial provisions 31. F und of the Institute (I) Th e Institute shall establish and maintain a fund from which shall be defrayed a ll expenditure incurred by the Institute. (2) T here shall be paid and credited to the fund established pursuant to subsection (I) of this sec tion-- (a) such monies a s may, from time to time, be lent or granted to the Institute b y the Government of the Federation or of a State or any of their agencies; (b) all m onies raised for the purposes of the Institute by way of gifts, grants-in-aid, testamentary disposition or otherwise; (c) all subscriptions or fees and charges for services rendered by the Institute; (d) all interest s received in respect of monies invested by the Institute; and (e) all other asset s, from time to time, accruing to the Institute. (3) T he fund shall be managed in accordance with guidelines given by the Ministe r through the National Universities Commission, and without prejudice to the generalit y of the powe r to give guidelines under this subsection, the guidelines shall in particular con tain such provisions specifying the manner in which the assets of the Institute are to b e held, a nd regulating the making of payments into and out of the fund. 32. Expenditure of the Institute (I) T he Institute may, from time to time, appl y the funds at its disposal- (a) to the cost of the administration of the Institute and of any research centre un der the Institute's administration; (b ) for reimbursing a member of any committee set up by the Institute for e x penses expressly authorised by the Institute; (c) for the pr ovision of scholarships and other awards for the training of staff of the Institute; ( d) for the payment of salaries, fees or other remuneration, allowances pensions and gratui ties or superannuation payable to the employees of the Institute; (e ) for the maintenance of any property vested in the Institute; and (f) for and in connection with any of the functions of the Institute under this Act. (2) Except a s provided in subsection (1) of this section, no other remuneration shall be paid to any memb er of any committee appointed by the Institute pursuant to this Act."
    },
    {
      "provision_ref": "s33",
      "section": "33",
      "title": "Annual estimates, accounts and audit",
      "content": "33. Annual estimates, accounts and audit (l) The Council shall cause to be prepared , not later than 30 September in each year , an estimate of the expenditure and income of the Institute during the next succeedi ng year, and when prepared, they shall be submitted to the President. (2) The Council shall cause to kept proper accounts of the Institute and proper r ec ords in relation thereto and when certified by the Council the accounts shall be audited as provided in subsection (3) of this section. (3) The account s of the Institute shall be audited within six months after the end of e ach year by auditors appointed by the Council from the list and in accordance with th e guidelines supplied by the Auditor-General for the Federation; and the fees of the audi tors and the expenses of the auditors generally shall be paid from the funds of the In st i tute."
    },
    {
      "provision_ref": "s34",
      "section": "34",
      "title": "Annual report",
      "content": "34. Annual report The Council shall, not later than 31 July in each year, submit to the President a rep ort, in such form as the President may, from time to time, direct on the activities of the Insti tute during th e preceding year and shall include in the report the audited accounts o f the Institute. PART VII Miscellaneous"
    },
    {
      "provision_ref": "s35",
      "section": "35",
      "title": "Office and premises",
      "content": "35. Office and premises (1) For th e purpose of providing offices and premises necessary for the performan ce of its functions, the Institute may- (a) purchase or take on lease any interest in land, building or property; (b) build, equip and maintain offices and premise. (2) The Institute may, subject to the Land Use Act, sell or lease out any land, offi ce or pre mises held by it, which is no longer required for the performance of its function s under this Act. [Cap. LS.] 36. Power to borrow (I) The Institute may, from time to time, borrow by overdraft or otherwise such su ms as it may re quire for the performance of its functions under this Act. (2) T he Institute shall not, without the approval of the President, borrow mon ey wh ich exceeds, at any time, the limit set by the President. (3) Notwithstanding subsection (I) of this section, where the sum to be borrowed is in foreig n currency, the Institute shall not borrow the sum without the prior approval of the Pres ident. 37. Power to accept gifts (I) T he Institute may accept gifts of land, money or other property, on such terms and co nditions, if any, as may be specified by the person or organisation making the gift. (2) T he Institute shall not accept a gift if the conditions attached by the person or organisa tion making the gift are inconsistent with the objectives and functions of the Institute. 38. Regulations The Council may, with the approval of the President, make regulations for giving effect to the provisions of the Act and without prejudice to the foregoing regulations sha ll provide for- (a) th e entry into and the type of courses and programmes approved by the Insti tut e; (b) th e duration of the courses and programmes; and (c) th e certificates, if any, to be awarded by the Institute. 39. Interpretation In t his Act, unless the context otherwise requires---- \"c hairman\" means the chairman of the Council of the Institute; \"Co uncil\" means the Council of the Institute; \" Institute\" means the National Institute for Nigerian Languages established by section I of this Act; \" member\" means a member of the Council and includes the chairman; \"M inister\" means the Minister charged with responsibility for education; \" principal officers\" means the principal officers of the Institute appointed und er Part III of this Act. 40. Short title This Act may be cited as the National Institute for Nigerian Languages Act. SCHEDULE Supplementary provisions relating to the Council, etc. [Section 3 (5).] 1. Subject to the pr ovisions of this Act and section 27 of the Interpretation Act, the Co uncil shall have power to regulate its proceedings and may make standing orders with respect t o the holding of its meetings and those of any of its committees, the notice to be given, the pro ceedings thereat, the keeping of minutes of those proceedings and the custody and produ ction for inspection of the minutes. [Cap . 123.] 2. The quorum of t he Council shall be five and the quorum of a committee of the Cou ncil shall be determined by the Council. 3. (1) Subject to the provisions of any applicable standing orders, the Council sha ll meet whenever it is summoned by the chairman and if the chairman is required so to do by notic e given to him by not less than six other members he shall summon a meeting of the Coun cil to be held within twenty-one days from the date on which the notice is given. (2) At any me eting of the Council the chairman shall preside but if he is absent the members present at the meeting shall appoint one of their number to preside at that meeting. (3) Where the Council wishes to obtain the advice of any person on a particular m atter, the Council may co-opt him as a member for such period as it thinks fit, but a person wh o is a member by virtue of this sub-paragraph shall not be entitled to vote at any meeting of the Council and shall not count towards a quorum. Committees 4. The Council may appoint one or more committees to carry out on behalf of the Council such of its functions as the Council may determine. 5. A committee appointed under this Schedule shall consist of such number of person s (not necessarily members of the Council) as may be determined by the Council; and a perso n other than a member of the Council shall hold office on the committee in accordance with the t erms o f his appointment. 6. A decision of a committee of the Council shall be of no effect until it is confirmed by the Council. Miscellaneous 7. The fixing of the seal of the Institute shall be authenticated by the signature of the chair- man or of some other person authorised generally to act for that purpose. 8 . The validity of a proceeding of the Councilor any of its committees shall not be af fected by- (a) a vacancy in the membership of the Councilor of the committee; or (b) reason that a person not entitled to do so took part in the p r oceedings; or (c) a defect in the appointment of a member. 9. A member of the Council and a person holding office on a committee of the Council, who has a personal interest in any contract or arrangement entered into or pr oposed to be consid ered by the Council or the committee- (a) shall forthwith disclose his interest to the Councilor committee, as the case may be; and (b) shall not vote on any question relating to the contract or a rrangement. SUBSIDIARY LEGISLATION No Subsidiary Legislation"
    }
  ],
  "definitions": []
}