{
  "id": "national-teachers-institute-act",
  "type": "statute",
  "title": "NATIONAL TEACHERS' INSTITUTE ACT",
  "title_en": "NATIONAL TEACHERS' INSTITUTE ACT",
  "short_name": "NATIONAL TEACHERS' INSTITUTE ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=340",
  "provisions": [
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Duties of the Council in relation to the Institute",
      "content": "Duties of the Council in relation to the Institute (I) Subject to the provisions of this Act, the Council shall be the governing body of the Institute and shall have the general management of the affairs of the Institute, and in particular, the general control of the Institute and power to do anything which in its opinion is calculated to facilitate the carrying out of the objects of the Institute and to promote its best interests. (2) Without prejudice to the generality of the provisions of subsection (I) of this section, the Council shall have and exercise the following powers to- (a) establish and maintain such schools, extra-mural departments and other teaching units within the Institute as the Council may, from time to time, decide; (b) provide such courses of instruction either alone or in association with such universities and other institutions, whether in Nigeria or not, as the Council may determine, and conduct examinations and award such diplomas and certificates to those reaching a certain standard as a result of those examinations as may seem appropriate to the Council; (c) institute and award fellowships, medals, prizes and other titles; (d) mount exhibitions and displays designed to foster an appreciation of trends in, and the scope and requirements of education; (e) erect, provide, equip and maintain such educational, recreational and residential facilities as the Institute may require; (f) create lectureships and other academic posts and offices and to make appointments thereto; and (g) encourage and make provision for research in the Institute."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Power to accept gifts",
      "content": "Power to accept gifts (I) The Council may accept gifts of land, money or other property upon such trusts and conditions, if any, as may be specified by the person making the gift. (2) The Council shall not accept any gift if the conditions attached by the person making the gift are inconsistent with the functions of the Council under this Act. Offices and premises (I) For the purpose of providing offices and premises necessary for the performance of its functions, the Council may- (a) purchase or take on lease any land; and ( b ) build, equip and maintain offices and premises. (2) The Council may, with the approval of the Minister, sell or lease any land, offices or premises held by it and no longer required for the performance of its functions. 10. Financial provisions (I) The Council shall submit to the Minister not later than three months before the end of the financial year an estimate of its revenue and expenditure for the next succeeding financial year. (2) The Council shall establish and maintain a fund from which there shall be defrayed all expenditure incurred by the Council. (3) There shall be paid and credited to the fund established under subsection (2) of this section- ( a ) such sums as may, from time to time, be granted to the Council by the Federal Government; (b) all moneys raised for the purposes of the Council by way of gifts, grants-in- aid, testamentary dispositions and sales of publications; and (c) all subscriptions, fees and charges for services rendered by the Council and all other sums that may accrue to the Council from any source. 11. Accounts and audit The Council shall keep proper accounts of its receipts, payments, assets and liabilities and shall in respect of each year cause the accounts to be audited by auditors approved, as respects that year, by the Minister of Finance appointed from the list of auditors and in accordance with the guidelines supplied by the Auditor-General for the Federation. 12. Annual report (I) The Council shall prepare and submit to the Minister not later than 30 June in each year a report in such form as the Minister may direct on the activities of the Council during the immediately preceding year, and shall include in the report a copy of the audited accounts of the Council for that year and of the auditor's report on the accounts. (2) The Minister shall cause a copy of the report made to him under this section to be laid before the President so soon after the receipt thereof as may be convenient. 13. Establishment of certain bodies within the Institute (I) There shall be established as an integral part of the Institute, the following bodies, that is- (a) the School of General Studies; ( b ) the School of Educational Innovation; (c) the School of Advanced Studies; ( d ) the Facilities Department; ( e) the Field Centres. (2) The School of General Studies shall be charged with the duty of- (a) providing courses of instruction leading to the development, upgrading and certification of teachers as specified in the relevant syllabus and using distance education and techniques; (b) providing special courses, whether or not directed towards the Institute's certificates, for all students at institutions controlled by the Institute and taking into account the educational requirements of Nigeria; ( c) arranging educational conferences, seminars and workshops and other activities of a similar nature as are relevant to its duties under this Act; and (d) performing such other functions as the Council may, from time to time, direct. (3) The School of Educational Innovation shall be charged with the duty of--- (a) conducting research in the field of education and co-ordinating the research activities of the Institute; (b) continuously evaluating apparatus, materials and methods and modes of instruction at institutions controlled by, or in association with the Institute; and (c) studying and adapting new methods and techniques of instruction to meet the requirements of education in Nigeria. (4) The School of Advanced Studies shall be charged with the duty of- (a) conducting courses of instruction leading to the award of diplomas, certificates and other qualifications as the Council may, from time to time, direct; (b) conducting other courses, whether leading to the Institute's recognised certificates or not, as the educational requirements in Nigeria may demand; (c) arranging conferences, seminars and study groups as are relevant to its duties under this Act; and (d) performing other duties as the Council may, from time to time, direct. (5)The Facilities Department shall be charged with the responsibility for- (a) the procurement, development and distribution of all educational materials to institutions controlled or associated with the Institute; (b) maintaining a register each in respect of teachers and students of the Institute; (c) making available to all institutions controlled by or associated with the Institute data collected or processed by the Department; (d) making available data processing and production facilities as the institutions controlled by or associated with the Institute may require. (6) The Field Centres shall be charged with responsibility for- (a) providing practical teaching services for students registered at any of the institutions controlled by or associated with the Institute; (b) providing educational facilities for students registered at any of the institutions controlled or associated with the Institute; (c) distributing equipment for practical teaching to students registered at any of the institutions controlled or associated with the Institute; and (d) providing liaison services between the Institute, local government administrative organs and other bodies. 14 . Discipline of students (1) The Council may make rules providing for a proper person to conduct enquiries into alleged breaches of discipline (including lack of diligence) by students; and such rules may make different provisions for different circumstances. (2) The rules shall provide for the procedure to be followed and the evidence to be observed at enquiries under this section. (3) The Council may, if it finds the allegations proved, impose on the student con- cerned one or more of the following penalties, that is- (a) expulsion from all or any of the institutions controlled by the Council; (b) suspension for a specified period of his entitlement to use any of the facilities controlled by the Council; (c) a fine in an amount not exceeding NlOO, and shall send a report of the enquiry to the Minister. (4) Any student to whom any of the penalties provided for in subsection (3) of this section is imposed may, at any time within 28 days from the date of imposition of such penalty, appeal to the Minister. (5) The decision of the Council shall have effect from the date of making of the decision unless reversed by the Minister on an appeal."
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Power of Minister to",
      "content": "15. Power of Minister to give directions to the Council Subject to the provisions of this Act, the Minister may give to the Council directions of a general character or relating generally to matters of policy with regard to the exercise by the Council of its functions under this Act and it shall be the duty of the Council to comply with such directions."
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Regulations",
      "content": "16. Regulations (1) The Minister may make regulations generally for the purposes of this Act. (2) Without prejudice to the general power conferred by subsection (1) of this section, the regulations may- (a) prescribe the procedure to be followed in respect of disciplinary actions against any member of the staff; (b) prescribe any other thing falling to be prescribed. 17. Interpretation \"chairman\" means the chairman of the Council; \"Council\" means the National Teachers' Institute Council established by section 1 (2) of this Act; \"Director\" means the Director of the Institute appointed under section 4 of this Act; \"function\" includes powers and duties; \"Institute\" means the National Teachers' Institute established by section I (I) of this Act; \"Minister\" means the Minister responsible for matters relating to education. 18. Short title This Act may be cited as the National Teachers' Institute Act. SCHEDULE [Section 2 (4).] S u ppl emen t a r y pr ov i s i o n s r e l a tin g t o t h e Cou n c il , e t c. T e r ms of serv i ce 1. (I) A member of the Council shall hold office for a term of three years and, subject to the provisions of sub-paragraph (2) of this paragraph, shall be eligible once again for reappointment. (2) The office of a member shall become vacant if- (a) he resigns his office by notice in writing under his hand, addressed to the Minister; or ( b ) the Minister is satisfied that it is not in the interest of the Council for the person appointed to continue in office and notifies the member in writing to that effect. 2. There may be paid to the members of the Council or any committee, not being members who are public officers, such remuneration and allowances (if any) as may, from time to time, be determined by the President. 3. Where a vacancy occurs in respect of the membership specified in section 2 (I) (g) of this Act, it shall be filled by the appointment of a successor to hold office for the remainder of the term of office of his predecessor in office, so however that the successor shall represent the same interest as his predecessor and shall be appointed by the President on the recommendation of the Minister. 4. The Council may act notwithstanding any vacancy in its membership or any defect in the appointment of a member or the absence of a member. Committees 5. (I) The Council may appoint one or more committees to advise it on the exercise and performance of its functions under this Act. (2) The Council shall in particular appoint the following committees that is- (a) a Finance and General Purposes Committee; (b) a Tenders Board; (c) an Appointments and Promotions Committee; (d) a Planning and Development Committee; (e) a Professional and Academic Committee. (3) Each committee or Board shall consist of a chairman appointed by the Council from among its own members and such other members, whether or not members of the Council, as the Council may determine. (4) A person not being a member of the Council appointed to serve on any committee under sub-paragraph (2) of this paragraph, shall enjoy all the privileges of a member of the Council except the right to vote or to count towards a quorum. (5) The Council shall establish a committee to be known as the steering committee which shall co-ordinate the functions of the other committees of the Council established under this Act. (6) The steering committee shall consist of the chairman of the Council, who shall be its chairman, the Director and five other members elected by the Council from amongst it own members. (7) If the steering committee wishes to obtain the advice of any person on any point, it may co-opt him as a member for such period as the Council may determine; but a person who is a member of the Committee by virtue of this section shall not vote nor count towards a quorum. 6. Every other committee appointed under paragraph 5 (I) of this Schedule shall consist of- (a) a chairman who shall be appointed by the Council from among the members of the Council; and (b) subject to paragraph 5 (4) of this Schedule, not more than five other members (who mayor may not be members of the Council). 7. (I) In this Schedule, unless the context otherwise requires, \"chairman\" means the chairman of a committee. (2) Unless specifically empowered by the Council, the decision of any committee or board appointed under this Schedule shall be of no effect until it is so confirmed by the Council. 8. (I) The Council shall meet for the conduct of business at such times, places and on such days as the chairman may appoint but shall meet not less than once in every four months. (2) The chairman may at any time and shall, at the request in writing of not less than six members, convene a meeting of the Council. (3) At any meeting of the Council the chairman shall preside; but in his absence, members present shall elect one of their number to preside at the meeting. (4) Where the Council desires to obtain the advice of any person on any particular matter, the Council may co-opt persons who are not members of the Council but the person co-opted shall not be entitled to vote at a meeting of the Council. M i sce llane o u s 9. (I) The fixing of the seal of the Council shall be authenticated by the signature of the Director or of some other member authorised generally or specially by the Council to act for that purpose. (2) Any contract or instrument which, if made or executed by a person not being a body corporate would not be required to be under seal, may be made or executed on behalf of the Council by any person generally or specially authorised to act for that purpose by the Council. (3) Any document purporting to be duly executed under the seal of the Council shall be received in evidence and shall, unless the contrary is proved, be presumed to be so executed. SUBSIDIARY LEGISLATION N o S u b s i d i ary L eg i s la tion"
    }
  ],
  "definitions": []
}