{
  "id": "national-institute-for-sports-act",
  "type": "statute",
  "title": "NATIONAL INSTITUTE FOR SPORTS ACT",
  "title_en": "NATIONAL INSTITUTE FOR SPORTS ACT",
  "short_name": "NATIONAL INSTITUTE FOR SPORTS ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=314",
  "provisions": [
    {
      "provision_ref": "s23",
      "section": "23",
      "title": "",
      "content": "section 23 thereof), is her eby vested in and shall be exercisable by the Council and not by any other person or auth or ity. 1 0. Establishment and membership of the Academic Board (1) There is her eby established for the Institute, an Academic Board consisting of- (a) the direct or of the Institute as chairman; (b) the head s of units in charge of academic studies, research and library services; (c) one repre sentative of the senior staff of the Institute; and (d) the registrar of t he Institute, who shall serve as secretary to the Academ ic Board. (2) The Academic Board shall be responsible for- ( a ) the direction and management of all academic matters of the Institute includin g prescribing appropriate admission requirements for the programmes of the Institute in line with the minimum st andards that may be set by an accreditin g authority, recommending to the Council the types of academic distinction s, prizes, scholarships, certificates and diplomas to be awarded; ( b ) conducting prescribed examinations and assessments thereof; ( c ) issuing codes of conduct in halls of residence; and ( d) discharging any other functions as may be delegated to it by the Council. Financial pro v i s ions 11 . Establishment of the fund of the Institute (I) The Institute shall es tablish and maintain a fund which shall be applied toward s the promotion of the objectives specified in this Act. (2) There shall be paid and credited to the fund established pur suant to subsection (I) of this sectiolt- (a) s uch sums as may be provided by the Government of the Federation for payment into the fund; ( b ) any fees charged for services rendered by the Institute; and (c ) proceeds from sales of materials such as journals, workshops or seminar pro ceedings and research exhibits insofar as patent rights are vested in the Ins titute. 12 . Power to accept gifts ( I) The Institute may accept gifts of land, money or other property upon such term s an d conditions, if any, as may be specified by the person or organisation making the gift. ( 2) The Institute shall not accept any gift if the conditions attached by the person o r organisation making the gift to the acceptance thereof are inconsistent with the function s of the Institute. 13 . Borrowing power, etc. ( I) The Council may, with the consent or in accordance with any general directio n given by the President, borrow by way of loan or overdraft from a source approved by th e Pres ident, such specified amount of money as may be required by the Institute for mee t ing its obligations and discharging its functions under this Act. (2) The Council may, subject to the provisions of this Act and the conditions of a ny trust created in respect of any property, invest all or any of its funds with the like conse nt or general authority as are mentioned in subsection (I) of this section. ( 3) The Council may invest any surplus funds of the Institute in securities prescribe d by the Trustee Investments Act or such other securities as may, from time to time, b e app roved by the Minister. [C ap. T22.] ( 4) Subject to the provisions of the Land Use Act, and any special or general dir ec tion which the Minister may give in that behalf, the Council may acquire or lea se any land required for its purposes under this Act. [ Cap. L5.] 1 4 . A nnual est im ates, account s and audit (1) The Council shall cause to be prepared, not later than six months before the en d of each year or such other time as the Minister may direct, an estimate of the expenditu re and income of the Institute during the next succeeding year, and when prepared they shall be submitted through the Minister for approval by the President. (2 ) The Council shall cause to be kept proper accounts and proper records in relat ion thereto and when certified by the Council such accounts shall be audited as provid ed in s ubsection (3) of this section. (3) The account s of the Institute shall be audited as soon as may be after the end of each year by auditors appointed from the list of auditors and in accordance with th e guidelines issued by the Auditor-General for the Federation and the fees of the audit ors and the expenses for the audit generally shall be paid from the funds of the Institute. Miscellaneous and supp l ementary p r ovisions 15. An nu a l re p o rt s Th e Council shall, not later than six months after the end of each year submit, throu gh the Minister, to the President a report on the activities of the Institute and its administr a tion during the immediately preceding year and shall include in such report the aud ited accounts of the Institute and the auditor's comments thereon. 16 . S t aff r egu l at i ons (1) The Institute may, s ubject to the provisions of this Act, make staff regulations r e lating generally to the conditions of service of the employees of the Institute and, withou t prejudice to the generality of the foregoing, such regulations may provide for- ( a) the appointment, promotion and disciplinary control (including dismi ssal) of employees of the Institute; and ( b) appeals by such employees against dismissal or other disciplinary measures, and until such regulations are made, any instrument relating to the conditions o f service of officers in the civil service of the Federation shall be applicable with such modifica tions as may be nec essary, to the employees of the Institute. (2) Staff regulations made under subsection (1) of this section shall not hav e effect until approved by the Minister and when so approved they need not be published in the Ga ze tte but the Council shall cause them to be brought to the notice of all affected pers ons in such manner as it may, from time to time, determine. 17. Disc ip line of stude n ts ( 1) Subject to the provisions of this section, where it appears to the Director th at any s tudent of the Institute has been found guilty of misconduct, the Director may, withou t prejudice to any other disciplinary powers conferred on him by rules, direct- (a) th at the student shall not, during such period as may be specified in the direc tion , participate in such activities of the Institute as may be so specified; or (b) th at the activities of the student shall, during such period as may be specifie d in th e direction, be restricted in such manner as may be so specified; or (c) that the stud ent be rusticated for such period as may be specified in the dire cti on; or (d) th at the student be expelled from the Institute. ( 2) Where a direction is given under subsection (I) of this section in respect of an y student, the student may, within the prescribed period and in the prescribed manner, ap p eal from the direction to the Council, and where such an appeal is brought, the Counc il shall, after causing such inquiry to be made in the matter as the Council considers just , e ither confirm or set aside the direction or modify it in such manner as the Council think s fit . (3) The fact that an appeal from a direction is brought in pursuance of the foregoin g subsect ion shall not affect the operation of the direction while the appeal is pending. 1 8. Interpretation In t his Act, unless the context otherwise requires-- \"Co uncil\" means the National Institute for Sports Governing Council constituted under"
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "",
      "content": "section 2 of this Act; \"c hairman\" means the chairman of the Council; \" director\" means the director of the Institute; \" member\" includes the chairman of the Council. 19. S hort title Thi s Act may be cited as the National Institute for Sports Act. SCHEDULE ["
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "",
      "content": "Section 3 (4).] S up p l e mentar y pr o vi s i o ns relatin g to th e Coun c il Pr ocee din g s o f the C o un c il 1. (I) S ubject to this Act and to"
    },
    {
      "provision_ref": "s27",
      "section": "27",
      "title": "",
      "content": "section 27 of the Interpretation Act (which provides for th e decisions of a statutory body to be taken by a majority of the members of the body and for th e pe rson presiding to have a second or casting vote), the Council may make standing order s reg ulating its proceedings or of any committee thereof. [ Cap. 123.] ( 2) The quorum at any meeting of the Council shall be seven and the quorum of an y committee of the Council shall be determined by the Council. 2 . (1) The Council shall meet not less than four times in each year and subject th ereto, the Co uncil shall meet whenever it is summoned by the chairman; and if the chairman is required to do so by notice given to him by not less than five other members, he shall summon a meeti ng of the Council to be held within fourteen days from the date on which the notice is given. (2) At a ny meeting of the Council the chairman shall preside but if he is absent, th e members present at the meeting shall appoint one of their number to preside at that meeting. (3) W here the Council desires to obtain the advice of any person on a particular matter , the Council may co-opt him as a member for such period as it thinks fit but a person who is a member by virtue of this sub-paragraph shall not be entitled to vote at any meetin g of the Co uncil and shall not count towards the quorum. ( 4) Notwithstanding anything in the foregoing provisions of this paragraph , the first meeting of the Council shall be summoned by the Minister. ( 5) The validity of any proceedings of the Councilor of a committee thereof sh all not be affected by any vacancy in the membership of the Councilor committee, or by any defect in the appointment of a member of the Councilor committee, or by reason that a person not ent itled to do so took part in the proceedings. C o mmi ttees 3. (l) The Council may appoint one or more committees to carry out, on behalf of th e Coun cil, such of its functions as the Council may determine. (2) A co mmittee appointed under this paragraph shall consist of such number of persons ( not necessarily all members of the Council) as may be determined by the Council an d a perso n other than a member of the Council shall hold office on the committee in accord ance with t he terms of his appointment. (3) A decision of a committee of the Council shall be of no effect until it is confirmed by the Council. Mi sce ll aneo u s 4. (1) The fixing of the seal of the Institute shall be authenticated by the signatu re of the c hairman or of some other member authorised generally or specially to act for that pu rpose by t he Council. (2) A ny contract or instrument which, if made or executed by a person not bein g a body co rporate, would not be required to be under seal, may be made or executed on behal f of the Institute by the director or any person generally or specially authorised to act for th at purpose by the Council. ( 3) Any document purporting to be a document duly executed under the seal of the Ins titute shall be received in evidence and shall, unless the contrary is proved, be presum ed to be so exec uted. ( 4) Members of the Council who are not public officers shall be paid out of m oneys at the disposal of the Council such remuneration, fees or allowances in accordance wit h such sca les as may be approved from time to time by the President. ( 5) Any member of the Councilor a committee thereof who has a personal interest in a ny contract or arrangement entered into or proposed to be considered by the Cou ncilor a co mmittee thereof shall forthwith disclose his interest to the Council and shall not vot e on any q uestion relating to such contract or arrangement. SUBSIDIARY LEGISLATION No Subsidiary Legislation"
    }
  ],
  "definitions": []
}