{
  "id": "national-planning-commission-act",
  "type": "statute",
  "title": "NATIONAL PLANNING COMMISSION ACT",
  "title_en": "NATIONAL PLANNING COMMISSION ACT",
  "short_name": "NATIONAL PLANNING COMMISSION ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=328",
  "provisions": [
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Representation on boards and governing council of certain bodies",
      "content": "13. Representation on boards and governing council of certain bodies The Commission shall be represented on the boards and governing councils of such bodies as the President may decide and, without prejudice to the foregoing provisions the Commission shall, on the commencement of this Act, be represented on the boards and councils on which the Planning Office of the former Ministry of Budget and Planning served."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "AfTtliated bodies",
      "content": "14. AfTtliated bodies As from the commencement of this Act, the following bodies shall become subsidiary organs of the Commission that is- (a) the National Centre for Economic Management and Administration; (b) the Centre for Management Development; (c) the Federal Office of Statistics; (d) the National Manpower Board; (e) the National Data Bank; and (f) such other bodies as the President may decide, from time to time. Miscellaneous and supplementary"
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Annual reports",
      "content": "15. Annual reports The Commission shall prepare and submit to the President not later than 30 June each year, a report in such form as he may direct on the activities of the Commission during the immediately preceding year, and shall include in such report a copy of the audited accounts of the Commission for that year and the Auditor-General's comments therein."
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Transitional provisions",
      "content": "16. Transitional provisions (1) On the commencement of this Act- (a) the Planning Office of the former Ministry of Budget and Planning shall cease to exist and its rights and obligations shall reside in the Commission; (b) the Capital Budget section of the Budget Office shall be transferred to the Federal Ministry of Finance; (c) the existing staff of the Planning Office of the former Ministry of Budget and Planning shall be deemed to be the staff of the Commission, so however that- (i) a staff may opt out of the Commission within sixty days of the coming into force of this Act; (ii) the Commission may, on advice, dispense with the services of any existing staff whose level of competence is adjudged inadequate for coping with the task of the Commission. (2) All existing legislation and guidelines that are at variance with this Act shall be deemed to have been amended in conformity with the provisions of this Act. 17. Regulations The President may make regulations generally for the purpose of giving effect to the provisions of this Act. 18. Power of the President to give directives Subject to the provisions of this Act, the President may give to the Commission directives of a general nature or relating generally to matters of policy with regards to the exercise by the Commission of its functions and it shall be the duty of the Commission to comply with such directives. 19. Repeal of 1992 No. 12 The National Planning Commission Act is hereby repealed. 20. Savings and transfer of liabilities, staff, etc. (I) The statutory functions, rights, interest, obligations and liabilities of the Commission existing before the commencement of this Act under any contract or instrument, shall by virtue of this Act be deemed to have been assigned to and vested in the Commission established by this Act. (2) Any such contract or instrument as is mentioned in subsection (I) of this section shall be of the same force and effect against or in favour of the Commission established by this Act and shall be enforceable as fully and effectively as if instead of that Commission the Commission established by this Act had been named therein or had been a party thereto. (3) The Commission established by this Act shall be subject to all the obligations and liabilities to which the Commission was subject immediately before this Act and all other persons shall have the same rights, powers and remedies against the Commission established by this Act as they had against the Commission immediately before the commencement of this Act. (4) Any proceedings or cause of action pending or existing immediately before the commencement of this Act, by or against the Commission, in respect of any right, inter- est, obligation or liability of the Commission may be continued or as the case may be,commenced, and any determination of a court of law, tribunal or other authority or person may be enforced by or against the Commission established by this Act to the same extent that such proceedings, cause of action or determination might have been continued, commenced or enforced by or against the Commission established under the repealed Act. (5) All assets, funds, resources and other movable or immovable property which immediately before the commencement of this Act were vested in the Commission estab- lished under the repealed Act shall by virtue of this Act and without further assurance, be vested in the Commission established by this Act. (6) Any person who immediately before the coming into force of this Act is the holder of any office in the Commission existing before the commencement of this Act shall, on the commencement of this Act, continue in office and be deemed to have been appointed to his office by the Commission established by this Act unless the authority by which the person was appointed terminates the appointment. 21. Interpretation In this Act, unless the context otherwise requires- \"Commission\" means the National Planning Commission established by section 1 of this Act; \"deputy chairman\" means the deputy chairman of the Commission; \"member\" means a member of the Commission and includes the chairman; \"repealed Act\" means the National Planning Act 1992; \"secretary\" means the secretary of the Commission. 22. Short title This Act may be cited as the National Planning Commission Act. SCHEDULE [Section 3 (7).] Pr oce edi ngs o f th e C o mm iss ion 1. (I) The Commission shall meet for the conduct of its business at such time, place and on such day as the President may appoint but shall meet not less than twice in a year. (2) At a meeting in which the Vice-President is not present, the deputy chairman shall preside. 2. The Commission shall have power to regulate its proceedings and may make standing orders for that purpose and subject to any such standing orders and to paragraph 3 of this Schedule, may function notwithstanding- (a) any vacancy in its membership or the absence of any member; (b ) any defect in the appointment of a member; or (c) that a person not entitled to do so took part in its proceedings. The quorum at any meeting of the Commission shall be a simple majority of the members. Where standing orders made under paragraph 2 of this Schedule provide for the Commission to co-opt persons who are not members of the Commission, such persons may attend meetings of the Commission and advise it on any matter referred to them by the Commission but shall not count towards a quorum and shall not be entitled to vote at any meeting of the Commission. Committees 5. The Commission may appoint one or more committees to advise it on the exercise and performance of its functions under this Act and shall have power to regulate the proceedings of its committees. Miscellane o us 6. (I) Any contract or instrument which if entered into or executed by a person not being a body corporate would not be required to be under seal, may be entered into or executed on behalf of the Commission by any person generally or specifically authorised in that behalf by the Commission. (2) Any member of the Commission or of a committee thereof, who has a personal interest in any contract or arrangement entered into or proposed to be considered by the Com- mission or a committee thereof, shall forthwith disclose his interest to the Commission or the committee, as the case may be, and shall not vote on any question relating to such contract or arrangement. 7. (I) The common seal of the Commission shall not be used or affixed to any document except in pursuance of a resolution duly passed at a properly constituted meeting of the Com- mission and recorded in the minutes of the meeting. (2) The fixing of the seal of the Commission shall be authenticated by the signature of the deputy chairman or some other member authorised generally or specifically by the Com- mission to act for that purpose. (3) Any document purporting to be a document duly executed under the seal of the Commission shall be received in evidence and shall, unless the contrary is proved, be deemed to be so executed. S U BSIDIARY LEGISLATION No Sub s idiar y Legislation"
    }
  ],
  "definitions": []
}