{
  "id": "national-health-insurance-scheme-act",
  "type": "statute",
  "title": "NATIONAL HEALTH INSURANCE SCHEME ACT",
  "title_en": "NATIONAL HEALTH INSURANCE SCHEME ACT",
  "short_name": "NATIONAL HEALTH INSURANCE SCHEME ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=304",
  "provisions": [
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Tenure of office",
      "content": "Tenure of office (I) A member of the Council, other than an ex-officio member, shall hold office for a term of four years in the first instance and may be re-appointed for a further term of four years and no more. (2) The members of the Council shall be paid such remuneration and allowances as the Federal Government may, from time to time, determine for the chairmen and members of statutory boards generally. (3) A member of the Council, other than an ex -offi c i o member, may resign his appointment by notice, in writing under his hand, addressed through the Minister, to the President, which resignation shall take effect only on acknowledgement by the President."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Cessation of membership",
      "content": "Cessation of membership (I) A member of the Council shall cease to hold office if- (a) he becomes of unsound mind; or ( b ) he becomes bankrupt or makes a compromise with his creditors; or (c) he is convicted of a felony or of any offence involving dishonesty; or (d) he is guilty of serious misconduct in relation to his duties. (2) A member of the Council may be removed from office by the President on the recommendation of the Minister if he is satisfied that it is not in the interest of the Scheme or the interest of the public that the member should continue in office. (3) Where a vacancy occurs in the membership of the Council, it shall be tilled by the appointment of a successor to hold office for the remainder of the term of office of his predecessor, so however, that the successor shall represent the same interest and shall be appointed by the President. PART II Obj e c t ives , fun c ti o n s an d powe r s o f the S c h e m e 5. Objectives of the Scheme, etc. The objectives of the Scheme shall be to- ( a ) ensure that every Nigerian has access to good health care services; (b) protect families from the financial hardship of huge medical bills; (c) limit the rise in the cost of health care services; (d) ensure equitable distribution of health care costs among different income groups; (e) maintain high standard of health care delivery services within the Scheme (f) ensure efficiency in health care services; (g) improve and harness private sector participation in the provision of health care services; (h) ensure adequate distribution of health facilities within the Federation; (i) ensure equitable patronage of all levels of health care; (j) ensure the availability of funds to the health sector for improved services. Functions and powers of the Scheme The Scheme shall be responsible for- (a) registering health maintenance organisations and health care providers under the Scheme; (b) issuing appropriate guidelines to maintain the viability of the Scheme; (c) approving format of contracts proposed by the health maintenance organisations for all health care providers; (d) determining, after negotiation, capitation and other payments due to health care providers, by the health maintenance organisations; (e) advising the relevant bodies on inter-relationship of the Scheme with other social security services; (j) the research and statistics of matters relating to the Scheme; (g) advising on the continuous improvement of quality of services provided under the Scheme through guidelines issued by the Standard Committee established under section 46 of this Act; ( h ) determining the remuneration and allowances of all staff of the Scheme; (i) exchanging information and data with the National Health Management Information System, Nigerian Social Insurance Trust Fund, the Federal Office of Statistics, the Central Bank of Nigeria, banks and other financial institutions, the Federal Inland Revenue Service, the State Internal Revenue Services and other relevant bodies; (j) doing such other things as are necessary or expedient for the purpose of achieving the objectives of the Scheme under this Act. Functions of the Council The Council shall have power to- (a) manage the Scheme in accordance with the provisions of this Act; (b) determine the overall policies of the Scheme, including the financial and operative procedures of the Scheme; (c) ensure the effective implementation of the policies and procedures of the Scheme; (d) assess, from time to time, the research, consultancy and training programmes relative to the Scheme; (e) arrange for the financial and medical audit of the Zonal Health Insurance Offices established under section 21 of this Act; (f) set guidelines for effective co-operation with other organisations to promote the objectives of the Scheme (g) co-ordinating quarterly returns from the Zonal Health Insurance Offices; (h) ensuring public awareness about the Scheme; (i) co-ordinating manpower training under the Scheme; (j) carry out such other activities as are necessary and expedient for the purpose of achieving the objectives of the Scheme as set out in this Act. PART III Sta f f of t h e S c h e m e Executive Secretary and other staff of the Scheme (1) There shall be appointed by the President, on the recommendation of the Minister,an Executive Secretary. (2) The Executive Secretary shall- (a) be a person with relevant qualification and experience; (b) be the chief executive and accounting officer of the Scheme; (c) hold office- (i) for a period of five years in the first instance and may be re-appointed for a further term of five years and no more; and (ii) on such terms and conditions as may be specified in his letter of appointment. (3) The Executive Secretary shall, subject to the general direction of the Council, be responsible for- (a) the day-to-day administration of the Scheme; (b) keeping the books and proper records of the proceedings of the Council (c) the administration of the secretariat of the Council; and (d) the general direction and control of all other employees of the Scheme. (4) The Council shall- ( a) appoint, for the Scheme, such number of directors and other employees as may, in the opinion of the Council, be required to assist the Council in the discharge of any of its functions under this Act; and ( b ) pay to persons so appointed such remuneration (including allowances) as the Council may, after consultation with the Federal Civil Service Commission,determine. 9. Appointment of an actuary for the Scheme (1) The Council shall appoint for the Scheme, a licensed actuary on such terms and conditions of service as the Council may, from time to time, determine. (2) The actuary shall review the Scheme and evaluate it actuarially, including the rates of contributions payable under the Scheme and make appropriate recommendations to the Council. (3) If, having regard to the review and evaluation carried out by the actuary under subsection (2) of this section, the Council considers that the rates of contributions have not retained their value in relation to the general level of earning obtaining in Nigeria, the Council may modify the rates to the extent considered appropriate and bring the new rates to the notice of the persons affected by the modification. 10. Service in the Scheme to be pensionable (1) Service in the Scheme shall be approved service for purposes of the Pensions Act. [Cap. P4.] (2) Employees of the Scheme shall be entitled to pensions, gratuities and other retirement benefits as are enjoyed by persons holding equivalent grades in the civil service of the Federation. (3) Nothing in subsections (1) and (2) of this section or in this Act shall prevent the appointment of a person to any office on terms which preclude the grant of pension and gratuity in respect of that office. (4) For the purposes of the application of the provisions of the Pensions Act, any power exercisable thereunder by a Minister or other authority of the Government of the Federation, other than the power to make regulations under section 23 of the Act, is hereby vested in and shall be exercisable by the Council and not by any other person or authority. PART IV F i nan c ial pr ov isi o ns 11. Funds, etc. (I) The Counci I shall establish and maintain for the Scheme a fund from which shall be defrayed all expenditure incurred for the purposes of the Scheme. (2) There shall be paid and credited to the fund established in pursuance of subsection ( I) of this section- (a) such money as may be received from the health maintenance organisations; (b) such money as may be granted or received from the Federal, State and local governments; (c ) such money as may, from time to time, be granted or received from- (i) the organised private sector; (ii) international or donor organisations and non-Governmental organisations; (3) The Scheme shall, from time to time, apply the funds at its disposal- (a) to the cost of the administration of the Scheme;"
    },
    {
      "provision_ref": "s24",
      "section": "24",
      "title": "Annual report",
      "content": "24. Annual report by Zonal Offices (1) A Zonal Office shall prepare an annual report of its activities and operations after the end of each financial year and shall submit to the Council the annual report together with the audited accounts referred to in this Act. (2) Notwithstanding the submission of the report referred to in subsection (1) of this section, the Council may require a Zonal Office to obtain from the auditors appointed under this Act, such other reports, statements or explanations in connection with the Scheme and operations of the Zonal Office as the Council may, from time to time, consider expedient."
    },
    {
      "provision_ref": "s25",
      "section": "25",
      "title": "Inspection of books of account by auditors",
      "content": "25. Inspection of books of account by auditors (1) The auditors appointed under this Act shall be entitled at all reasonable times to require to be produced to them accounts and other records kept by a Zonal Office and to inquire from any member, agent or employee of the Zonal Office such information and explanations as in the opinion of the auditors are necessary for the purpose of their audit. (2) Any member, agent or employee of a Zonal Office who fails, without reasonable cause, to comply with a requirement of an auditor under subsection (1) of this section, commits an offence and is liable on conviction to a fine not exceeding N I 0,000 or imprisonment for a term not exceeding three months or to both such fine and imprisonment. PART VII Arbitra tio n 26. Es tablishmen t a nd functions of the State and Federal Capital Territor y Arbi tr a tion Board (1) There shall be established for each State of the Federation and the Federal Capital Territory, Abuja, as and when necessary, a State Health Insurance Arbitration Board and a Federal Capital Territory Health Insurance Arbitration Board, respectively, (in this Act referred to as \"Arbitration Board\"). (2) The Arbitration Board shall be charged with the responsibility of considering complaints made by any aggrieved party- (a) of violation of any of the provisions of this Act; or ( b ) against any of the agents of the Scheme; or (c) against an organisation or a health care provider. (3) A complaint made under subsection (2) of this section shall be made in writing within 60 days from the date of the action giving rise to the complaint, notwithstanding that credible reasons have been rendered for the action. (4) The period specified in subsection (3) of this section may be extended if the Arbitration Board is satisfied that the complainant was justifiably unable to make the complaint within that period. 27. Membership of the Arbitration Board (1)The Arbitration Board shall consist of- (a) a chairman who shall be a legal practitioner with not less than 15 year post- qualification experience; (b) one person each to represent each of the following- (i) the Nigerian Medical Association in the State or the Federal Capital Territory, Abuja; (ii) the Nigerian Employers Consultative Association in the State or the Federal Capital Territory, Abuja; (iii) the Nigeria Labour Congress in the State or the Federal Capital Territory, Abuja; (iv) the National Association of Nigerian Nurses and Midwives in the State or the Federal Capital Territory, Abuja; and (v) the Pharmaceutical Society of Nigeria in the State or the Federal Capital Territory, Abuja,as the case may be; and (c) two persons to represent the public interest. (2) The members of the Arbitration Board shall be- (a) appointed by the Governor of the State or the Minister of the Federal Capital Territory, Abuja, as the case may be, on such terms and conditions as may be specified in their letters of appointment; and (b) paid such sitting and other allowances as the Council may decide. (3) The quorum of any sitting of the Arbitration Board shall be five members. (4) The chairman of the Arbitration Board shall convene all meetings of the Arbitration Board. (5) Subject to subsection (3) of this section, the Arbitration Board may make provisions regulating its own proceedings. (6) There shall be for the Arbitration Board a secretary who shall be appointed by the Council on such terms and conditions as the Council may determine. PART VIII Off e n ces, pen a lti es and l eg al pro cee di ngs 28. Offences ( I) Any person who- (a) fails to pay into the account of an organisation and within the specified period any contribution liable to be paid under this Act; or (b) deducts the contribution from the employee's wages and withholds the contribution or refuses or neglects to remit the contribution to the organisations concerned within the specified time,commits an offence. (2) A person guilty of an offence under subsection (1) of this section is liable on conviction- (a) in the case of a first offence, to a fine of NlOO,OOO or 500 per c entum of the amount of the contribution involved, together with accrued interest on the contribution, whichever is higher, or imprisonment for a term not exceeding two years or less than one year or to both such fine and imprisonment; and (b) in the case of a second or subsequent offence, to a fine of N200,000 or 1,000 per c entum of the amount of the contribution involved together with accrued interest on the contribution, whichever is higher, or imprisonment for a term not exceeding five years or less than two years or to both such fine and imprisonment. 29. Offences by bodies corporate, etc. (l) Where an offence under this Act has been committed by a body corporate or firm or other association of individuals, a person who at the time of the commission of the offence- (a) was an officer of the body corporate, firm or other association; or (b) was purporting to act in the capacity of an officer of the body corporate, firm or other association,is deemed to have committed the offence and liable to be prosecuted and punished for the offence in like manner as if he had himself committed the offence, unless he proves that the act or omission constituting the offence took place without his knowledge, consent or connivance. (2) In this section, \"officer\", includes- (a) in the case of a body corporate, a director, chief executive by whatever name called, manager and secretary of the body corporate; (b) in the case of a firm, a partner, manager and secretary of the firm; and ( c ) in the case of any other association of individuals, a person concerned in the management of the affairs of the association. 30. Prosecution of offender Any person who contravenes any of the provisions of this Act shall be prosecuted by- ( a ) the Attorney-General of the State or any legal officer in the Ministry of Justice of the State; and (b) in the case of the Federal Capital Territory, Abuja, by the Attorney-General of the Federation or any legal officer in the Federal Ministry of Justice. 31. Jurisdiction The High Court of a State or of the Federal Capital Territory, Abuja, shall have- (a) jurisdiction to try offenders under this Act; and (b) power, notwithstanding any thing to the contrary in any other enactment, to impose the penalties provided for offences in this Act. 32. Court to order payment of contributions together with interest and penalty (I) The High Court before which a person is convicted of an offence under this Act may, without prejudice to any civil remedy, order a person to pay to the fund of the Scheme the amount of any contributions together with interest and penalty thereon, certified by the Council to be due and payable at the date of the conviction and such amount shall be paid into the fund of the Scheme for its credit, where applicable or of the employee concerned. (2) Any contribution paid into the fund of the Scheme under subsection (I) of this section shall be refunded to the organisation entitled to receive the contribution. 33. Commencement of proceedings Proceedings for an offence under this Act may be commenced at any time after the commission of the offence. 34. Limitation of suits against the Scheme, etc. (I) Subject to the provisions of this Act, the provisions of the Public Officers Protection Act shall apply in relation to any suit instituted against any officer or employee of the Scheme. [Cap. P41.] (2) Notwithstanding anything contained in any other enactment, no suit shall lie against any member of the Council, the Executive Secretary or any other officer or employee of the Scheme for any act done in pursuance or execution of this Act or any other enactment or law, or of any public duty or authority or in respect of any alleged neglect or default in the execution of this Act or such enactment or law, duty or authority, shall lie or be instituted in any court unless it is commenced- (a) within three months next after the"
    }
  ],
  "definitions": []
}