{
  "id": "national-sugar-development-council-act",
  "type": "statute",
  "title": "NATIONAL SUGAR DEVELOPMENT COUNCIL ACT",
  "title_en": "NATIONAL SUGAR DEVELOPMENT COUNCIL ACT",
  "short_name": "NATIONAL SUGAR DEVELOPMENT COUNCIL ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=339",
  "provisions": [
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Tenure of office of the chairman and members of the Council",
      "content": "Tenure of office of the chairman and members of the Council (1) The chairman and members of the Council other than ex offici o members, shall each hold office for a term of four years, subject to renewal by the President for only one further term of four years and no more. (2) Without prejudice to subsection (I) of this section the Minister may appoint from among the members any person to act as the chairman during the absence or temporary incapacitation by illness or otherwise of the chairman and the person so appointed shall, while the appointment subsists, have the same powers as exercised by the chairman."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Secretariat and other officers of the Council",
      "content": "Secretariat and other officers of the Council (1) There shall be appointed by the Minister, an executive secretary who shall be the chief executive of the Council and shall be responsible to the Council and the chairman for the day-to-day administration of the Council. (2) There may be appointed from time to time by the Council, such other staff as may be required for the purpose of the efficient performance of the functions of the Council and the staff appointed under this section shall be paid by the Council such remuneration and allowances as are payable to persons of equivalent grades in the public service of the Federation. (3) The secretariat of the Council shall be located in the Federal Capital Territory, Abuja."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Fund of the Council",
      "content": "Fund of the Council (1) The Council shall establish and maintain a fund which shall be applied towards the promotion of the objectives for which the Council is established. (2) There shall be paid and credited to the fund established pursuant to subsection (1) of this section- (a) ten per cent surcharge on sugar imports; (b) fees charged for services rendered by the Council; (c) contributions from the organised private sector; and (d) all sums accruing to the Council by way of gifts, testamentary disposition and endowments or contributions from philanthropic organisations or persons."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Power to accept gifts",
      "content": "Power to accept gifts (1) The Council may, with the approval of the Minister, accept gifts of land, money or other property upon such terms and conditions if any, as may be specified by the person or organisation making the gift. (2) The Council shall not accept any gift if the conditions attached by the person or organisation making the gift to the acceptance thereof are inconsistent with the functions of the Council. 8. Power to borrow (l) The Council may, with the consent of the Minister or in accordance with any general guidelines as may be approved by the President, borrow by way of loan or overdraft from any source any money required by the Council for meeting its obligations and discharging its functions under this Act so however that where the sum or the aggregate of the sum involved at anyone time does not exceed one third of the Council's income no such consent or authority shall be required. (2) The Council may, subject to the provisions of this Act and the conditions of any trust created in respect of any property, invest all or any of its funds with the consent of the Minister or in accordance with any general guidelines approved by the President. (3) The Council may invest any surplus of the Council in such securities as may be approved by the President. 9. Annual estimate and accounts (I) The Council shall cause to be prepared not later than 30 October in each year, an estimate of the expenditure and income of the Council during the next succeeding year and when prepared they shall be submitted to the Minister. (2) The Council shall causes to be kept proper accounts of the Council and proper records in relation thereto and when certified by the Council such accounts shall be audited as provided in subsection (3) of this section. (3) The accounts of the Council shall be audited not later than six months after the end of the year to which the accounts relate by auditors appointed by the Council from the list and in accordance with the guidelines supplied by the Auditor-General for the Federation. 10. Annual report The Council shall, not later than 30 June in each year, submit to the Minister a report on the activities of the Council and its administration during the immediately preceding year and shall include in such report a copy of the audited accounts of the Council for that year and the auditor's report thereon. 11. Staff regulations (I) The Council may, subject to the provisions of this Act, make staff regulations relating generally to the conditions of service of the staff of the Council and without prejudice to the generality of the foregoing, such regulations may provide for- (a) the appointment, promotion, termination, dismissal and disciplinary control of the staff of the Council; and (b) appeals by such staff against dismissal or other disciplinary measures, and until such regulations are made, any instrument relating to the condition of service of the office in the civil service of the Federation shall be applicable with such modifications as may be necessary to the staff of the Council. (2) Staff regulations made under subsection (1) of this section shall not have effect until approved by the Minister, and when so approved the same shall not be published in the Federal Ga z ette but the Council shall cause them to be brought to the notice of all affected persons in such manner as it may, from time to time, determine. 12. Procedure in respect of suit, against the Council No suit shall be commenced against the Council before the expiration of a period of one month after written notice of intention to commence the suit shall have been served on the Council by the intending plaintiff or his agent and the notice shall explicitly state- (a) the cause of action; (b) the particulars of the claim; (c) the name and place of abode of the intending plaintiff; and (d) the relief which he claims. 13. Service of documents The notice referred to in section 12 of this Act and any summons, notice or other document required or authorised to be served upon the Council under the provisions of this Act or any other enactment or law may be served by delivering the same to the chairman or the executive secretary of the Council, or by sending it by registered post addressed to the executive secretary at the principal office of the Council. 14. Restriction on execution against the property of the Council In any action or suit against the Council, no execution or attachment or process in the nature thereof shall be issued against the Council, but any sum of money which may, by the judgment of the court, be awarded against the Council shall, subject to any directions given by the Council, be paid from the general reserved fund of the Council. 15. Regulations The Minister may make regulations generally for the purpose of giving effect to the provisions of this Act. 16. Power of the Minister to give directives Subject to the provisions of this Act, the Minister may give the Council directives of a general nature or relating generally to matters of policy with regards to the exercise by the Council of its functions; and it shall be the duty of the Council to comply with such directives. 17. Interpretation In [his Act, unless [he comext otherwise requires \"Council\" means the National Sugar Development Council established by section of this Act; \"chairman\" means the chairman of the Council; \"member\" means a member of the Council and includes the chairman; \"Minister\" means the Minister charged with responsibility for industry. 18. Short title This Act may be cited as the National Sugar Development Council Act. SCHEDULE [Section 2 (2).] P roceed i ngs o f th e Counci l 1. (I) The Council shall meet for the conduct of its business at such time, place and on such day as the chairman may appoint, but shall meet not less than twice in a year. (2) At every meeting of the Council the chairman shall preside but if he is absent, the members present at the meeting shall appoint one of their number to preside at that meeting. 2. The Council shall have power to regulate its proceedings or those of any of its committees and may make standing orders for that purpose and subject to any such standing orders and to paragraph 3 of this Schedule, may function notwithstanding- (a) any vacancy in its membership or the absence of any members; (b) any defect in the appointment of a member; or (c) that a person not entitled to do so took part in its proceedings. The quorum at any meeting of the Council shall be a simple majority of the members. Where standing orders made under paragraph 2 of this Schedule provide for the Council to co-opt persons who are not members of the Council, such persons may attend meetings of the Council and advise it on any matter referred to them by the Council but shall not count towards a quorum and shall not be entitled to vote at any meeting of the Council. Co m mi tt ees 5. The Council may appoint one or more committees to advise it on the exercise and performance of its functions under this Act and shall have power to regulate the proceeding of its committees. 6. (I) Any contract or instrument which, if entered into or executed by a person not being a body corporate would not be required to be under seal, may be entered into or executed on behalf of the Council by any person generally or specifically authorised in that behalf by the Council. (2) Any member of the Councilor a committee thereof, who has a personal interest in any contract or arrangement entered into or proposed to be considered by the Councilor a committee thereof, shall forthwith disclose his interest to the Councilor the committee, as the case may be, and shall not vote on any question relating to such contract or arrangement. 7. (1) The common seal of the Council shall not be used or affixed to any document except in pursuance of a resolution duly passed at a properly constituted meeting of the Council and recorded in the minutes of the meeting. (2) The fixing of the seal of the"
    }
  ],
  "definitions": []
}