{
  "id": "nigeria-social-insurance-trust-fund-act",
  "type": "statute",
  "title": "NIGERIA SOCIAL INSURANCE TRUST FUND ACT",
  "title_en": "NIGERIA SOCIAL INSURANCE TRUST FUND ACT",
  "short_name": "NIGERIA SOCIAL INSURANCE TRUST FUND ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=348",
  "provisions": [
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Contribution to be paid monthly: amount thereof",
      "content": "13. Contribution to be paid monthly: amount thereof (1) Contributions of the various categories shall be paid on a monthly basis at the rate prescribed by regulations made under section 40 of this Act which shall be computed by reference to the wages of the employee concerned. (2) The contributions payable in respect of each month shall fall due on the last day of the month concerned."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Penalty",
      "content": "14. Penalty (1) If any contribution is not paid within the time prescribed in section 13 of this Act, a sum equal to 5 p e r ce ntum of the amount unpaid, shall be added for each month or part of the month after the date when payment should have been made and any amount added shall be recoverable as a debt owing to the Board by the employer. (2) The Board may remit, wholly or partly, the penalty imposed under subsection (1) of this section."
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Employer not to reduce remuneration on account of contributions",
      "content": "15. Employer not to reduce remuneration on account of contributions No employer shall, by reason of its liability for any contribution (or penalty thereon made under this Act or regulations made thereunder, reduce whether directly, or indirectly, the remuneration or allowances of any employee on behalf of whom the contribution is payable under this Act. PART V Benefits"
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Categories of benefits",
      "content": "16. Categories of benefits Subject to this Act, the following benefits shall be payable to or in respect of a contributor who has satisfied the applicable conditions prescribed by regulations made under this Act, that is- (a) retirement pension benefit; or (b) retirement grant; or (c) survivors benefit; or (d) death grant; or (e) invalidity benefit; or (f) invalidity grant; or (g) such other benefit as may be approved from time to time by the Board. 17. Conversion of benefits into credits against stated purposes Subject to regulations made in that behalf, a contributor may- (a) apply to have his contributions converted into credits towards the purchase of real property intended for use by himself or his family for residential purposes; or (b) apply to have his contributions converted into credits towards the purchase of or acquisition of equity holding in the company which employs the contribu- tor. (2) The Board shall not approve the conversion of any contribution into credits for the purchase of or acquisition of equity holding in a company pursuant to paragraph (b) of subsection (I) of this section, unless at least two thirds of the employees in the company concerned have collectively elected to exercise the right to purchase or acquire the equity holding in the event of the equity being available for sale. PART VI In s p ec t ors a nd p owers of ent ry, e t c. 18. Power of Board to designate its employees as inspectors The Board may, from time to time, designate as inspectors, such of its employees as it may determine and may assign the inspectors to such areas of Nigeria as the Board may determine. 19. Power of inspectors to enter premises, etc. (I) Subject to the production of a letter of authority granted in that behalf, an inspector within the area for which he is designated an inspector may- (a) at any reasonable time enter any premises or place where he has reasonable cause to believe persons are being employed in respect of whom or by whom contributions are payable under this Act to make any inquiry or examination which the inspector considers necessary to satisfy himself that the provisions of this Act are being complied with; (b) at any reasonable time enter any such premises as are referred to in paragraph (a) of this subsection and on such occasion may- (i) search the premises or any receptacle therein for books, records, documents, papers or things which may afford evidence as to the violation of the provisions of this Act or regulations made thereunder; (ii) interrogate either alone or in the presence of witnesses any employer, employee or any other person found in the premises on any matter concerning the application of any of the provisions of this Act; (c) require the production for examination of any book, register, account, receipt or other document pertaining to contributions or liability to register or to pay contributions under this Act and may copy such documents or make extracts therefrom. (2) If, during any examination, it appears to the inspector that there has been a violation of the provisions of this Act or the regulations made thereunder, the inspector shall have the power to seize and take away any of the books, records or other documents relating to the employed person or unpaid contributions and may retain them until they are produced in any proceedings. PART VII Penalties and legal pr oc e e din gs 20. Penalties (1) A person who- (a) for the purpose of evading payment of any contributions by him or by any other person, knowingly or recklessly makes any statement which is false or which is misleading or deceptive or produces or causes to be produced or furnished, any document which is false in any material particular; or (b) for the purpose of obtaining any payment or other benefit under this Act for himself or some other person- (i) knowingly makes a false statement or representation; or (ii) knowingly produces or furnishes or causes to be produced or furnished any document which is false in any material particular; or (c) being required to register under this Act or regulations made thereunder fails to do so within the period specified therein; or (d) obstructs any inspector or officer of the Board in the discharge of his duties under this Act, commits an offence and shall on conviction be liable to a fine of NlO,OOO or to imprisonment for one year. (2) A person who- (a) fails to pay to the fund within the prescribed period any contribution liable to be paid under this Act; or (b) deducts from the employee's wages and withholds the deduction or refuses or neglects to remit the deduction to the Board, commits an offence and is liable on conviction- (i) in the case of a first offence to a fine of NlO,OOO or 500 p er c en tum of the amount of the contribution involved together with accrued interest thereon, whichever is higher; or (ii) in the case of a second or subsequent offence to a fine of NlO,OOO or 500 per c ent u m of the amount of the contribution involved together with accrued interest thereon, whichever is higher. 21. Offences by body of persons (1) Where an offence under this Act is committed by a body of persons- (a) in the case of a body corporate, every director or officer of that body shall be deemed to be guilty of the offence; (b) in the case of a partnership or other association of individuals, every partner or officer of that body shall be deemed to be guilty of the offence and liable ac- cordingly. (2) No person shall, however, be deemed to be guilty of an offence under subsection (1) of this section, if he proves to the satisfaction of the court that the offence was committed without his consent and connivance and that he exercised all due diligence to prevent the commission of the offence, having regard to all the circumstances. 22. Conduct of proceedings in certain cases Subject to section 174 of the Constitution of the Federal Republic of Nigeria 1999 (which relates to the power of the Attorney-General of the Federation to institute, con- tinue or discontinue criminal proceedings), any employee of the Board authorised in that behalf by the Board and who is a legal practitioner may before any court of competent jurisdiction conduct or defend any complaint or other proceedings arising under this Act. 23. Court to order payment of contribution together with interest and penalty The court before whom any person is convicted of an offence under this Act may, without prejudice to any civil remedy, order that person to pay to the Fund the amount of any contributions together with any interest or penalty on the contribution, certified by the Board to be due from that person to the Fund at the date of the conviction and the amount shall be paid into the Fund for the credit where applicable, of the employees concerned. 24. Proceedings for offences may be commenced at any time Proceedings in respect of an offence under this Act may be commenced at any time after the commission of the offence. 25. Time for commencement of proceedings for recovery of contributions (1) Notwithstanding anything contained in any limitation law, contributions under this Act together with any interest or penalty payable or imposed for late payment may be recovered by an action for a debt owing to the Board at any time within twelve months from the date when the contribution or penalty becomes due. (2) An action for the recovery of contribution or other penalty under this section may be instituted in the name of the Board by an employee of the Board authorised to do so. PART VIII Finan c ial pro v isions 26. Estimates The Board shall cause to be prepared in respect of each year an estimate of its income and of expenditure for that year. 27. Expenses to be paid out of the Fund All expenses incurred in the administration of the Fund shall be paid by the Board out of the monies of the Fund. 28. Investment of funds Money standing to the credit of the Fund and not immediately required to be expended in meeting the obligations of t"
    },
    {
      "provision_ref": "s40",
      "section": "40",
      "title": "Regulations",
      "content": "40. Regulations (1) The Board may, after consultation with the Minister, make regulations giving effect to the provisions of this Act and without prejudice to the generality of the foregoing the regulations may provide for- (a) the prescription of anything required to be prescribed under the Act; (b) the prescription of rates of contributions payable under the Act; (c) specifying the records to be kept by the Board and its employees in respect of contributions to the Fund; (d) specifying the amount of contributions payable under the Act; (e) specifying the method of collecting contributions under the Act; (j) the prescription of the procedure for making claims and making payments un- der the Act; and (g) the prescription of any forms or documents required for the purposes of the Act; (h) the prescription of the procedure for assessment of contribution by or on behalf of the Board. (2) Regulations make under this section shall not come into operation until they are published in the Federal Gazette ."
    },
    {
      "provision_ref": "s41",
      "section": "41",
      "title": "Trustee Investments Act not to apply",
      "content": "41. Trustee Investments Act not to apply The provisions of the Trustee Investment Act shall not apply to the investment of money by the Board."
    },
    {
      "provision_ref": "s42",
      "section": "42",
      "title": "Repeal",
      "content": "42. Repeal Without prejudice to the provisions of section 6 of the Interpretation Act, the National Provident Fund Act and the National Provident Fund (Management Board, etc.) Act (in this Act referred to as \"the Fund\" and \"the Management Board\" respectively) are hereby repealed. [Cap. 123. Cap. 273 L.F.N. 1990. Cap. 274 L.F.N. 1990.]"
    },
    {
      "provision_ref": "s43",
      "section": "43",
      "title": "Savings and tr",
      "content": "43. Savings and tr a nsfer of liabilities, staff, etc. (1) Accordingly, the statutory functions, rights, interests, obligations and liabilities of the Fund or the Management Board, existing before the commencement of this Act under any contract or instrument, or in law or in equity apart from any contract or instrument shall, by virtue of this Act, be deemed to have been assigned to and vested in the Board established by this Act. (2) Any such contract or instrument as is mentioned in subsection (1) of this section, shall be of the same force and effect against or in favour of the Board established by this Act and shall be enforceable as fully and effectively as if instead of the Board existing before the commencement of this Act, the Board established by this Act has been named therein or had been a party thereto. (3) The Board established by this Act shall be subject to all the obligations and liabilities to which the Fund or the Management Board existing before the commencement of this Act was subject immediately before the commencement of this Act and all other persons shall have the same rights, powers and remedies against the Board established by this Act as they had against the Fund or the Management Board existing before the commencement of this Act. (4) Any proceedings or cause of action pending or existing immediately before the commencement of this Act, by or against the Fund or the Management Board existing before the commencement of this Act in respect of any right, interest, obligation or liability of the Fund or the Management Board existing before the commencement of this Act may be continued or as the case may be commenced and any determination of a court of law, tribunal or other authority or person may be enforced by or against the Board established by this Act to the same extent that such proceeding or cause of action or determination might have been continued, commenced or enforced by or against the Fund or the Management Board existing before the commencement of this Act. (5) All assets, funds, resources and other movable or immovable property which immediately before the commencement of this Act, were vested in the Fund or the Man- agement Board existing before the commencement of this Act, shall by virtue of this Act and without further assurance be vested in the Board established by this Act. (6) Any person who immediately before the coming into force of this Act is the holder of any office in the Fund or the Management Board existing before the com- mencement of this Act shall, on the commencement of this Act, continue in office and be deemed to have been appointed to his office by the Board established by this Act unless the authority by which the person was appointed terminates the appointment. 44. Interpretation In this Act, unless the context otherwise requires- \"benefit\" means benefits payable under this Act; \"Board\" means the Nigeria Social Insurance Trust Fund Management Board estab- lished by section 2 of this Act; \"chairman\" means chairman of the Board; \"contribution\" means contribution payable under this Act; \"employee\" means any person who- (a) is employed in Nigeria under any contract of service or apprenticeship with an employer whether the contract is express, implied, oral or in writing; (b) is ordinarily resident in Nigeria and is employed outside Nigeria under such contract of service with an employer in Nigeria by whom he is paid; \"employer\" means the person with whom an employee has entered into a contract of service or apprenticeship and who is responsible for the payment of the wages of the em- ployee and includes the lawful representatives, successors or assigns of such person; \"Fund\" means the Nigeria Social Insurance Trust Fund established by this Act; \"injury\" means a personal injury and includes a contraction of disease; \"Managing Director\" means the person appointed as Managing Director under section 7 of this Act; \"member\" means a member of the Board and includes the chairman; \"Minister\" means the Minister charged with responsibility for matters relating to labour; \"public service of the Federation\" and \"public service of a State\" have the meaning respectively assigned thereto in the Constitution of the Federal Republic of Nigeria 1999; \"wages\" means remuneration in money paid to an employee under this contract of service or apprenticeship as the case may be and whether agreed to be paid at fixed or determined intervals of time- (a) in respect of normal period of work performed by the employee; or (b) where payment is calculated in relation to set tasks, in respect of the number of tasks completed by the employee or where payment is calculated in relation to the volume of work completed by the employee in respect of the volume completed by the employee but does not include any allowance paid by the em- ployer whether in respect of cost of living or otherwise whatsoever; \"work\" includes piece work. 45. Short title This Act may be cited as the Nigeria Social Insurance Trust Fund Act. SCHEDULE [Section 4 (2).] Supplementary provisions relating to the Board Proceedings 1. Subject to this Act and section 27 of the Interpretation Act, the Board may make standing orders regulating the proceedings of the Board or any committee thereof. 2. The Board shall meet at least four times in a year and at such other times as the chairman may, from time to time, determine and in any case, shall not meet more than six times in a year. 3. Every meeting of the Board shall be presided over by the chairman of the Board and if the chairman is unable to attend any particular meeting, a member may be appointed by the members present to act as chairman for that particular meeting. The quorum at any meeting of the Board shall be five members. Where standing orders made under paragraph I of this Schedule provide for the Board to co-opt persons who are not members of the Board, such persons may advise the Board on any matter referred to them by the Board, but shall not be entitled to vote at a meeting of the Board or count towards a quorum. Committees 6. Subject to its standing orders, the Board may appoint such number of standing and ad hoc committees as it thinks fit to consider and report on any matter with which the Board is concerned. 7. Every committee appointed under paragraph 6 of this Schedule shall be presided over by a member of the Board and shall be made up of such number of persons, not necessarily members of the Board, as the Board may determine in each case. 8. The quorum of any committee set up by the Board shall be as may be determined by the Board. 9. Where standing orders made pursuant to paragraph 1 of this Schedule provide for a committee of the Board to consist of or to co-opt persons who are not members of the Board, the committee may advise the Board on any matter referred to it by the Board. 10. A decision of a committee shall be of no effect until it is confirmed by the Board. Miscellaneous 11. The fixing of the seal of the Fund shall be authenticated by the signature of the Managing Director and of any other person authorised in that behalf by the Board. 12. Any contract or instrument which, if made or executed by any person not being a body corporate would not be required to be under seal, may be made or executed on behalf of the Fund by any person generally or specially authorised to act for that purpose by the Board. 13. Any document purporting to be a contract, instrument or other document duly signed or sealed on behalf of Board shall be received in evidence and shall, unless the contrary is proved, be presumed to have been so signed and sealed. 14. The validity of any proceedings of the Board shall not be adversely affected by- (a) any vacancy in the membership of the Board; or (b) any defect in the appointment of a member of the Board; or (c) reason that a person not entitled to do so took part in the proceedings of the Board. SUBSIDIARY LEGISLATION"
    }
  ],
  "definitions": []
}