{
  "id": "nigerian-institute-of-animal-science-act",
  "type": "statute",
  "title": "NIGERIAN INSTITUTE OF ANIMAL SCIENCE ACT",
  "title_en": "NIGERIAN INSTITUTE OF ANIMAL SCIENCE ACT",
  "short_name": "NIGERIAN INSTITUTE OF ANIMAL SCIENCE ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=416",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Establishment of Institute and incorporation",
      "content": "Establishment of Institute and incorporation (1) There is established for the profession of Animal Science, an institute to be known as the Nigerian Institute of Animal Science (in this Act referred to as \"the Institute\"). (2) The Institute shall be a body corporate with perpetual succession and a common seal and shall to sue and be sued in its corporate name and shall have power to own, hold and dispose of property whether movable or immovable."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Functions of Institute",
      "content": "Functions of Institute The functions of the Institute are to- (a) prescribe and regulate the standards of academic qualification and practical skills to be attained by persons seeking to become registered as Members, Associates or Fellows of the Institute, as the case may be; (b) prescribe the code of conduct for Animal Scientists; (c) regulate the practice of the profession for Animal Scientists; (d) establish and maintain a register of Animal Science Practitioners under this Act according to their various ranks and to regulate the prerogatives and privileges pertaining to those ranks; (e) ensure that Animal Science Practitioners in Nigeria uphold the ethics of the profession and guarantee the production of high quality animal proteins; (f) advance the education, science, technology and art of Animal Science and livestock production; (g) promote the production of animals; (h) promote rapid production of high quality animal proteins through scientific methods, and regulate all issues pertaining to animal husbandry in Nigeria; (i) advise and encourage the enactment and the enforcement of laws that will guarantee efficient production and consistent supply of high quality animal proteins to Nigerians; (j) educate the public on Animal Science activities; (k) co-operate or affiliate with any relevant association on animal production either locally or internationally; and (l) establish, update and maintain a Register of Animal Scientists under this Act according to their various ranks and to regulate the prerogatives and privileges pertaining to those ranks. Powers of Institute The Institute shall have power to- (a) establish and promote research facilities and all manner of studies in Animal Science; (b) establish such offices, departments, units and branches of the Institute as may be required for the proper administration and operation of the Institute; (c) subject to such terms and conditions as the Institute may approve, engage staff, agents and other workers as the Institute may from time to time require for the performance of its functions under this Act; (d) establish necessary organisation for the proper and efficient conduct of the affairs of the Institute; (e) provide staff regulations for all staff of the Institute and provide pension and welfare schemes for the staff; and (f) do such other acts and things as may be necessary for the performance of the functions of the Institute. PART II Establishment and Functions of Council Establishment of Council (1) There shall be established for the Institute a Governing Council to be known as the Council of the Nigerian Institute of Animal Science (in this Act referred to as the \"Council\"). (2) The Council shall consist of- (a) the President; (b) the two Vice-Presidents; (c) the Registrar; and (d) fourteen persons who shall be elected by the Institute, respectively to represent each of the following disciplines of Animal Science studies: (i) Animal Bio-technology; (ii) Livestock Economics and Marketing; (iii) Livestock Extension and Information Technology; (iv) Range and Pasture Science; (v) Animal Genetics and Breeding; (vi) Dairy Science; (vii) Poultry Science; (viii) Beef Production Science; (ix) Swine Production Science; (x) Small Ruminant Production Science (xi) Animal Reproductive Physiology and Bio-climatology; (xii) Micro-livestock, Forestry and Wildlife; (xiii) the Feed Milling Industry; (xiv) Livestock Processing and Preservation Technology; (e) the Minister of Agriculture or his representative; (f) the Minister of Education or his representative; (g) the Minister of Environment or his representative; (h) the Minister of Science and Technology or his representative; (i) the Minister of Water Resources or his representative; (j) one representative of the Nigerian Chamber of Commerce, Industry, Mines and Agriculture to be elected by the Chamber; (k) one person to be elected by the Institute to represent agro-allied industries; (l) three persons to be elected by the Institute to represent the various faculties, colleges and universities of Agriculture in Nigeria."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Election of members of Council",
      "content": "Election of members of Council The President, 2 Vice-Presidents and other members of the Council mentioned in paragraphs (c), (i) and (k) of subsection (2) of section 4 of this Act, shall be elected by the Institute from amongst the members, at an annual general meeting of the Institute: Provided that, the first such members, shall be elected at a special general meeting convened by the Animal Science Association of Nigeria immediately after the commencement of this Act, for the purpose of electing them. Tenure of Office (1) The term of Office of a member of the Council other than an ex officio member shall be three years but such member shall at the end of that term be eligible for re- election, for one more term only. (2) The Office of a member of the Council shall become vacant if the member- (a) resigns his Office, by notice under his hand, addressed to the Council; (b) is removed from Office by the Council, by reason of his professional misconduct or physical or mental infirmity; or (c) without leave of the Council, absents himself from 3 consecutive meetings of the Council."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Functions of the Council",
      "content": "7. Functions of the Council The functions of the Council shall be to- (a) carry into effect the functions and powers of the Institute; (b) govern the affairs of the Institute; (c) effect proper management of the Institute; and (d) do other acts and things as the Council may consider necessary for carrying out the functions and powers of the Institute. Funds The funds of the Institute shall consist of- (a) contributions, levies, subscriptions, fees and other dues paid by the members; (b) revenue accruing to the Institute from its investments, activities and services; (c) grants, endowments and donations from Governments, agencies, organisations, benefactors and other donors; (d) revenue accruing to the Institute from any other source approved by the Council. 9. Bank account The funds of the Institute shall be paid into an account in a reputable bank approved by the Council and no instrument for the withdrawal of any money from that account shall be valid unless it is authenticated by the signatures of the President and the Registrar or by the signatures of such officers of the Institute as may from time to time be approved by the Council."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Investment",
      "content": "10. Investment The Institute may from time to time subject to such terms and conditions as the Council may approve, invest any part of its funds in any securities and may at any time dispose of such securities."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Borrowing power",
      "content": "11. Borrowing power The Institute may from time to time, subject to such terms and conditions as the Council may approve, borrow such money as the Council may require for carrying out any of the functions of the Institute. 12. Accounts of the Institute (1) The Institute shall keep and maintain proper accounts of its income and expenditure and shall by the 30th day of September of each year submit such accounts to be audited by any auditor approved by the Accountant-General of the Federation. (2) The audited accounts of the Institute and the auditor's report thereon shall, not later than the 31st day of December of each year, be submitted by the Institute, to the Minister of Agriculture who shall forthwith lay them before each House of the National Assembly. PART III Registrar and Registration 13. Appointment of Registrar (1) There shall be appointed by the Council, a fit and proper person to be the Registrar of the Institute. (2) The Registrar shall, subject to the overall control of the Council- (a) be the Secretary to the Council; (b) keep custody of the Register of the Institute and make such entries in the Register as the Council may from time to time by resolution, direct; (c) keep custody of the common seal of the Institute and affix the same to such documents as the Council may direct; and (d) carry out other duties as the Councilor the President may from time to time direct. 14. Register of Institute The Institute shall keep and maintain a register of all the members including the As- sociates, Fellows and Honorary Fellows."
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Registration of members",
      "content": "15. Registration of members (1) The Institute may subject to the provisions of this Act, and such rules as the Council may make in that regard, admit and register any- (a) person as a registered Member; (b) Member as an Associate; (c) Member of Associate as a Fellow; or (d) person as an Honorary Fellow."
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Registered Members",
      "content": "16. Registered Members A person shall be eligible to be admitted and registered as a Member if that person is- (a) a holder of a first degree or equivalent qualification in Animal Sciences from any accredited institution and has in addition 5 years post graduation or post qualification working experience; (b) a member of any equivalent Animal Science body or Institute, recognised by the Council."
    },
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "Associates",
      "content": "17. Associates A Member shall be eligible to be registered as an Associate if- (a) that Member has contributed significantly either by research efforts, publica- tions and experience in Animal Science, to the growth and development of Animal Science and related areas; and (b) the Council is satisfied that the Member is a fit and proper person to be elevated to the rank of Associate."
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "Fellows",
      "content": "18. Fellows A person who is a Member or Associate shall be eligible to be registered as a Fellow if- (a) that person has by research efforts, publications and experience in any area of Animal Science, contributed significantly to the growth and development of Animal Science or related areas; (b) the Council is satisfied that that person is a fit and proper person to be elevated to the rank of Fellow; (c) the person holds the minimum academic qualification that admits ordinary members."
    },
    {
      "provision_ref": "s19",
      "section": "19",
      "title": "Honorary Fellow",
      "content": "19. Honorary Fellow A person may be registered as an Honorary Fellow if- (a) that person is distinguished in any area of Animal Production or related industry; and (b) the Council is satisfied that the person is a fit and proper person to be elevated to the rank of Honorary Fellow."
    },
    {
      "provision_ref": "s20",
      "section": "20",
      "title": "Certificate and honours",
      "content": "20. Certificate and honours The Council may subject to its rules in that regard award distinctive certificate and other honours to any person, Member, Associate, Fellow or Honorary Fellow as the case may be, for any distinctive honours, achievement in any discipline or area of agriculture. PART IV Accreditation of Animal Science institutions"
    },
    {
      "provision_ref": "s21",
      "section": "21",
      "title": "Accreditation",
      "content": "21. Accreditation (1) Every Faculty, College or University of Agriculture in Nigeria shall on demand by the Council submit to the Council details of its curricula and courses of study in Animal Science and related sciences for the consideration and approval of the Council. (2) The Council shall thereupon, delegate a committee of the Council to evaluate the contents of such curricula and courses and ensure that such curricula and courses sufficiently endow any person pursuing such curricula and courses, with the requisite knowledge, skill and working experience for the practice of the Animal Science profession. (3) The Council shall where such curricula and courses are approved, thereafter by instrument, accredit such Faculty, College or University as the case may be, as a fit and proper institution for the training of prospective members. (4) Subject to this Act a person who has not obtained his first degree or other academic qualification from an accredited institution shall not be eligible to be registered as a Member. PART V Professional Discipline"
    },
    {
      "provision_ref": "s22",
      "section": "22",
      "title": "Professional misconduct",
      "content": "22. Professional misconduct In this Part, \"professional misconduct\" means any conduct considered by the Council to be professional misconduct and includes professional indiscipline, unjust enrichment of any person, abuse of office and corrupt practice in the conduct of a member in the public service."
    },
    {
      "provision_ref": "s23",
      "section": "23",
      "title": "Disciplinary Tribunal",
      "content": "23. Disciplinary Tribunal (1) There shall be established for the Institute, a Disciplinary Tribunal to be known as the Nigerian Institute of Animal Science Disciplinary Tribunal (in this Act referred to as the \"Tribunal\"). (2) The Tribunal shall hear and determine any case of professional misconduct against any Animal Scientist in the discharge of his official duties as a professional Animal Scientist. (3) The Tribunal shall consist of the President and 6 other Members to be appointed by the Council."
    },
    {
      "provision_ref": "s24",
      "section": "24",
      "title": "Investigating Panel",
      "content": "24. Investigating Panel (1) There shall, for the purpose of the proceedings before the Tribunal, be established a panel to be known as the Investigating Panel of the Nigerian Institute of Animal Science (in this act referred to as the \"Panel\"). (2) The Panel shall- (a) conduct preliminary investigations into any allegation of complaint of professional misconduct against any Member, Associate or Fellow of the Institute; and (b) decide whether or not such Member, Associate or Fellow has a case to answer before the Tribunal and where applicable to refer such case to the Tribunal for hearing and determination. (3) The Panel shall consist of a Chairman and 4 other members to be appointed by the Council."
    },
    {
      "provision_ref": "s25",
      "section": "25",
      "title": "Tribunal Rules",
      "content": "25. Tribunal Rules The Council may make rules to regulate the proceedings of the Tribunal and the Investigating Tribunal Rules Panel, but until such rules are made the rules contained in the Schedule to this Act are applicable. [Schedule.]"
    },
    {
      "provision_ref": "s26",
      "section": "26",
      "title": "Penalties",
      "content": "26. Penalties Where- (a) a member is adjudged by the Tribunal to be guilty of professional misconduct; (b) a member is convicted of an offence by any court in Nigeria or elsewhere, having power to sentence an offender to imprisonment (whether or not punishable with imprisonment) and the offence in the opinion of the Tribunal derogates from his membership in the Institute; or (c) the Tribunal is satisfied that any person has been fraudulently registered in the Register of Members,the Tribunal shall give directions to the Registrar either to reprimand that Member or to strike that Member's name off the Register and the Registrar shall comply with such directions. PART VI Meetings"
    },
    {
      "provision_ref": "s27",
      "section": "27",
      "title": "Convening of Council meetings",
      "content": "27. Convening of Council meetings The Council shall hold not less than 4 Council meetings every year, but the President shall upon the requisition of not less than 5 members convene an emergency Council meeting to transact the business specified in the notice of that emergency Council meeting."
    },
    {
      "provision_ref": "s28",
      "section": "28",
      "title": "President at Council meetings",
      "content": "28. President at Council meetings The President shall preside at any meeting of the Council, and in the absence of the President, the First Vice-President shall preside and in the absence of both the President and the First Vice-President, the Second Vice-President shall preside and where he is also not available, members of the Council present shall elect one of their number to pre- side at such a meeting."
    },
    {
      "provision_ref": "s29",
      "section": "29",
      "title": "Validity of proceedings",
      "content": "29. Validity of proceedings The proceedings of the Council shall not be affected by the absence of any member of the Council or any defect in the election or appointment of any member or by reason that a person not entitled so to do, has taken part in such proceedings."
    },
    {
      "provision_ref": "s30",
      "section": "30",
      "title": "Standing orders",
      "content": "30. Standing orders The Council may make standing orders to regulate its proceedings and those of any of its committees."
    },
    {
      "provision_ref": "s31",
      "section": "31",
      "title": "Annual general meeting of Institute",
      "content": "31. Annual general meeting of Institute (l ) The Institute shall every year hold an annual general meeting of the Members. (2) The President shall preside at any annual general meeting of the Institute; and in the absence of the President, the First Vice-President shall preside, and in the absence of the First Vice-President, the Second Vice-President shall preside and where both the President and the 2 Vice-Presidents are absent, the members present shall elect one of their number to preside at such meeting. PART VII Miscellaneous"
    },
    {
      "provision_ref": "s32",
      "section": "32",
      "title": "Regulations",
      "content": "32. Regulations (1) The Council may make regulations to carry into effect any of the provisions of this Act. (2) Without prejudice to subsection (1), the Council may make regulations to- (a) prescribe the fees, dues and subscriptions payable by the members; (b) prescribe the forms of the licences and certificates, to be issued to Animal Scientists; (c) prescribe the date, procedure and agenda of the annual general meeting of the Institute; and (d) specify the Offices and duties of the officers of the Institute."
    },
    {
      "provision_ref": "s33",
      "section": "33",
      "title": "Interpretation",
      "content": "33. Interpretation In this Act- \"Council\" means Council established by section 4; \"Institute\" means Nigerian Institute of Animal Science established by section 1; \"Institution\" means Faculty, College or University of Agriculture; \"Member\" means member of the Institute and includes an Associate and a Fellow of the Institute; \" President\" means President of the Institute; \" rank\" means status of members, Associates or Fellows; \"Register\" means Register created and maintained under section 14; \"Tribunal\" means Tribunal established under section 23; \"First Vice-President\" means First Vice-President of the Institute; \"Second Vice-President\" means Second Vice-President of the Institute."
    },
    {
      "provision_ref": "s34",
      "section": "34",
      "title": "Short title",
      "content": "34. Short title This Act may be cited as the Nigerian Institute of Animal Science Act, 2007. SCHEDULE Nigerian Institute of Animal Science Disciplinary Tribunal Rules [Section 25.] Proceedings before the Tribunal 1 . Parties (1) The parties to any proceedings of the Tribunal shall be- (a) the complainant (b) the respondent; and (c) any other person required by the Tribunal to be joined, or joined by leave of the Tribunal. (2) Subject to subparagraph (3) of this rule, parties to the proceedings may enter an appearance in person, or by their respective legal practitioners acting as counsel. (3) The Tribunal may require the attendance of the complainant or respondent in person if that is necessary in the interest of justice. 2. Notice of bearing (1) When a complaint is referred by the Panel to the Tribunal, the Registrar shall, after consultation with the Chairman, appoint a time and place for the hearing; and shall in the form in the Schedule hereto, give notice to all interested parties (including members of the Tribunal and the assessor) as directed or required by the Chairman. (2) If directions are for any reason not so given, it shall be sufficient compliance with this rule if the notice is- (a) handed to the party concerned or affected, personally; or (b) sent by registered post to the last known place of abode of the party."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Hearing in absence of parties",
      "content": "3. Hearing in absence of parties (1) Subject to subparagraph (2) of this rule, the Tribunal may hear and determine a case in the absence of any party. (2) Any party to any proceeding before a Tribunal who fails to appear or be represented may apply within one month after the date when the pronouncement of the findings and directions of the Tribunal were given, for a rehearing on the ground of want of notice or other good and sufficient reason; and the Tribunal, in appropriate cases may grant the application upon such terms as to costs or otherwise as it thinks fit."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Hearing of witnesses",
      "content": "4. Hearing of witnesses The Tribunal may in the course of its proceedings hear witnesses and perceive any documentary evidence necessary in its opinion to assist it in arriving at a conclusion as to the truth or otherwise of the allegation of misconduct in the complaint referred to it by the Panel; and in the application of this rule, the provisions of the Evidence Act shall apply to any such proceedings. 5. Amendment of complaint If in the course of the proceedings it appears to the Tribunal that the complaint before it requires to be amended in any respect, the Tribunal may, on such terms as it thinks fit, allow the amendment to be made and the complaint as amended shall thereupon be dealt within accordingly."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Proceedings to be in public",
      "content": "6. Proceedings to be in public The proceedings of the Tribunal shall be held, and its findings and directions shall be delivered, in public unless otherwise directed by the Tribunal. 7. Adjustment The Tribunal may, on its own motion, or upon the application of any party, adjourn the hearing, on such terms as to costs or otherwise as the Tribunal thinks fit."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "False evidence",
      "content": "8. False evidence If any person willfully gives false evidence on oath before the Tribunal during the course of any proceedings, or willfully makes a false statement in any affidavit sworn to for the purpose of such proceedings, the Tribunal may refer the matter to the Attorney-General of the Federation for such action as the Attorney-General may think fit."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Finding and costs in certain cases",
      "content": "9. Finding and costs in certain cases If after the hearing, the Tribunal adjudges that the charge of professional misconduct has not been proved, the Tribunal- (a) shall record the findings that the respondent is not guilty of such misconduct in respect of which the charge was preferred; and (b) may, nevertheless order any party (except the complainant) to pay the costs of the proceedings, having regard to his conduct and to all the circumstances of the case. 10. Publication of finding Any finding made or direction given by the Tribunal shall be published in the Federal Gazette immediately after such finding or direction, as the case may be. 11. Record of proceedings The Chairman shall during the hearing, take the minutes of the proceedings which shall be open to inspection by the parties and shall be made available to any party upon the payment of such charges as the Registrar may by instrument published in the Federal Gazette, fix."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Miscellaneous powers of Tribunal",
      "content": "Miscellaneous powers of Tribunal The Tribunal may dispense with any requirements of these rules regarding notices, affidavits, documents, service or time for doing or omitting any thing, in any case where it appears to the Tribunal to be just or expedient so to do; and the Tribunal may in any particular case extend the time for doing anything under these rules."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Powers to retain exhibit pending appeal",
      "content": "Powers to retain exhibit pending appeal Books and other exhibits whatsoever produced or used at the hearing shall, unless the Tribunal otherwise directs, be retained by the Registrar until the expiry of the time for filing an appeal against any finding or direction of the Tribunal or, if notice of any such appeal is given, until the hearing and disposal of the appeal."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Appointment and duties of Assessors",
      "content": "Appointment and duties of Assessors (1) An Assessor, shall be appointed by the Council by instrument, and the assessor shall hold and vacate Office as provided in his instrument of appointment, and where the appointment is not a general one, it shall have effect only in respect of a particular proceeding of the Tribunal. (2) Subject to the terms of his appointment, an Assessor shall attend the proceedings of the Tribunal whenever required to do so by notice in writing given to him by the Registrar not later than 3 days, before the date fixed for the hearing of such proceedings; and he shall advise the Tribunal on questions of law only. Miscellaneous 5. Interpretation In these Rules \"complainant\" means a person or body appearing before the Tribunal, professional mis- conduct against a member of the Institute; \"respondent\" means the person required to answer to any charge of professional misconduct. 16. Short Title These rules may be cited as the Nigerian Institute of Animal Science (Disciplinary Tri- bunal) Rules. SUBSIDIARY LEGISLATION No Subsidiary Legislation"
    }
  ],
  "definitions": [
    {
      "term": "Council",
      "definition": "Council established by section 4",
      "source_provision": "s33"
    },
    {
      "term": "Institute",
      "definition": "Nigerian Institute of Animal Science established by section 1",
      "source_provision": "s33"
    },
    {
      "term": "Institution",
      "definition": "Faculty, College or University of Agriculture",
      "source_provision": "s33"
    },
    {
      "term": "Member",
      "definition": "member of the Institute and includes an Associate and a Fellow of the Institute",
      "source_provision": "s33"
    },
    {
      "term": "President",
      "definition": "President of the Institute",
      "source_provision": "s33"
    },
    {
      "term": "rank",
      "definition": "status of members, Associates or Fellows",
      "source_provision": "s33"
    },
    {
      "term": "Register",
      "definition": "Register created and maintained under section 14",
      "source_provision": "s33"
    },
    {
      "term": "Tribunal",
      "definition": "Tribunal established under section 23",
      "source_provision": "s33"
    },
    {
      "term": "First Vice-President",
      "definition": "First Vice-President of the Institute",
      "source_provision": "s33"
    },
    {
      "term": "Second Vice-President",
      "definition": "Second Vice-President of the Institute",
      "source_provision": "s33"
    }
  ]
}