{
  "id": "nigerian-communications-act",
  "type": "statute",
  "title": "NIGERIAN COMMUNICATIONS ACT",
  "title_en": "NIGERIAN COMMUNICATIONS ACT",
  "short_name": "NIGERIAN COMMUNICATIONS ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=355",
  "provisions": [
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Executive Commissioners",
      "content": "13. Executive Commissioners The Executive Commissioners shall be persons possessing sound knowledge of and ability in the organisation and management of communications regulatory matters and subject to section 8 (4) of this Act, they shall hold office for a term of five years and may be renewed for another term and no more."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Commission",
      "content": "14. Commission Se cretary (1) There shall be appointed by the Board, for the Commission a secretary who shall not be a Commissioner but shall possess relevant and adequate professional qualifications, with not less than ten years post-qualification, experience. (2) The Secretary shall keep the corporate records of the Commission and perform such other duties and functions as the Chairman or the Chief Executive may, from time to time, direct. 15 . S taff of the C o mmission (I) The Commission shall have powers to appoint such number of other persons as it deems necessary as staff of the Commission. (2) The employment of the Commission's staff, including the Secretary, shall be subject to such terms and conditions as may, from time to time, be stipulated by the Board and contained in the respective staffs employment contracts."
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Condition",
      "content": "16. Condition s of s ervice (1) The Commission shall develop and implement appropriate staff conditions of service for its staff with particular regard to the issues of remuneration, pensions scheme and other fringe service benefits, sufficient for the Commission to attract and retain quality and high calibre manpower (2) The Board shall consider and, in consultation with the National Salaries, Incomes and Wages Commission determine and review from time to time, the remunerations and allowances, payable to the Commission's staff. (3) The conflict of interest provisions contained in the Second Schedule to this Act shall apply to all employees of the Commission. [Second Schedule.] (4) Notwithstanding the provisions of the Pensions Act, service in the Commission shall be approved service for the purposes of that Act and accordingly, officers and other persons employed in the Commission shall in respect of their services in the Commission, be entitled to pensions, gratuities and other retirement benefits as are enjoyed by persons holding equivalent grades in the Civil Service of the Federation, so however that nothing in this Act shall prevent the appointment of a person to any office on terms which preclude the grant of pension and gratuity in respect of that office. [L.F.N. 2004 Cap. P4.] (5) For the purposes of the application of the Pensions Act, any power exercisable thereunder by a Minister or other Authority of the Federal Government, other than the power to make regulations under section 23 thereof, is hereby vested in and shall be exercisable by the Commission and not by any other person or authority. PART IV Finan c i a l Provi s ion s 17. Fund of the Commission (1) The Commission shall establish and maintain a fund from which all expenditures incurred by the Commission shall be defrayed. (2) The Fund shall comprise funds derived from but not limited to the following sources- (a) such monies as may be appropriated to the Commission from time to time by the National Assembly; (b) subject to subsection (3) of this section, fees charged by the Commission under this Act or its subsidiary legislation or under any licence issued pursuant to this Act; (c) gifts, loans, grants, aids, etc.; and (d) all other assets that may, from time to time, accrue to the Commission. (3) The Commission shall pay all monies accruing from the sale of spectrum under Part I of Chapter VIII into the Consolidated Revenue Fund. 18. Borrowing powers, gifts, etc. (I) The Commission may, with the consent of, or in accordance with the general authority given by the Minister of Finance, borrow such sums of money as the Commission may require in the exercise of its functions under this Act or its subsidiary legislation. (2) The Commission may accept gifts or grants of money or aids or other property from national, bilateral and multi-lateral organisations and upon such terms and conditions, if any, as may be agreed upon between the donor and the Commission provided that such gifts are not inconsistent with the objectives and functions of the Commission under this Act. 19. Budget and expenditure (I) The Commission shal\\ not later than 30th September in each financial year prepare and present to the National Assembly through the President for approval, a statement of estimated income and expenditure for the following financial year. (2) Notwithstanding the provisions of subsection (1), the Commission may also, in any financial year, submit supplementary or adjusted statements of estimated income and expenditure to the National Assembly through the President for approval. (3) Subject to subsections (I) and (2) of this section, the Commission shall apply the proceeds of the Commission's Fund- (a) to meet the administrative and operating costs of the Commission; (b) for the payment of salaries, wages, fees and other allowances, retiring benefits such as pensions and gratuities and, any other remunerations payable to the Commissioners and staff of the Commission; (c) for the purchase or acquisition of property or other equipment and other capital expenditure and for maintenance of any property acquired or vested in the Commission; (d) for purposes of investment; and (e) for or in connection with al\\ or any of the functions of the Commission under this Act or its subsidiary legislation. 20. Financial year and audit of Commission's accounts (I) The financial year of the Commission shall start on 1st January of each year and end on 31 st December of the same year. (2) The Commission shall keep proper records of its accounts in respect of each year and shall cause its accounts to be audited within six months from the end of each financial year by auditors whose appointment shall be approved by the Board and shall be subject to reappointment on annual basis: Provided that such auditors are on the list of auditors approved from time to time by the Auditor-General for the Federation. 21. Annual reports for the National Assembly (I) The Commission shall prepare and submit to the National Assembly annual\\y, through the President, not later than six months after the end of its financial year, a report on the activities of the Commission for the preceding financial year and shall include therein the Commission's audited accounts for the year under review together with the auditor's report thereon. (2) The Commission's report under subsection (1) of this section shall have as an attachment thereto the report specified in section 89 of this Act. 22. Exemption from taxation The provisions of any enactment relating to the taxation of companies or trust funds shall not apply to the Commission. CHAPTER III Functions of the Minister and National Frequency Management Council PART I Functions of the Minister 23. Functions of the Minister The Minister shall have the following responsibilities and functions pursuant to this Act- (a) the formulation, determination and monitoring, of the general policy for the communications sector in Nigeria with a view to ensuring, amongst others, the utilisation of the sector as a platform for the economic and social development of Nigeria; (b) the negotiation and execution of international communications treaties and agreements, on behalf of Nigeria, between sovereign countries and international organisations and bodies; and (c) the representation of Nigeria in conjunction with the Commission, at proceedings of international organisations and fora on matters relating to communications. 24. Formulation of policy (1) Prior to the formulation or review of the general policy for the Nigerian communications sector, the Minister shall cause the Commission on his behalf to first carry out a public consultative process on the proposed policy formulation or modification. (2) In formulating and determining the policy or amendments thereto, the Minister and the Council shall take into consideration the findings of the consultative process under subsection (1) of this section. 25. Relationship with the Commission (I) Subject to subsection (2) of this section, the Minister shall, in writing, from time to time notifying the Commission of and express his views on the general policy direction of the Federal Government in respect of the communications sector. (2) In the execution of his functions and relationship with the Commission, the Minister shall at all times ensure that the independence of the Commission, in regard to the discharge of its functions and operations under this Act, is protected and not compromised in any manner whatsoever. PART II National Frequency Management Council 26. Establishment of National Frequency Management Council There is established in the Ministry a National Frequency Management Council (NFM) (in this Act referred to as \"the Council\") with membership and functions as set out in this Act. 27. Membership of National Frequency Management Council (1) The membership of the Council shall be made up of- (a) a chairman who shall be the Minister; (b) one repres"
    },
    {
      "provision_ref": "s105",
      "section": "105",
      "title": "Resolution of consumer d",
      "content": "105. Resolution of consumer d i sputes (I) The Commission may use any of its powers under this Act in the resolution of complaints received from consumers in relation to matters of customer service and consumer protection including but not limited to quality of service or the failure by a licensee to comply with a consumer code prepared under this Chapter. (2) The Commission shall establish procedures or guidelines for the making, receipt and handling of complaints of consumers regarding the conduct or operation of licensees and may, at its discretion, institute alternative dispute resolution processes for the resolution of the complaints or disputes: Provided that the licensee's dispute resolution procedures shall first have been exhausted by the consumer without resolution of the complaint before presentation of the complaint to the Commission."
    },
    {
      "provision_ref": "s106",
      "section": "106",
      "title": "Consumer",
      "content": "106. Consumer code (1) Subject to the provisions of subsection (2) of this section, the Commission may designate an industry body to be a consumer forum and to prepare a consumer code for the purposes of this Chapter and the consumer code prepared by such industry body shall be subject to the prior approval of and ratification by the Commission. (2) Without prejudice to the provisions of subsection (I) of this section, the Commission may require licensees to prepare individual consumer code for their respective customers and such consumer code shall be subject to the prior approval of and ratification by the Commission. (3) A consumer code prepared by a consumer forum, the Commission or licensee shall model procedures for- (a) reasonably meeting consumer requirements; (b) the handling of customer complaints and disputes including an inexpensive arbitration process other than a court, and procedures for the compensation of customers in case of a breach of a consumers code; and (c) the protection of consumer information. (4) Other matters which the consumer code shall address include but are not limited in (a) further recourse available to a consumer who is dissatisfied with the licensee's complaints-handling procedures together with specific details of compensation and refund schemes offered by the licensee to its customers; (b) the provision of information to customers regarding services, rates and performance; ( c ) the provisioning of fault repair services; (d) the advertising or representation of services; (e) customer charging, billing, collection and credit practices; and (f) any other matter which, in the opinion of the Commission, may be of concern to customers. (5) After the preparation of a consumer code and subsequent ratification by the Commission, the consumer code shall be published by the licensee and the Commission and notice of it shall be advertised in at least one national daily newspaper. (6) A consumer code prepared pursuant to this Chapter shall be subject to annual review and ratification by the Commission prior to publication by the licensee and the Commission. PART II R e quired Applications S e rvices 107. Required applications services (1) For the purposes of this Chapter, the Commission may determine a list of required applications services. (2) The list referred to in subsection (I) of this section may include but is not limited to- (a) emergency services (including access to controlled network facilities and net- work services for the purposes of providing emergency services); (b) directory assistance services (including access to controlled network facilities, network services and relevant databases); (c) operator assistance services; and (d) services for disabled consumers. (3) The Commission shall, in specific regard to emergency services, take immediate steps upon the commencement of this Act to- (a) promote and enhance public safety through the use of a particular number which shall be designated as the universal safety and emergency assistance number for telephone services generally; and (b) encourage and facilitate the prompt deployment throughout Nigeria of a seamless, ubiquitous and reliable end-to-end infrastructure for emergency communications needs. (4) The Commission may determine the classes of network service providers who shall provide any or all of the applications services on the list of required applications services and shall direct them to provide the required applications services. (5) Notwithstanding any provision to the contrary in this Act or any instrument made, issued or given under this Act, a direction by the Commission issued under subsection (3) of this section may provide for or specify operational details relating to a required applications service. PART III Tariff Rat e R e gulation 108. Approval of tariffs and charges by Commission (I) Holders of individual licences shall not impose any tariff or charges for the provision of any service until the Commission has approved such tariff rates and charges except as otherwise provided in this Part. (2) The licensees specified in subsection (1) of this section shall provided services at the tariff rates and charges so approved by the Commission and shall not depart there- from without prior written approval by the Commission of such proposed changes in tariff rates and charges. (3) All licensees mentioned in subsection (1) of this section shall publish the tariff rates charged to customers for their respective services and the modifications thereto as may be approved, from time to time, by the Commission. (4) The tariff rates established by a licensee mentioned in subsection (1) of this section shall be on the basis of such principles as the Commission may, from time to time, stipulate in its guidelines or regulation including the following- (a) tariff rates shall be fair and, for similarly situated persons, not discriminatory; (b) tariff rates shall be cost-oriented and, in general, cross-subsidies shall be eliminated; (c) tariff rates shall not contain discounts that unreasonably prejudice the competitive opportunities of other providers; (d) tariff rates shall be structured and levels set to attract investments into the communications industry; and (e) tariff rates shall take account of the regulations and recommendations of the international organisations of which Nigeria is a member. 109. Exemption Notwithstanding the provisions of section 108 of this Act, the Commission may intervene in such manner as it deems appropriate in determining and setting the tariff rates for any non-competitive services provided by a provider mentioned in section 108 (1) of this Act for good cause or as the public interest may require. no. Tariff rates, rules and regulations (1) The Commission may, from time to time, make rules or regulations on determination and publication of tariff rates for respective services by the licensees specified in section 108 (1) of this Act. (2) The regulations and rules which may be made by the Commission under subsection (1) of this section may include but are not limited to- (a) rules about the tariff rates and charges and variations of rates for specified or classes of services; (b) rules about the publication or disclosure of tariff rates for specified or classes of services; or (c) tariff rate models that may be applicable to specified licensees or classes of licensees or specified or classes of services. 111. Penalty for operating unapproved tariffs, charges, etc. Notwithstanding any other provision of this Act, the Commission shall prescribe and enforce appropriate financial penalties upon any holder of an individual licence who exceeds the tariff rates duly approved by the Commission for the provision of any of its services. PART IV Universal Service Provision 112. Universal Service Provision (I) Subject to subsection (2) of this section, the Commission shall consider, design and determine a system (Universal Service Provision) (USP)which shall promote the widespread availability and usage of network services and applications services throughout Nigeria by encouraging the installation of network facilities and the provision for network services and applications services to institutions and in unserved, underserved areas or for and underserved groups within the community. (2) No universal service provision organ that is created under this Part or pursuant to this Act or its subsidiary legislation shall be or constitute itself howsoever into a communications service provider. (3) The Commission may make regulations under Part VI of Chapter V for the implementation of subsection (I) of this section. 113. Unserved areas, underserved areas, and underserved groups (I) A determination by the Commission under section 112 (I) of this Act shall include definitions of \"institutions\", \"unserved\", \"underserved areas\" and \"underserved groups within a community\". (2) In determining the definition of \"unserved\" and \"underserved areas\", "
    },
    {
      "provision_ref": "s124",
      "section": "124",
      "title": "National frequency plan",
      "content": "124. National frequency plan (I) Subject to subsection (2) of this section, the Commission in consultation with and on behalf of the NFM Council shall develop a national frequency plan in respect of any part or all of the spectrum. (2) The Commission shall, in developing the national frequency plan, work and liaise with the different users of spectrum in Nigeria including the military, law enforcement and security agencies, maritime and civil aviation authorities. (3) A national frequency plan shall define how the spectrum shall be used and defme the methodology for assignment and reassignment of the spectrum. (4) The Commission, in exercising the functions under subsections (1), (2) and (3) of this section shall take into account- (a) the objects of this Act; (b) the impact of the national frequency plan on existing spectrum users; and (c) any applicable international standards, conventions and agreements including but not limited to International Telecommunications Union and its radio regulations as agreed to and adopted by Nigeria. (5) Subject to the payment of such fees as the Commission may, from time to time, prescribe, the Commission shall, upon application, provide to persons with a need to know, copies of the national frequency plan or such parts of it as do not compromise or prejudice national security. 125. Frequency licence (I) Subject to the payment of such fees as the Commission may from time to time prescribe, the Commission may issue or renew a frequency licence upon such conditions as the Commission may impose, which confers rights on a person- (a) to use one or more specified frequency bands for any purpose consistent with the assignment conditions; or (b) to use the spectrum to operate a network facility of a specified kind at a specified frequency or in any specified frequency band or bands. (2) A frequency licence may be issued under this section only- (a) if it is consistent with the national frequency plan; and (b) when the Commission has determined under section 124 of this Act the relevant frequency bands for spectrum assignment. (3) The re-issuance of a spectrum assignment to an existing or new licence holder shall at all times conform to the provisions of subsection (2) of this section. 126. Compulsory acquisition of spectrum assignment (I) The Commission may compulsorily acquire assignments in a determined spectrum- (a) in accordance with a reassignment of spectrum policy consistent with the national frequency plan; or (b) in the national interest. (2) The Commission may pay a reasonable amount of compensation to the holder of an assignment whose assignment has been acquired by a direction made under this section, prior to its expiry. 127. Forfeiture of spectrum assignment (1) A person who fails to-- (a) utilise his assigned spectrum as at such deadline as the Commission may specify in his frequency licence or assigned document; or (b) renew his frequency licence as at when due,may, at the Commission's discretion, forfeit his spectrum assignment and in the event of a forfeiture, the same shall revert to the Commission and become available for reassignment. (2) No compensation shall be paid to a licensee who has forfeited his spectrum assignment under subsection (I) of this section. PART II Numbering and Electronic Addressing"
    },
    {
      "provision_ref": "s128",
      "section": "128",
      "title": "Administrat",
      "content": "128. Administrat i on and planning of numbering, electronic addressing (1) The Commission shall solely and exclusively be vested with the control, planning, administration, management and assignment of the numbering and electronic addressing of network services and applications services. (2) The Commission shall develop a numbering and electronic addressing plan for the numbering and electronic addressing of network services and applications services taking into account the subsisting numbering plan prior to the commencement date of this Act. (3) The numbering and electronic addressing plan may set out rules which include- (a) the use of different numbers and electronic addresses for different kinds of services; (b) the assignment of numbers and electronic addresses; (c) the transfer of assigned numbers and addresses; (d) the use of assigned numbers and electronic addresses; (e) the portability of assigned numbers and electronic addresses; (f) the requirements for network service providers and applications service providers to maintain a plan for assigning and reassigning numbers and electronic addresses; and (g) the fees for the assignment and transfer of numbers and electronic addresses which may be determined by the Commission. (4) The Commission shall make the numbering and electronic addressing plan available to the public for a fee to be decided by the Commission."
    },
    {
      "provision_ref": "s129",
      "section": "129",
      "title": "Delegation",
      "content": "129. Delegation o f responsibility (1) The Commission may delegate any or all of its functions under this Chapter to a person if it so wishes. (2) Without prejudice to the generality of subsection (1) of this section, the Commis- sion may appoint a specified person or organisation to manage or maintain an integrated public number database or an integrated electronic address database. (3) The Commission or a person or organisation specified under subsection (2) shall provide non-discriminatory commercial access to the database on the same terms and conditions which it offers to itself. (4) The Commission may direct a person specified under subsection (2) of this section regarding the manner in which he shall discharge his obligation under subsection (3) of this section. PART IlI Technical Standards 130. Technical code and specification (1) Subject to subsection (2) of this section, the Commission shall specify and publish to the general public, technical code and specifications in respect of communications equipment and facilities that may be used in Nigeria. (2) The technical code and specifications prepared by the Commission under this section shall include- (a) requirements for network inter-operability, including the provision of certain network capabilities such as calling line identification capability and pre- selection capability; (b) the promotion of safety of network facilities; (c) the provision of network facilities or services, including requirements for qualified providers and installers; (d) the provision of customer equipment and cabling, including requirements for qualified installers; (e) the approval of customer equipment and other access devices; and (f) the adoption of technical standards promulgated by international bodies. (3) Prior to specifying and publishing any technical code and specifications under this Act, the Commission shall first conduct an inquiry in the manner specified in Part II of Chapter V on the proposed code or specification provided that such prior inquiry may not be required in regard to technical code or specifications that are mandatorily prescribed by international organisations to which Nigeria belongs such as the International Telecommunications Union (ITU). (4) In making the technical code and specifications, the Commission shall take into consideration the findings of the inquiry under subsection (3) of this section. 131 . Offences (I) A person who uses any technical equipment or systems which hinder network inter-operability, commits an offence and on conviction, is liable to a fine not exceeding N I 00,000.00 or to imprisonment for a term not exceeding one year or to both such fine and imprisonment. (2) A person who uses any technical equipment or systems which compromise public safety as defined from time to time by the Commission, commits an offence and on conviction, be liable to a fine not exceeding N I 00,000.00 or to imprisonment for a term not exceeding 1 (one) year or to both such fine and imprisonment. 132. Type approval (1) The Commission shall, at the instance of licensed service providers, equipment manufactures or suppliers, conduct type approval tests and issue certificates therefor in respect of communications equipment and facilities to be used in Nigeria. (2) Licensed service or facilities providers, equipment manufacturers or suppliers shall obtain type approval certificates from the Commission in respect of their communications equipment or facilities prior to installation or sale in Nigeria. (3) The Communications shall, in conducting type approval of equipment or facilities, be guided by the technical code and specifications formulated by the Commission under section 130 of this Act. 133. Type approval offences, etc. (1) A person who sells or installs any communications equipment or facilities without first obtaining the Commission's type approval test certificate therefor commits an offence and on conviction, is liable to a fine not exceeding N I 00,000.00 or to imprisonment for a term not exceeding one year or to both such fine and imprisonment. (2) Notwithstanding the provisions of subsection (1) of this section, a licensee who installs or sells any communications equipment or facilities without first obtaining the Commission's type approval test certificate therefor is liable to a fine to the Commission in such amount as the Commission may determine. 134. Regulations The Commission may make regulations in regard to the provisions of this Part pursuant to Part VI of Chapter V and may charge such fees as it deems reasonable for carrying out its type approval functions. CHAPTER IX G e ne r al PART I In s tall a t ion of Netwo rk Fa c iliti es, Access t o N e t wor k F ac ili tie s , etc . 135. Required approval for network installations, etc. Licensees under this Act may require approvals of the State Government, Local Government or other relevant authority for installation, placing, laying or maintenance of any network facilities on, through, under or across any land and it shall be the responsibility of such licensees to obtain such approvals. 136. Duty care (1) A licensee shall, in installing its network facilities, take all reasonable steps to ensure that he causes as little detriment and inconvenience, and does as little damage, as is practicable. (2) If a licensee engages in an activity under this Part in relation to any land, the provider shall take all reasonable steps to restore the land to a condition that is similar to its condition before the activity began. (3) All licensees shall, in connection with the installation of their respective network facilities, take all reasonable steps to- (a) act in accordance with good engineering practice ( b) protect the safety of persons and property; (c) ensure that the activity interferes as little as practicable with- (i) the operations of a public utility; (ii) public roads and paths; (iii) the movement of traffic; and (iv) the use of land; and (d) protect the environment. (4) All licensees shall take all reasonable efforts to enter into respective agreements with public utilities that make provision for the manner in which the licensees will engage in activities that are- (a) covered by this Part; and (b) likely to affect the operation of the utility. 137. Access to network facilities (I) Notwithstanding the provisions of any other written law, a licensee shall provide another licensee with non-discriminatory access to any post, network facilities or right- of-way owned or controlled by him. (2) Notwithstanding the provisions of subsection (I) of this section, a licensee may deny any other licensee access to his post network facilities or right-of-way on a non- discriminatory basis where there is insufficient capacity, or for reasons of safety, security, reliability, or difficulty of a technical or engineering nature. (3) The Commission shall, in the event of a dispute between licensees in respect of the provisions of subsections (I) and (2) of this section, at the instance of any or all of the parties, intervene and make a binding ruling thereon. . (4) The Commission may regulate the rates, terms and conditions for access to any post, network facilities or right-of-way and provide that such rates, terms and conditions are just and reasonable and may adopt procedures necessary and appropriate to hear and resolve disputes in accordance with Part VII of Chapter V. (5) Nothing in this section shall be construed to apply to or to give the Commission jurisdiction with respect to access to any posts, network facilities or right-of-way where a State Authority, local authority or other authority regulates such matters. PART II Jurisdi c tion, Offenc es, Power s of Entr y, e t c. 138. Competent Court The Federal High Court shall have exclusive jurisdiction over all matters, suits and cases howsoever arising out of or pursuant to or consequent upon this Act or its subsidiary legislation and all references to \"Court\" or \"Judge\" in thi"
    },
    {
      "provision_ref": "s20",
      "section": "20",
      "title": "Citation",
      "content": "20. Citation These Regulations may be cited as the Telecommunications Networks Interconnec- tion Regulations, 2003. SCHEDULE List of Issues to b e covered in the Telecommunications Int e rconnection A greements [Regulation 3 (4).] I. Description of interconnection services to be provided. Terms of payment, including procedures. Points of interconnection and interconnection facilities. Technical standards for interconnection. Tests on inter-operability. Measures to comply with essential requirements. Intellectual property rights. Interconnection charges and their evolution over time. Dispute resolution procedure between parties before requesting for the intervention of the Commission. Procedures for alterations being proposed to the telecommunications network or service offerings of one of the parties. Achievement of equal access. Provision of facility sharing, including collocation. Access to ancillary, supplementary and advanced services. Traffic and network management. Operational and maintenance procedures. Maintenance of end-to-end quality of interconnection services. Confidentiality of non-public parts of the agreements. Publication and access to interconnection agreements. Duration and renegotiation of agreements. Termination procedures. Definition and limitation of liability and indemnity. Forc e majeure situation. Assignment of agreement. Training of staff. Any other general contract terms and conditions (applicable laws, regulatory approvals, legal interpretation). Any other terms and conditions as may be agreed upon, from time to time, by the parties."
    }
  ],
  "definitions": []
}