{
  "id": "nigerian-atomic-energy-commission-act",
  "type": "statute",
  "title": "NIGERIAN ATOMIC ENERGY COMMISSION ACT",
  "title_en": "NIGERIAN ATOMIC ENERGY COMMISSION ACT",
  "short_name": "NIGERIAN ATOMIC ENERGY COMMISSION ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=350",
  "provisions": [
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "",
      "content": "Section 4 (3).] S uppl e m e ntar y provi s i o ns relating to th e pr o ceedin g s o f the Co mmi ss io n Proceedings 1. Subject to this Act and to"
    },
    {
      "provision_ref": "s27",
      "section": "27",
      "title": "",
      "content": "section 27 of the Interpretation Act (which provides for decisions of a statutory body to be taken by a majority of its members and for the chairman to have a second or casting vote) the Commission may make standing orders regulating the proceedings of the Commission or any committee thereof. 2. Every meeting of the Commission shall be presided over by the chairman or, if the chairman is unable to attend any particular meeting, by another member appointed by the Presi- dent, to act as chairman for that particular meeting. 3. The quorum at a meeting of the Commission shall be the chairman (or, in an appropriate case, the person appointed to act as chairman under paragraph 2 of this Schedule) and three other members. 4. (1) Subject to its standing orders, the Commission may appoint committees as the Commission may think fit to consider and report on any matter with which the Commission is con- cerned. (2) Except with the approval of the President, a committee of the Commission shall not include persons who are not members of the Commission. 5. Without prejudice to paragraph 4 of this Schedule, where standing orders made under paragraph 1 of this Schedule provide for a committee of the Commission to consist of or co- opt persons who are not members of the Commission, the committee may advise the Commission on any matter referred to it by the Commission, but members of the committee who are not members of the Commission shall not be entitled to vote at a meeting of the committee. Mis ce llaneous 6. The fixing of the seal of the Commission shall be authenticated by the signature of the chairman or of any other member authorised in that behalf by the Commission. 7. Any contract or instrument which, if made or executed by a person not being a body corporate would not be required to be under seal, may be made or executed on behalf of the Commission by any person generally or specially authorised to act for that purpose by the Commission. 8. Any document purporting to be a contract, instrument or other document duly signed or sealed on behalf of the Commission shall be received in evidence and, unless the contrary is proved, be presumed without further proof to have been so signed or sealed. 9. The validity of any proceedings of the Commission or a committee thereof shall not be affected- ( a ) by any vacancy in the membership of the Commission or committee; (b) by any defect in the appointment of a member of the Commission or committee; or (c) by reason that a person not entitled to do so took part in the proceedings. 10. Any member of the Commission or a committee thereof who has a personal interest in any contract or arrangement entered into or proposed to be considered by the Commission or committee shall forthwith disclose his interest to the Commission or committee and shall not vote on any question relating to the contract or arrangement. SUBSIDIARY LEGISLATION No Sub s id iary L eg i s l at ion"
    }
  ],
  "definitions": []
}