{
  "id": "nigerian-co-operative-societies-act",
  "type": "statute",
  "title": "NIGERIAN CO-OPERATIVE SOCIETIES ACT",
  "title_en": "NIGERIAN CO-OPERATIVE SOCIETIES ACT",
  "short_name": "NIGERIAN CO-OPERATIVE SOCIETIES ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=356",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Appointment of Federal Director of Co-operatives, etc.",
      "content": "Appointment of Federal Director of Co-operatives, etc. (1) The President rnay- (a) appoint a person to be a Federal Director of Co-operatives; (b) appoint persons to assist him; and (c) by notice in the Ga zette confer all or any of the powers of a Director under this Act on any such person. (2) The Governor of a State may appoint a person to be the Director of Co-operatives in the State and may appoint persons to assist him, and shall by notice in the State G a z e tt e , confer on any such person all or any of the powers of a Director under this Act. Societies which may be registered (I) A society may be registered as a co-operative society under this Act if-- (a) it is a limited liability society; and (b) has as its objects the promotion of the socio-economic interests of its members in accordance with co-operative principles, and established for the purpose of facilitating the operation of those principles. (2) A society may be registered under this Act as an industrial society or as a primary or secondary society. (3) A person appointed as a Director of Co-operatives under subsection (I) or (2) of section I of this Act, shall have a seal of such device as may be approved by the Presi- dent, in the case of a Federal Director and by the State Governor, in the case of a State Director of Co-operatives and the impression of such seal shall be judicially noticed. Conditions of registration (I) A primary society may be registered under this Act, if it consists of at least ten persons each of whom is qualified for membership under section 22 of this Act. (2) An industrial society may be registered under this Act if it consists of a minimum of six persons and is economically viable. (3) No secondary society which is established for the purpose of facilitating the operations of a registered society shall be registered unless it has as members at least five registered societies and in the case of a Federal apex society it has as members at least five registered State apex societies. (4) The word \"Co-operative\" or its vernacular equivalent shall form part of the name of every society registered under the Act. (5) The word \"limited\" or its vernacular equivalent shall be the last word in the name of every society registered under this Act. (6) Except in the case of a central financing society, the word \"bank\" or \"banking\" shall not form part of the name of any society registered under this Act. (7) When, for the purpose of this section, a question arises as to age, residence or occupation of land constituting the qualification of any person, that question shall be de- cided by the Federal Director of Co-operatives whose decision shall be final. (8) A registration fee of N I 00 or such other sum as may be prescribed by the Minister or Commissioner shall be paid to the Director. Application for registration ( I) An Application for registration shall be made to the Director. (2) The application shall be signed and in the case of- (a) a primary society, by at least ten individuals qualified for membership of the society; (b) a secondary society which has a registered society as a member, by a duly authorised member on behalf of every such registered society, and where all members of the society are not registered societies, by ten other members and when there are less than ten members, by all the members. (3) The application shall be accompanied by such number of copies of the proposed bye-laws of the society as prescribed by the Director and the persons by whom or on whose behalf the application is made shall furnish such information relating to the society as the Director may require. (4) The Director may make such alteration in a society's proposed bye-laws as he may deem necessary to bring them into conformity with the provisions of this Act. Registration (I) If the Director is satisfied that a society has complied with the provisions of sections 3 and 4 of this Act and that its proposed bye-laws are not contrary to the provisions of this Act, he shall register the society and its bye-laws. (2) If the Director refuses to register a society, the society may within 60 days from the date of the notification to it by the Director of his refusal to register the society, ap- peal against the refusal to the Minister or Commissioner, as the case may be. (3) The Director shall within 60 days dispose of an application for registration by a society. Effect of registration (1) The registration of a society shall- (a) render it as a body corporate by the name under which it is registered, with perpetual succession and a common seal; (b) vest it with power to- (i) hold movable and immovable property of any description; (ii) enter into contracts; (iii) institute and defend suits and other legal proceedings; and (iv) do all things necessary for the purpose of its constitution. (2) The affairs of a registered society shall be administered and managed by a committee appointed by the members for that purpose. Evidence of registration A certificate of registration, signed, sealed and delivered by the Director shall be conclusive evidence that the society mentioned in the certificate is duly registered, unless it is proved that the registration of the society has been cancelled. Register of members A register or list of members kept by a registered society shall be p r im a f a c i e evidence of the following particulars entered in it regarding- (a) the date at which the name of a person was entered in the register or listed as a member; and (b) the date at which the person or member ceased to be a member. Merit of entry in books of the society (I) A copy of an entry in a book of a registered society regularly kept in the course of business shall, if certified in such manner as may be prescribed by regulations, be re- ceived in any legal proceeding, civil or criminal, as prim a f ac i e evidence of the existence of such entry and shall be admitted as evidence of the matters, transactions and accounts therein recorded in every case where, and to the same extent as the original entry itself is admissible. (2) An officer of a society shall not in any legal proceeding to which the society is not a party, be compelled to produce any of the society's books, the contents of which can be proved under subsection (I) of this section or to appear as a witness to prove any matter, transaction or accounts recorded in the bodies, unless the court, for special rea- sons, so orders. 10. Address of'society A registered society shall have an address registered in accordance with this Act to which all notices and communications may be sent, and shall send to the Director notice of every change of address. PART II Dut ies and pri v il eges o f r eg i s t e r e d soc i e ti es 11. Power of society to make bye-laws (I) A registered society may make bye-laws for such things as are necessary or desirable for the purpose for which the society is established and the bye-laws of the society shall be presented with its application for registration as required under section 4 of this Act. (2) Without prejudice to the generality of subsection (I) of this section, a registered society shall make bye-laws in respect of the following matters, that is- (a) the name and registered address of the society; (b) the objects for which the society is established; (c) the area of its operation; (d) the qualifications for membership, the terms of admission of members, the admission fees, if any, and the mode of election; (e) the purposes to which its funds may be applied and the mode of custody and investment of its funds; (f) the nature and extent of the liability of members; (g) the withdrawal and expulsion of members and the payment, if any, to be made to those members; (h) the transfer of shares or interests of members; (i) the manner of raising the share capital, if any, and other funds; (j) the general meetings, and the procedure for and power of those meetings (k) the appointment, suspension and removal of membe"
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Charge and se",
      "content": "16. Charge and se t -off in respect of shares of members A registered society shall have a charge- (a) upon the shares or interests in the capital and on the deposits of a present or past or deceased member; and (b) upon any dividend, bonus or profits payable to a present or past member or to the estate of a deceased member, in respect of any debt due to the society from the present, past or deceased member and may set off any sum credited or payable to the present or past member or passed on to the estate of a deceased member in or towards payment of any debt."
    },
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "Shares or inte",
      "content": "17. Shares or inte r est not liable to attachment or sale Subject to the provisions of section 14 of this Act, the shares or interest of a member in the capital of a registered society shall not be liable to attachment or sale under any Act or order of a court in respect of any debt or liability incurred by that member, and his assignee in insolvency or a receiver duly appointed shall be entitled to or have a claim on such share or interest."
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "Transfer of",
      "content": "18. Transfer of in t erest on death of a member (1) On the death of a member, a registered society may transfer the shares or interest of the deceased member to-- (a) the person nominated in accordance with the law; or (b) if there is no person so nominated, to the heir or legal representative of the deceased member; or (c) where a court of competent jurisdiction is administering the estate of the de- ceased member, to such court; or (d) may pay to such nominee, heir, legal representative or a court of competent jurisdiction, as the case may be, a sum representing the value of such member's share or interest, as ascertained in accordance with the regulations or bye-laws made under this Act by the society. (2) A registered society shall pay all other moneys due to the deceased member from the society to such nominee, heir, legal representative or court of competent jurisdiction as the case may be, as stated in subsection (1) of this section. (3) All transfers and payments lawfully made by a registered society under this Act shall be valid and effectual against any demand made upon the society by any other per- son. 19. Deposit by or on behalf of a minor (I) A registered society may receive deposits from or for the benefits of minors and it shall be lawful for a registered society to pay such minors the interest which may become due on the deposits. (2) Any deposit made by a minor may, together with the interest accrued thereon, be paid to that minor, and any deposit made on behalf of a minor may, together with interest accrued thereon, be put to the guardian of the minor or the use of the minor, notwithstanding anything to the contrary in any law relating to the rights and liabilities of a minor. (3) The receipt of any minor or guardian for money paid to him under this section shall be a sufficient discharge of the liability of the society in respect of that money. 20. Exemption from certain duties fees and tax (I) All instruments executed by or on behalf of a registered society or by any officer or member of a registered society, relating to the business or the society shall be ex- empted from stamp duties chargeable under the Stamp Duties Act and from registration fees payable under any law, relating to registration of instruments, for the time being in force throughout the Federation. (2) A registered society shall be exempted from payment of tax under section 26 of the Companies Income Tax Act. 21. Exemption from compulsory registration of certain instruments Nothing in any law, for the time being in force, relating to the registration of instruments shall apply to- (a) any instrument relating to shares in a registered society notwithstanding that the assets of the society consist in whole or in part of immovable property; or (b) a debenture issued by a registered society and not creating, declaring, assign- ing, limiting or extinguishing any right, title or interest to or in immovable property, except in so far as it entitles the holder to security afforded by a reg- istered instrument whereby the society has mortgage, conveyed or otherwise transferred the whole or part of its immovable property or any interest therein to trustees upon trust for the benefit of the holders of the debenture; or (c) any endorsement upon or transfer of a debenture issued by the society; or (d) a charge created in favour of a registered society by a member of that society in respect of a produce of his agriculture or his land. 22. Qualification for membership of a primary society (1) A person shall be qualified for membership of a primary society if- (a) he has attained the age of sixteen years, except that in the case of a school cooperative society, the age limit shall not apply; (b) he is resident within or in occupation of land within the registered society's area of operation as described in the bye-laws, except that in the case of a credit society, the ownership or occupation of land within the area of operation of the society by the member shall not apply. (2) The Director shall have power in the case of a society with limited liability, to grant exemption from the qualifications set out in subsections (I) ( a) and (b ) of this sec- tion. PART III Right s and liabiliti es o f m e mb ers 23. Members not to exercise rights till due payments made A member of a registered society shall not exercise the rights of a member unless or until he has made such payment to the society in respect of membership or has acquired such interest in the society, as may be prescribed in the bye-laws of the society. 24. Restriction of membership Except with the prior consent of the registered society concerned, no person shall be a member of more than one registered society whose primary objective is to grant loans to its members. 25. Vote of members A member of a registered society shall be entitled to have one vote only as a member in the conduct of the affairs of the society, provided that- (a) in the case of an equality of votes, the chairman shall have a casting vote; and (b) in the case of a society of which a registered society is a member, that society may have such voting power as is provided for in its bye-laws. 26. Members of the Co-operative Federation (1) Members of the Board of Directors of the Co-operative Federation in each State shall constitute committees, one for each aspect of the society's activities, and the chair- man of the various committees shall represent the State at the National Apex while the President of the Co-operative Federation of a State shall represent the State apex at the Co-operati ve Federation of Nigeria. (2) No individual shall hold office in more than two National or State Apex Cooperative organisations at the same time and a member's term of office shall not exceed two terms of four years each. (3) If an officer is removed from office in a State secondary or primary co-operative organisation as a member of the National Apex or State Apex organisation, his member- ship at the National or State level shall cease forthwith. 27. Restriction on interest of members of society No member, other than a registered society, shall hold more than one fifth of the share capital of a society. N i ger ia n C o - o p e rativ e S oc i e ti es A c t 28. Restriction on transfer of shares or interest The transfer or charge of the share or interest of a current, past, deceased member in the capital of a registered society shall be subject to such conditions as to maximum holding as may be prescribed under this Act. 29. Liability of past member and estate of deceased member for the debt of the society (I) The liability of a past member for the debts of a registered society as they existed on the date on which he ceased to be a member shall not continue for a period of more than two years from the date he ceased to be a member. (2) The estate of a deceased member shall not be liable for the debts of the society as they existed on the date of his death, for a period of more than two years from the date of the member's death. (3) If an order to wind up a society becomes necessary and is made immediately after the period of two years stated in subsections (I) and (2) of this section, the liability of the past or deceased member shall continue until the entire liquidation process of the society is completed, provided that liability shall extend only to the debt of the society at the time of his ceasing to be a member or of his death. PART IV Pr o p er ty and funds of regist e r ed soc i eties 30. Restriction on loan A registered society shall not, except as provided in section 32 of this Act grant a loan to a person, who is not a member of that society, provided that it may grant a loan to an- other registered society with the consent of a majority of its members. 31. Power to borrow money (I) A registered society may, subject to the majority decision or consent of the general meeting of its members, borrow, whether by way of mortgage or otherwise on such terms and"
    },
    {
      "provision_ref": "s37",
      "section": "37",
      "title": "Inquiry and in",
      "content": "37. Inquiry and in s pection (1) The Director may, and shall, on the application of a simple majority of the members of the committee, or of not less than one-third of the members of a registered soci- ety, hold an inquiry or direct any other person authorized by him in this behalf, by order in writing, to hold an inquiry into the constitution, working and financial state of a regis- tered society. (2) All officers and members of the society shall furnish such information relating to the affairs of the society are produce such books, accounts, papers and securities of the society as the Director or the person authorised by him may require for the purpose of the inquiry. (3) The Director shall, on the application of a creditor of a registered society, inspect or direct any other person authorised by him in writing to inspect the books of the society, if the creditor- (a) proves that an ascertained sum of money is then due to him and that he has demanded payment thereof and has not received satisfaction within a reason- able time; and (b) deposits with the Director such sum as security for the costs of the proposed inspection as the Director may require. (4) The Director shall communicate the results of an inspection held under this section to the creditor and to the society into whose books the inspection was made. (5) Where an inquiry is held under subsection (1) of this section or an inspection is made under subsection (3) of this section, the Director may, by a certificate under his hand and seal, make an award apportioning the costs, as he may think right, between the registered society, the members demanding an inquiry, the officers or former officers of the society, and the creditor, if any, on whose application the inquiry was held. (6) A sum awarded by way of cost under subsection (5) of this section shall be recoverable in the same manner as a fine imposed by any court having jurisdiction over the person or body against whom the award is made on the production, before the court, of the certificate referred to in that subsection. (7) If an inquiry under subsection (1) of this section proves that the committee of the registered society is inefficient, the Director may, for the purpose of resuscitating the society, take over the management of its affairs for a period of two years after which the management shall be returned to the committee. (8) An officer or a member of a registered society who- (a) wilfully neglects or refuses to do any act or to furnish any information; or (b) furnishes information knowing it to be false, contrary to the provisions of subsection (2) of this section is guilty of an offence and liable on conviction to a fine of Nl,OOO or imprisonment for a term of six months or to both such fine and imprisonment. PART VI Can ce ll a tion of re g istra tio n, e t c. 38. Cancellation of registration of a society due to lack of membership (I) The Director may, by order in writing, cancel the registration of a primary society if, at any time, it is proved to his satisfaction that the number of the members of the soci- ety has been reduced to less than ten or in the case of an industrial society, to less than six and the order shall take effect from the date it is made. (2) If the Director, after holding or making an inquiry or conducting an inspection under section 37 of this Act or on receipt of an application made by not less than three fourths of the members of the registered society, is of the opinion that the society ought to be dissolved, he may make an order in writing for the cancellation of the registration of the society. (3) A member of a registered society may, within two months from the date of an order made under subsection (2) of this section appeal against the order to the Minister or Commissioner, as the case may be. (4) Where no appeal is lodged within two months from the making of an order cancelling the registration of a society, the order shall take effect on the expiry of that period and where however an appeal is presented within two months, the order shall not take effect until it is confirmed by the Minister or the Commissioner, as the case may be. (5) Where the Director makes an order for the cancellation of the registration of a society under subsections (I) and (2) of this section, he may make such further orders as he may think tit for the custody of the books and documents and the protection of the assets of the society until the order cancelling the registration takes effect. (6) No registered society shall wind or be wound up except by an order of the Director or of a court. 39. Effect of cancellation of registration Where the registration of a society is.cancelled by an order made under section 38 of this Act, the society shall cease to exist as a corporate body from the date on which the order take effect, (in this section referred to as \"the date of dissolution\") on which the order takes effects, provided that any right, interest or power conferred on the society, under section 15, 16, 17 and 18 of this Act shall be deemed to be vested in any liquidator appointed for that society by the Director. 40. Appointment of liquidator after cancellation of registration of a society (1) Where the registration of a society is cancelled by an order under section 38 of this Act, the Director may appoint a suitable person, subject to his direction and control, to be the liquidator of the society. (2) A liquidator appointed under subsection (I) of this section shall subject to the guidance and control of the Director and to any limitation imposed by the Director by an order made under section 47 of this Act, have powers to-- (a) decide, subject to any bye-laws defining the liability of members, the contri- bution to be made by present and past members or by the estate of deceased members of the society to its assets; (b) appoint a day by notice in the Federal or State Ga zette before which creditors whose claims are not already recovered in the books of the society shall state their claim for admission to be excluded from any distribution made before they have proved them; (c) decide any question of priority which arises between creditors; (d) refer a dispute to arbitration, and to institute in his name or office and defend suits and other legal proceeding on behalf of the society; (e) decide by what person and in what proportion the costs of liquidation are to be borne; (j) give such directions as to the collection and distribution of assets as may be necessary in the course of the winding up of the society; (g) with the approval of the Director, compromise any claim by or against the society; (h) call such general meetings of members as may be necessary for the proper conduct of the liquidation, giving not less than fourteen days of notice for every such meeting; (i) take possession of the books, documents and assets of the society; (j) sell the property of the society where necessary; (k) carryon the business of the society as far as may be necessary for winding it up beneficially, provided that he shall not for this purpose be entitled to grant any loan; (I) arrange for the distribution of the assets of the society in the convenient manner when a scheme of distribution has been approved by the Director. 41 . Attendance of witnesses and production of documents (1) Subject to such regulations as may be made in that behalf, a liquidator appointed under this Act shall, in so far as such powers are necessary for carrying out the purpose of section 40 of this Act have and exercise such powers as are vested in a magistrate in respect of summoning parties, enforcing the attendance of witnesses and compelling the production of documents. (2) A person who- (a) wilfully neglects or refuses to do an act or furnish an information required for the purposes of section 40 of this Act; or (b) furnishes information knowing it to be false; or (c) without reasonable excuse, disobeys any summons, requisition or order issued un"
    },
    {
      "provision_ref": "s42",
      "section": "42",
      "title": "Powe",
      "content": "42. Powe r of Director to control liquidation (I) A liquidator shall exercise his powers subject to the control and supervision of the Director, who may- (a) rescind or vary any order made by a liquidator and make whatever new order as he considers to be required in the circumstances; (b) remove a liquidator from office; ( c) call for books, documents and assets of the society; (d) by order in writing, limit the powers of a liquidator under section 40 of this Act; (e) require accounts to be rendered to him by the liquidator; (f) authorise the auditing of the liquidator's account and the distribution of the assets of the society; (g) make an order for remuneration of the liquidator; (h) refer any subject of dispute between a liquidator and any third party to an arbitrator if the party consents in writing to be bound by the decision of the arbitrator. (2) A person who- (a) wilfully neglects of refuses to do an act or to furnish an information required for the purpose of subsection (I) of this section; or (b) furnishes information knowing it to be false; or (c) without reasonable excuse, disobeys an order under subsection (I) of this section is guilty of an offence and liable on conviction to a fine of not less than N I ,000 or to im- prisonment for a term of not less than six months or to both such fine and imprisonment. 43. Enforcement of order (I) The decision of an arbitrator on any matter referred to him under section 42 of this Act shall be binding upon the parties, and shall be enforceable in like manner as an order made by the Director under that section. (2) An order made by the liquidator or by the Director under section 42 of this Act shall be enforced by any civil court, having jurisdiction over the place where the regis- tered office of the society is situated, in like manner as an order of that court. 44 . Disposal of funds of liquidation I n the liquidation of a society whose registration has been cancelled, the funds, including the reserve funds shall be applied in the following order of priority- (a) to the cost of liquidation; (b) to the discharge of the liabilities of the society (c) to the payment of the share capital; and (d) provided that the bye-laws of the society permit, to the payment of a dividend at a rate not exceeding five per cent per annum for any period for which a disposal of profits was made. 45. Notice of closing of liquidation to be published in the Gazette (1) When the liquidation of a society has been closed, notice of the closing of liquidation shall be published in the Federal or State Gazette; and no published claim against the funds of the society liquidated shall be made after two years have lapsed from the date of the publication in the Federal or State Ga z ette of the notice. (2) Any surplus fund left over after meeting all the obligations of the liquidated society shall be distributed to members in accordance with the bye-laws of in the society. PART VII Surcharge and attachment 46. Power of Director to surcharge (1) Where in the course of an audit of a registered society held under the provisions of section 36 of this Act or of an inquiry held under the provisions of the section 37 of this Act or of the winding up of a registered society, it appears that a person- (a) who has taken part in the organization or management of the society has mis- applied or retained or become liable or accountable for the money or property of that society; or (b) has been guilty of a misfeasance or breach of trust in relation to the society, the Director may, on his own volition, or on the application of the liquidator or of any creditor or contributor, examine the conduct of the person and make an order requiring him to repay or restore the money or property or any part thereof with interest at such rate as the Director thinks just or to contribute such sum to the assets of the society by way of compensation in regard to the misapplication, retention, dishonesty or breach of trust as the Director thinks fit. (2) This section shall apply notwithstanding that the act is one for which the offender may be criminally responsible. 47. Attachment of property (1) When the Director is satisfied that a person, with intent to defraud or delay the execution of an order which may be made against him under section 46 (1) or 49 (1) of this Act or under any decision given in a dispute referred to the Director or an arbitrator under the bye-laws or regulations of the society- (a) is about to dispose of the whole or any part of his property; or (b) is about to remove the whole or any part of his property from the local limits of the jurisdiction of the Director, the Director may, unless adequate security is furnished, direct the interim attachment of the property or such part thereof as he thinks necessary and the attachment shall have the same effect as if it had been made by a competent court. (2) A person who, without reasonable excuse, fails to comply with the provisions of subsection (1) of this section is guilty an offence and liable on conviction to a fine of H I, O O O or to imprisonment for a term of six months or to both such fine and imprisonment."
    },
    {
      "provision_ref": "s48",
      "section": "48",
      "title": "A",
      "content": "48. A ppeal to Minister or Commissioner A person aggrieved by an order of the Director made under section 46 or 47 of this Act may appeal to the Minister or Commissioner, as the case may be, within 30 days from the date of the order and the decision of the Minister or the Commissioner shall be conclusive. PART VIII Di s put es 49. Settlement of disputes (I) If a dispute touching the business of a registered society arises- (a) among present or past members and persons claiming through present or past members and deceased members; or (b) between a present, past or deceased member and the society, its committee or any officer, agent or servant of the society; or (c) between the society and any other committee and any officer, agent or servant of the society; or (d) between the society and any other registered society, the dispute shall be referred to the Director for settlement. (2) A claim by a registered society for any debt or demand due to it from a member or nominee, heir or estate of a deceased member, shall be deemed to be a dispute touch- ing the business of the society within the meaning of subsection (l) of this section. (3) The Director shall on receipt of a reference under subsection (1) of this section- (a) settle the dispute; or (b) subject to the provisions of any regulations made under this Act refer it to an arbitrator appointed in accordance with regulations made under this Act for disposal. (4) A decision made by an arbitrator under paragraph (b) of subsection (3) of this section shall, except as otherwise provided in subsection (6) of this section be final. (5) The decision shall, on the application of the party in whose favour it is made, be enforced by any court which has jurisdiction in a civil suit between the parties to the dis- pute to give a judgment for the payment of the amount awarded or, where the decision does not relate to the payment of money, to give a similar decision in the same manner as if the decision has been a judgment or decision of the court. (6) A party aggrieved by a decision of the Director or of the arbitrator made under the provision of subsection (4) or (5) of this section may appeal to the Minister or the Commissioner, as the case may be, within 30 days from the date of the decision and the decision of the Minister or the Commissioner shall be final and conclusive. 50. Case to be stated on question of law (1) Notwithstanding the provisions of section 49 of this Act- (a) the Director or an arbitrator may, at any time when making a decision under this Act; and (b) the Minister or the Commissioner may, at any time when an appeal has been referred to him against any decision of the Director under this Act, refer any question of law arising out of such decision for the opinion of a High Court. (2) Subject to the provisions of any regulations made under this Act the Director may withdraw any dispute referred to an arbitrator under subsection (3) (b) of section 49 of this Act and settle the dispute under subsection (3) (a) thereof. (3) A decision made by the Director under subsection 3 (a) of section 49 of this Act or under subsection (2) of this section shall, except as otherwise provided in subsec- tion (6) of that section be final. PART IX Di v ision and amalgamation 51. Division of society (1) A registered society may at a meeting of its general body, specially called for the purpose, of which at least fourteen days notice shall be given to the members, resolve to split into two or more societies. (2) A resolution passed under the provisions of subsection (I) of this section (in this section referred to as \"preliminary resolution\") shall contain proposals for the division of the assets and liabilities of the society among the new societies into which it operatives and specify the members who shall constitute each of the new societies. (3) A copy of the preliminary resolution shall be sent to all the members and creditors of the society. (4) A member of the society may, notwithstanding anything contained in the bye-laws of the society to the contrary, by notice given to the society, within a period of two months from his receipt of the preliminary resolution, intimate his intention not to become a member of any of the new societies. (5) A creditor of the society may, notwithstanding any agreement to the contrary, by notice given to the society, within a period of two months from his receipt of the prelimi- nary resolution, intimate his intention to demand a return of the amount due to him. (6) After the expiry of two months from the receipt of the preliminary resolution by all the members and creditors of the society, a general meeting of the society of which at least fourteen days notice shall be given to its members, shall be convened for considering the preliminary resolution. (7) If, at a meeting convened under subsection (6) of this section, the preliminary resolution is confirmed by a resolution passed either without change or with such changes as in the opinion of the Director are not material, he may register the new societies and their bye-laws and on such registration the registration of the old society shall be deemed to have been cancelled. (8) The opinion of the Director as to whether the changes made under subsection (7) of this section in the preliminary resolution are material or not shall be final and no ap- peal shall lie therefrom. (9) At the meeting convened under subsection (6) of this section, provision shall be made by another resolution for- (a) the repayment of the share capital of all the members who have given notice under subsection (4) of this section; and (b) the satisfaction of the claims of all the creditors who have given notice under subsection (5) of this section, so however that no member or creditor shall be entitled to the repayment or satisfaction until the preliminary resolution is confirmed as provided in subsection (7) of this section. (10) If, within such time as the Director considers reasonable, the share capital of the members referred to in subsection (9) of this section are not repaid or the claims of the creditors referred to in that subsection are not satisfied, the Director may refuse to register the new societies. (II) The registration of the new societies shall operate to vest the assets and liabilities of the original society in the manner specified in the preliminary resolution as con- firmed under subsection (7) of this section. 52. Amalgamation of societies (I) Two or more registered societies may, at a general meeting of each society specially called for the purpose, of which at least fourteen days notice shall be given to their respective members, pass a resolution (in this section referred to as \"preliminary resolution\") to amalgamate into one society. (2) A copy of the preliminary resolution of each society shall be sent to all the members and creditors of the society. (3) A member of the society may, notwithstanding anything contained in the bye-laws of the society to the contrary, by notice gi ven to the society of which he is a member within a period of two months from his receipt of the copy of the preliminary resolution, intimate his intention not to become a member of the new society. (4) A creditor of the society may, notwithstanding an agreement to the contrary, by notice to the society of which he is a creditor within a period of two months from his re- ceipt of the copy of the preliminary resolution, intimate his intention to demand payment of the amount due to him. (5) After the expiry of two months from the receipt of the preliminary resolution by all members and creditors of all the societies, a joint meeting shall be held of the mem- bers of those societies, of which at least fourteen days notice shall be given to the members, for considering the preliminary resolution. (6) If, at a meeting held under subsection (5) of this section, the preliminary resolution is confirmed by a resolution passed by a majority of not less than two-t"
    }
  ],
  "definitions": []
}