{
  "id": "nigeria-lng-fiscal-incentives-guarantees-and-assurances-act",
  "type": "statute",
  "title": "NIGERIA LNG (FISCAL INCENTIVES, GUARANTEES AND ASSURANCES) ACT",
  "title_en": "NIGERIA LNG (FISCAL INCENTIVES, GUARANTEES AND ASSURANCES) ACT",
  "short_name": "NIGERIA LNG (FISCAL INCENTIVES,",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=347",
  "provisions": [
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "",
      "content": "s 2, 3 and 7 thereof and as otherwise provided in this Act, shall apply to the Com- pany. (3) The business undertaken by the Company and its products are hereby declared as pioneer industry and pioneer products respectively. (4) For the purposes of this Act, \"production day\" means the date of the first commercial delivery of liquefied natural gas produced by the Company to a purchaser of the liquefied natural gas, upon which date the trade or business of the Company shall be deemed to commence for the purposes of the Companies Income Tax Act. Tax relief period Notwithstanding the provisions of"
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "",
      "content": "section 10 of the Industrial Development (Income Tax Relief) Act, the tax relief period of the Company shall commence on the production day of the Company and shall continue for a period of ten years, so however that the tax relief period shall terminate at the first anniversary date after the first five years when the cumulative average sales price of liquefied natural gas reaches U"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "",
      "content": "S 3 dollars/mmbtu as calculated in the First Schedule to this Act in accordance with which such calculation shall only be made annually at each anniversary date. Liability to companies tax Except as otherwise provided under this Act, the Company shall be subject to tax under the provisions of the Companies Income Tax Act. Dollar accounting (I) The authorised and issued share capital of the Company shall, notwithstanding any provisions to the contrary in any other Act, be denominated in United States dollars and the books and records of the Company and the accounts shall also be drawn up in the same currency. (2) Notwithstanding any provision to the contrary in the Companies Income Tax Act or any other Act, the Company shall compute its income, expenditure (both capital and revenue), profits, assessable profits, total profits and all other amounts required to be computed or calculated by the Companies Income Tax Act or any Act, in United States dollars, and in particular the reference in"
    },
    {
      "provision_ref": "s40",
      "section": "40",
      "title": "",
      "content": "section 40 of the Companies Income Tax Act to the rate of tax shall for the Company be taken to be expressed in the same number of cents for each dollar as that section expresses the rate in kobo for each naira. Interest on loans (1) Interest payable by the Company in any year, whether to third parties or to shareholders, associates or subsidiaries of shareholders, shall be deductible in full for tax pur- poses. (2) All interests payable by the Company before the end of its tax relief period shall be deemed to have accrued for tax purposes on the day next following the end of the tax relief period. Withholding tax on interest, dividends, etc. (I) Interests or any other amounts payable or paid to any company other than a Nigerian company in respect of any loans or other financial arrangements made with the Com- pany shall be exempt from taxation in Nigeria. (2) Dividends paid out of the account kept by the Company for the purposes of"
    },
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "",
      "content": "section 17 (1) of the Industrial Development (Income Tax Relief) Act, whenever declared or paid, shall be deemed to be paid out of profits exempted from tax and the proviso to"
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "",
      "content": "section 18 of the Companies Income Tax Act shall apply accordingly. (3) In so far as any payments are made by the Company in respect of interest or other payments within subsection (1) of this section, dividends within subsection (2) of this section and payments within subsection (4) of this section, the provisions of"
    },
    {
      "provision_ref": "s78",
      "section": "78",
      "title": "",
      "content": "section 78,79,80 and 81 of the Companies Income Tax Act, including any provisions made pursuant to those sections, shall not apply. (4) Notwithstanding the provisions of subsection (2) of this section, dividends declared out of profit not credited to the special account under the provisions of section 17 of the Industrial Development (Income Tax Relief) Act, shall be subject to the normal rules on withholding tax. (5) In respect of any work or services provided from outside Nigeria to the Company by any person other than a Nigerian company or citizen, that person shall be exempt from tax on income or profits arising from the provision of that work or those services. (6) Any transfer of shares or any other interest in the Company or any company connected with the Company, shall be deemed, for the purposes of the Capital Gains Tax Act, to take place for such consideration as would leave the transfer with neither a gain nor a loss under"
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "",
      "content": "section 12 of that Act, if the transferor and transferee are connected within the meaning of"
    },
    {
      "provision_ref": "s23",
      "section": "23",
      "title": "",
      "content": "section 23 of the same Act. (7) For the purpose of subsection (6) of this section, legal proof of the relationship between the transferor and any transferee shall be clearly established. (8) Where any shipping company owned directly or indirectly by the Company or one or more of the shareholders of the Company carries on the business of transport by sea of liquefied natural gas produced by the Company, such shipping company shall be exempt from tax in Nigeria under"
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "",
      "content": "section 14 of the Companies Income Tax Act, or any other law, on the profits derived from that business. (9) In respect of any payment made by the Company to a shipping company within subsection (8) of this section for the shipment of liquefied natural gas, by way of hire, freight, demurrage or otherwise, the Company shall be exempt from the requirement to withhold tax or any other impost from the payment, under section 78 of the Companies Income Tax Act, or any other law. (10) The provisions of the National Shipping Policy Act and the regulations made thereunder shall not be applicable to the Company, its contractors, sub-contractors, its customers or a shipping company referred to in subsection (8) of this section. [Cap. N75. 1993 No. 113.] Exemption from customs duties (I) The Company and its contractors and sub-contractors shall be exempt from the payment of import duties, taxes and all other duties, levies, charges and imports of a similar nature, in respect of all necessary imports of plant, machinery, goods and materials for use in the construction of, or incorporation in the plant, jetties, shipping, transmis- sion facilities and ancillary works used in the Company's business, and in respect of any major spare parts needed in the event of a plant failure and ordered within two years of commissioning that part of the plant for which the particular spare part is ordered, subject to subsection (2) of this section. [1993 No. 113.] (2) The Company shall provide to the Comptroller-General of Customs a schedule of the categories of items within subsection (I) of this section to be imported, before the items are imported into Nigeria and if the Comptroller-General of Customs is not satisfied that it is necessary to import any item or items so notified, he shall give notice to the Company within fourteen days of receipt of the schedule or revisions thereto, and import duties or other tax levied by any other Act shall be payable by the Company in respect of that item or items. (3) Where the Company disagrees with any notice issued by the Comptroller-General of Customs under subsection (2) of this section, it may, within thirty days of receipt of the notice, give written notice of its dissatisfaction to the Comptroller-General of Customs and to the Minister of Internal Affairs, who shall hear representations from both the Com- pany and the Comptroller-General of Customs to determine whether exemption shall be granted; and the determination of the Minister of Internal Affairs on the matter shall be final and binding. (4) Pending notification of the determination of the Minister, the importation of the items in dispute shall be allowed without any restriction or payment of duty. (5) Such duty as may be payable under the determination of the Minister shall be paid upon importation of the item in dispute or within thirty days of the receipt of the Minis- ter's notification, whichever is the later. (6) The provisions of the Pre-Shipment Inspection of Imports Act and the regulations made thereunder requiring pre-shipment inspection, the submission of reports in connec- tion therewith under the Comprehensive Import Supervision Scheme and the \"Form M\" Procedures, the \"Form C-3.1\" Procedures or such other similar procedure of the Central Bank of Nigeria, shall not apply in relation to the importation of a plant, machinery, goods and materials for use in the construction of or incorporation of a plant, jetty, ship- ping, transmission facilities and ancillary works used in the Company's business and in respect of any major spare parts needed in the event of a plant failure and ordered within two years of the commissioning of that plant for which the spare part is ordered. [Cap. P26. 1993 No. 113.] (7) No export duties, taxes or other duties, levies, charges or impost of a similar nature shall be payable or imposed on the export of liquefied natural gas or other hydrocar- bons produced by the Company. [1993 No. 113.] Restriction on set off of capital allowance Notwithstanding the provisions of sub-paragraph (7) of paragraph 24 of the Second Schedule to the Companies Income Tax Act, the Company shall not be restricted on the set off of capital allowance accumulated during its tax relief period against its assessable profits in the periods following the end of its relief period. [Second Schedule. Cap. C21.] 9. Guarantees and assurances The guarantees and assurances set out in the Second Schedule to this Act shall have effect with respect to the shareholders of the Company and the Company. 10. Interpretation In this Act, unless the context otherwise requires-- \"LNG\" means liquefied natural gas. ll. Short title This Act may be cited as the Nigeria LNG (Fiscal Incentives, Guarantees and Assurances) Act. SCHEDULES FiRST SCHEDULE [Section 2.] Earl y t e rmin at ion o f t a x r e li ef p e r i o d 1. The cumulative average sales price is calculated at each anniversary date as follows-- (a) for each period ended on an anniversary date, calculate the annual average sales price of liquefied natural gas by dividing the total invoiced sales of lique- fied natural gas in the twelve months ending on the anniversary date in US$, by the total invoiced deliveries of liquefied natural gas in Millions of British Thermal Units, in the same period; (b) calculate the Nigeria LNG Index for each of the periods between the produc- tion day and the anniversary date, by multiplying the US Dollar/SDR index at the end of each period with the CPI at the same date, dividing the result by 1.9924344, or such other denominator as gives an answer of 100 for 31 De- cember 1987, in the event that the CPI is rebased; (c) divide the annual average sales price for each period-- (i) by the Nigeria LNG Index for the same period; (ii) to calculate the adjusted price for the period; (d) calculate the cumulative average sales price for the period from the production day to the anniversary date by dividing the sum of the adjusted prices ( c) for each period from the period in which the production day falls to the period which ends with the anniversary date by the number of such periods. 2. For the purposes of this Schedule-s- (a) anniversary date means the anniversary of the Production Day and each anni- versary thereof until the ninth anniversary; ( b) the US Dollar/SDR Index shall be the figure published by the International Monetary Fund in the publication titled \"International Financial Statistics\" for the end of the month in which the anniversary date falls for the United States dollar/Special Drawings Right Index (series \"su United States\") or if that pub- lication ceases then in its successor or a comparable United States publication of good standing; and (c) the CPI shall be the figure published by the International Monetary Fund in the \"International Financial Statistics\" for the end of the month in which the anni- versary date falls for the Industrialised Countries Consumer Price Index (series 110) or if the publication ceases then in its successor or a comparable United States publication of good standing; (d) period mean"
    },
    {
      "provision_ref": "s365",
      "section": "365",
      "title": "",
      "content": "s 365 calendar days (366 in a leap year) preceding an anniversary date. SECOND SCHEDULE ["
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "",
      "content": "Section 9.] G u ara nt ees a nd ass ur a n ces t o N i ge ria LNG limit e d a n d it s s h a r e h o l ders [1993 No. 113.] The Federal Government of Nigeria (in this Act referred to as \"the Government\") in recognition of the magnitude of, and in consideration of the investments which shall have to be made in order to prosecute the venture described in the shareholders' contract dated 19th May, 1989 between the Nigerian National Petroleum Corporation, Shell Gas B.Y., CLEAG Limited and Agip International B.Y., as amended, from time to time (such shareholders' contract, as so amended in this Act referred to as \"the contract\") hereby grants to the Company, its successors and to each of the shareholders, from time to time (in their capacity as such), the guarantees, assurances and undertakings following hereunder. These guarantees, assurances and undertakings shall have effect from the date hereof, and so long as the Company, or any successor thereto, is in existence and carrying on the business of liquefying and selling liquefied natural gas and natural gas liquids within and/or outside the Federal Republic of Nigeria. The guarantees and assurances are as follows-- 1. The Government shall do nothing to render invalid unenforceable rights and obligations arising under the contract and the other contracts and arrangements contemplated in the contract, to the extent that such rights and obligations are not illegal in Nigeria and do not offend against Nigerian public policy and provided that such contracts have been kept validly subsisting by the parties thereto, it being understood that such other contracts or arrangements will not be deemed to be illegal or contrary to Nigerian public policy for the sole reason that the requisite government actions referred to in clause 6 hereof have not been effected. 2. The venture shall be subject to the fiscal regime contained in the provisions of this Act. Such fiscal regime shall not be amended in any way, except with the prior written agreement of the Government, the Company and each of the Company's shareholders. 3. Without prejudice to any other provision contained herein, neither the Company nor its shareholders in their capacity as shareholders in the Company, shall in any way be subject to new laws, regulations, taxes, duties, imposts or charges of whatever nature which are not applicable generally to companies incorporated in Nigeria or to shareholders in companies in- corporated in Nigeria, respectively. 4. Shareholders who have purchased shares in the Company, with funds originating from outside Nigeria, shall enjoy all benefits of approved status under relevant legislation in respect of their equity shareholding. Such benefits shall include permission to transfer out of Nigeria dividends and capital without undue restriction, provided that there are sufficient foreign ex- change reserves in Nigeria to enable such transfers to be made, and that all applicable notifications have been given and relevant regulations complied with. 5. The Government recognises that it is in the interests of the venture that shares in the Company should be freely transferable, subject to the constraints contained in the contract and the applicable laws; accordingly the Government shall facilitate the grant of all permits and other authorisations required for the sale or transfer of shares in the Company. 6. The Government shall take such executive, legislative and other actions as may be necessary so as to effectively grant, fulfil and perfect the guarantees, assurances and undertakings contained herein. In order to afford the degree of security required to enable the Company's investments to be made, the Government further agrees to ensure that the said guarantees, assurances and undertakings shall not be suspended, modified or revoked during the life of the venture except with the mutual agreement of the Government and the shareholders of the Company. 7. The Company shall be permitted to remit funds which shall be carried out through legal channels and to maintain bank accounts outside Nigeria as may be necessary, and retain in such accounts subscription monies for shares, loans, payments and proceeds of sale, for thepurpose of making payments in foreign currencies in respect of interests, dividends, loan re- payments, the purchase of natural gas from the production joint ventures, charges and materials, equipment plants, shipping and services acquired abroad. The Company shall be obliged, however to advise the exchange control authorities on a regular basis of the transactions that have taken place and provide any documentation which may be required by the exchange control authorities to support such transactions. 8. Permission shall be given to the Company to declare and pay dividends in United States dollars, after due provision for the payment of tax has been made, without restriction as to time, amount, or the relationship such dividends bear to the share capital of the Company. Such permission shall enable dividends to be paid, without restriction, to resident and non- resident shareholders. 9. The Government shall ensure that the Company is able to receive its finance in Nigeria in the form of either or both money transferred directly from abroad, and plant, machinery, ma- terials, equipment and services imported from abroad; and to convert the money so transferred into Nigerian currency at rates of exchange not less favourable to the Company than those available to any other commercial enterprise in Nigeria. 10. The Government shall treat the venture as a priority project for loan financing purposes and shall reflect this in appropriate public statements and in assurances to the World Bank, the International Monetary Fund, other multilateral and bilateral agencies and financial institutions. 11. The Government, in its capacity as host Government, shall provide assurances and guarantees which may reasonably be required by the Company's lenders, provided such assurances and guarantees are within the scope of the guarantees and assurances contained in this Act. 12. The Government shall not impose constraints on the amount of loan or other financing which may be provided to the venture. 13. The Government shall facilitate-- (a) the grant of any licence or permit required for the importation or exportation of plant material, equipment and products of the Company; (b) the grant of permits, licences required for the construction, start-up and opera- tion of the facilities; (c) the customs formalities in respect of imports and exports (not including per- sonal effects) required in connection with the construction, operation and maintenance of the Company facilities and products; and (d) the prompt registration and certification by the National Office for Technology Acquisition and Promotion of all contracts for the transfer of technology to the Company by its advisers, contractors and sub-contractors in accordance with the National Office for Technology Acquisition and Promotion Act, accord- ingly the provisions of subsection (2) of"
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "",
      "content": "section 6 of the said Act, shall not be applicable to any of the afore-mentioned contracts. [1993 No. 113. Cap. N62.] 14. The Government shall facilitate the acquisition by the Company of legally sound title to, and vacant possession (for a period of not less than 80 years) of land required by the Com- pany for the venture (including a suitable residential area), together with rights of way, easements and other rights necessary for the implementation of the venture. Such title to and pos- session of the land shall be on reasonable and non-discri minatory terms. 15 . For all practical purposes, the Company shall be treated as an independent, autonomous, commercial entity and its operations, policies, procedures and conditions of services shall be determined by the Board of Directors of the Company. 16. The Government shall facilitate the grant of visas to expatriate staff required by the Company for the implementation, construction, start-up and on-going operations of the venture. 17. Permission for the Company to own and construct jetties and a bonded area for loading and unloading construction equipment and material and for shipment of liquefied natural gas and natural gas liquids shall be granted where these comply with the requirements of the Federal Ministry of Transport, the Nigerian Ports Authority (\"NPA\") and the relevant Customs authority and other official bodies in Nigeria. Customs personnel shall be provided at the bonded area at all times. Appropriate facilities for such personnel shall be provided by the Company. 18. (I) The Company and Government shall work together to agree on specifications for marine and port services to be provided at Bonny as regards- (a) the capital dredging of the Bonny bar channel by the Company and the mainte- nance dredging by Government; [1993 No. 113.] (b) Government's responsibility to provide and maintain the navigational aids for the Bonny bar channel; [1993 No. 113.] (c) Government's responsibility for providing a fully comprehensive traffic control system for Bonny port; (d) Government's responsibility for ensuring that all traffic in the Bonny channel shall carry a pilot and allocation of top graded pilots to the venture; (e) the Company's responsibility for ensuring the safety and protection of the designated safety zone around the LNG berth with the assistance and co- operation of the law enforcement agencies; if) the Company's responsibility to provide, operate and maintain the tugs, moor- ing boats and patrol crafts required for the venture; and [1993 No. 113.] (g) if, in the Company's opinion, the activities for which the Government is re- sponsible, pursuant to sub-paragraph (a), (b) and (c) of this paragraph, are not carried out in such a manner as to satisfy the Company's requirements, the Company shall have the right to arrange for the necessary activities to be car- ried out. [1993 No. 113.] (2) The Company and the Nigerian Ports Authority acting on behalf of Government shall liaise and co-ordinate their respective activities to ensure the successful implementation of the sub-paragraph (I) of this paragraph. (3) The capital costs incurred by the Company in fulfilling the responsibility allocated to it pursuant to sub-paragraph (1) (a) of this paragraph and in providing navigational aids for the Bonny bar channel and traffic control facilities to be used by Nigerian Ports Authority on behalf of Government in fulfilling Government's responsibilities pursuant to sub-para- graphs (I) ( b) and (c) of this paragraph and any costs incurred by the Company for activities undertaken by the Company pursuant to sub-paragraph (1) (g) of this paragraph shall be borne by the Nigerian Ports Authority and shall be reimbursed to the Company on terms to be agreed between the Nigerian Ports Authority and the Company in good faith. [1993 No. 113.] 19. Permission shall be granted by the Government through the Nigerian Electric Power Authority on application by the Company for the Company to construct, own and operate an electricity generating plant with a capacity of about 200 megawatts as part of the facilities under terms and conditions which govern such power generating plants: Provided that no conditions shall be attached to any such grant requiring the Company to generate and supply electrical power for any purpose other than to meet the requirements of the venture for power supply to the LNG plant, the Company's other facilities area at Bonny and the Company shall not be obliged to supply power to the Nigeria Electricity Power Authority for local distribution or otherwise. [1993 No. 113.] 20. The Company shall, at its own expense, provide itself, in accordance with the Company's Comprehensive and Integrated Telecommunications Network plan, with local tele- phone and telex services and facilities for international leased circuits and satellite links between its loading terminal near Bonny and ships at sea transporting liquefied natural gas produced by the Company, as well as the receiving terminals of the Company's overseas custom~I'S, provided howsoever that where the~e serviee~ and faeilitie~ CRn b~ provided by the Nigerian Telecommunications Limited in a timely fashion so as to fulfil the requirements of the venture, the Company shall use reasonable endeavours to use the services and facilities of the Nigerian Telecommunications Limited. [1993 No. 113.] 21. The Government hereby affirms its recognition of the shareholders' right to prompt adequate and effective compensation in the event of expropriation of tangible property or prop- erty rights or interference with contract rights. 22. In the event of any dispute in respect of a substantial matter arising from the provisions of this Act, the aggrieved shareholder(s) in the Company shall issue a letter of notification to Government, formally notifying Government and the other shareholders of the dispute. The Government's representatives and one or more of the Company's shareholders, as the case may be, shall make serious efforts to resolve amicably such dispute. In the event of failure to reach amicable settlement within 90 days of the date of the letter of notification mentioned above, such dispute may be submitted to arbitration before the International Centre for the Settlement of Investment Disputes. SUBSIDIARY LEGISLATION N o S u bs idi ary L egis l a t ion"
    }
  ],
  "definitions": []
}