{
  "id": "obafemi-awolowo-university-transitional-provisions-act",
  "type": "statute",
  "title": "OBAFEMI AWOLOWO UNIVERSITY (TRANSITIONAL PROVISIONS) ACT",
  "title_en": "OBAFEMI AWOLOWO UNIVERSITY (TRANSITIONAL PROVISIONS) ACT",
  "short_name": "OBAFEMI AWOLOWO UNIVERSITY",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=420",
  "provisions": [
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Modification of certain provisions of the Law",
      "content": "5. Modification of certain provisions of the Law (1) Until other provisions are made in that behalf by the Federal Government- (a) all references in the Law to the Visitor shall be construed as references to the President; and (b) the power to appoint the Vice-Chancellor of the University shall vest in the President. (2) Section 6 (1) of the Law is hereby repealed and all the provisions of the Law shall be construed subject to this Act. I nterpretation In this Act- \" functions\" includes powers and duties; \" the Council\" means the Council of Obafemi Awolowo University; \" the Law \" means the University of He Law 1970 as amended; \" the U niversity\" means Obafemi Awolowo University. 7. S hort titl e This Act may be cited as Obaferni Awolowo University (Transitional Provisions) Act. SCHEDULE [Section 1 (2).] OBAFEMI AWOLOWO UNIVERSITY LAW ARRANGEMENT OF SECTIONS PART I Pr el i m i nary SECTION 1.Short title. 2. Interpretation. PART II Estab l is h ment , in c orporation an d f un c ti o n s of th e Univers i t y Establishment and Incorporation of the University. Objects of the University. Functions of the University. The Visitor and his functions. Obaf e mi Awol o w o Uni ve r s it y ( Transitional Pr ov i s i ons) Act SECTION Prohibition of discrimination on grounds of race, creed, class, religion, etc. Common seal. PART III The officers. co n st itu ent b od i es an d ot h er auth o r it i es of t h e Unive r sit y Chancellor. Pro-Chancellor. Vice-Chancellor. Deputy Vice-Chancellor. Other officers. Appointments and tenure of office. Establishment and functions of the Council. Composition of the Council. Establishment and functions of the Senate. Deprivation of degrees, diplomas, etc., and withdrawal of fellowships, studentships. etc. Faculties. Institutes. Power to establish, abolish or reform faculties, institutes, etc. Congregation. Convocation. Graduates Association. PART IV Sta t utes , o r di n an c es a nd regulations Statutes. Mode of exercising power to make, amend or revoke statutes. Ordinances. Regulations. Conflict of provisions. PART V R es id e n ce a nd di sc ipli ne General powers of the Council in relation to discipline and order. Removal of officers and staff. Functions of Vice-Chancellor. Discipline of students. Powers of Council to suspend students, University activities, etc. Residence of staff and students. Protection of the University's estate. PART VI F i nanc i al p rov i sio n s 37. Finance and General Purposes Committee. SECTION Bank accounts. Financial year, accounts, etc. Annual estimates. Gins, donations, etc. General fund of the University. Audit. Retirement benefits, superannuation, etc. Retiring age of academic staff of the University. Special provisions relating to professors. PART VII G ene ral pr ov i s i ons Execution and issue of instruments. Service of notices, etc. Restriction of suits and execution. Disputes as to appointments, elections, etc. Vacancy or defect in appointment, etc., not to invalidate proceedings. Committees generally. Resignation and reappointments, etc. Members of authorities and bodies to declare personal interests. Preliminary investigation in respect of land required by the University. Compulsory acquisition of land. Exemption from stamp duties and registration fees. Power to make proposals for amendment of Law. Statutes, Ordinances and Regulations exempted from interpretation statutes. PART VIII Tra ns iti o n a l pr ov i s i o n s Continuation of existing Council and Senate until replaced. Continuation in office of Chancellor and other officers and staff of the University. Transitional provisions relating to faculties, boards, departments, etc. Transitional provisions relating to graduates, students, examinations, degrees, etc., of the University. Transfer of land acquired by the Government for the University. Transfer to the University of the property and liabilities of the Provisional Council. Repeal of Law No. 6 of 1961. SCHEDULES FIRST SCHEDULE T he F ir st C h a n ce ll or, P ro- Ch a n ce ll o r a nd V i ce -Cha nce ll o r of t h e Uni ve r s it y SECOND SCHEDULE Th e Statut es o f th e U n i ve r s it y A Law to provide for the establishment , incorporation, constitution and function s of the Obafemi Awolowo University, Ife and for other matter s in c idental thereto or connected therewith . [W.S. No. 14 of 1970.] [11 th Jun e ,1970] [Commencement.] PART I Pr e liminar y 1 . Short title This Law may be cited as the Obafemi Awolowo University Law."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "Interpretation In this Law, unless the context otherwise requires- \" academic staff' means the Vice-Chancellor, Professors, Readers, Senior Lecturers, Lecturers, Assistant Lecturers, the Librarian and such other persons in the employ of the University engaged in teaching or research therein as the Council, acting in accordance with the recommendation of the Senate, may from time to time grant the status of mem- bers of the academic staff of the University; \"academic y e ar\" means such period not exceeding twelve consecutive months as the Senate may from time to time so designate; \" the administrative staff ' means those persons in the employ of the University, other than the academic staff, who hold administrative, professional or technical posts designated by the Council as senior posts; \"the appointed day \" means the day on which this Law comes into force; \"Congregation\" means the Congregation of the University established by section 21 of this Law; \"Convocation\" means an assembly of the University established by section 22 of this Law; \" the Council\" means the Council of the University established by section 15 of this Law; \" functions\" includes powers and duties; \" graduate \" means a person on whom a degree, other than an honorary degree, has been conferred by the University and any other person as may be designated as a gradu- ate by the Council, acting in accordance with the recommendation of the Senate; \" Graduates Association\" means any association recognised by the Council pursuant to the provisions of this Law or the Statutes; \" other staff' means those persons in the employment of the University who are not members of the academic staff or the administrative staff; \" prescribed\" means prescribed by this Law, or by statutes, ordinances or regulations of the University; \" professor \" means a person appointed to be a professor in the University and in- cludes a visiting professor; \" Provisional Council\" means the Provisional Council established under the Univer- sity of Ife (Provisions Council) Law, 1961; [Law No. 6 of 1961.] \" Regulations\" means any Regulations of the University made by the Senate pursuant to the provisions of the Law or the Statutes; \" the Senate\" means the Senate of the University established by section 16 of this Law; \"Statutes\" means the Statutes of the University set out in the Second Schedule to this law or made hereafter under the provisions of this Law; [Second Schedule.] \"s tudent\" means a person who has been registered as a student of the University during a current academic year for a first or higher degree, diploma, certificate or such other qualification of the University as may be approved by the Senate as qualifying a person for the status of a student; \" teacher\" means a person appointed as a member of the staff of the University on full-time or part-time teaching duties and shall include such persons employed on re- search duties in the University as are required also to teach; \" undergraduate\" means a person registered as a student undergoing a course of studies for a first degree of the University as may be approved by the Senate as qualifying a student undergoing it for the status of an undergraduate; \" the University\" means Obafemi Awolowo University, Ife established and incorpo- rated by section 3 of this Law. PART II Establishment, incorporation and functions of the University"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Establishment and incorporation of the University",
      "content": "Establishment and incorporation of the University (1) As from the appointed day, the university for which the Provisional Council was established by the University of Ife (Provisional Council) Law, 1961, shall be deemed to have been established in accordance with the provisions of this Law, as a university which shall continue to be known as \"Obafemi Awolowo University, Ife\". (2) The University shall be a body corporate with perpetual succession and a com- mon seal and shall have power to sue and be sued in its corporate name and to acquire, hold and dispose of movable and immovable property for the purposes of its functions under this Law."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Objects of the University",
      "content": "Objects of the University The objects of the University shall be- (a) to provide facilities for learning, and to give instruction and training in such branches of knowledge as the University may desire to foster and in doing so to enable students to obtain the advantage of a liberal education; (b) to promote by research and other means the advancement of knowledge and its practical application to social, cultural, economic, scientific and technological problems; (c) to stimulate, particularly through teaching and research, interest in and appre- ciation of African culture and heritage; (d) to undertake any other activities appropriate for a university. Functions of the University (1) The University shall be both a teaching and examining body and, subject to the provisions of the Law, shall have the following functions- (a) to establish such faculties, institutes, schools, extra-mural departments, and other units of learning and research within the University as the University may from time to time deem necessary or desirable; (b) to institute professorships, readerships, and lectureships and any other office of any kind and whether academic or not as may be required by the University; to prescribe conditions of service for and appoint persons to such offices and to exercise disciplinary control over them; (c) to institute and award fellowships, scholarships, studentships, bursaries, med- als, prizes and other academic titles, distinctions, awards and forms of assis- tance; (d) to prescribe from time to time the conditions under which persons shall be admitted to the University or to any particular course of study therein or be allowed to continue in such course of study; (e) to grant and confer, under conditions prescribed by the University, degrees, diplomas, certificates and other academic distinctions, to and on persons who have pursued a course of study approved by the University and have passed such examination or other tests and satisfied such other requirements as the University may prescribe; (f) to confer honorary degrees, fellowships and other academic distinctions; (g) on what the University shall deem to be good cause, to deprive any person of any degree, diploma, certificate, fellowship, scholarship, studentship, bursary, medal, prize or other academic title, distinction or award whatsoever granted to or conferred on him by the University; (h) to provide such lectures and instructions for persons not being members of the University as the University may determine and to grant to any such person such diplomas, certificates or other academic distinctions as the University may deem necessary; (i) to accept the examinations passed and periods of study spent by students of the University at other universities or places of learning as equivalent to such ex- aminations and periods of study in the University as the University may de- termined and to withdraw such acceptance at any time; (j) to affiliate with other institutions or branches or departments thereof and to recognise selected members of the staff thereof as teachers of the University, and to admit the members thereof to any of the privileges of the University, and to accept attendance at courses of study in such institutions or branches or departments thereof in place of such part of the attendance at courses of study in the University and upon such terms and conditions as may, from time to time, be determined by the University; (k) to make provision for research and advisory services and with these objects in view to enter into such arrangements with other institutions or with public bodies as the University may deem desirable; (l) to undertake printing, publishing and book-selling; (m) to provide for the residence, discipline and welfare of the members of the Uni- versity and its employees; (n) to demand and receive such fees as may, from time to time, be prescribed by the University; (o) to act as trustees or managers of any property, legacy, endowment, bequest or gift for purposes of education or research or otherwise in furtherance of the work and welfare of the University, and to invest any funds representing such property, legacy, bequest, endowment, or gift, if not immediately required, on such security as the University may deem fit; (p) to acquire, hold, grant, charge or otherwise deal with or dispose of movable and immovable property wherever situate; (q) to accept gifts, legacies and donations, but without obligation to accept the same for a particular purpose unless the University approves the terms and conditions attaching thereto; (r) to enter into contracts, establish trusts, solely or jointly with any other author- ity or institution and to employ and act through agents; (s) to erect, provide, equip and maintain libraries, laboratories, lecture halls, re- fectories, sports grounds, playing fields and other buildings or things (whether in Nigeria or elsewhere) necessary or suitable or convenient for any of the ob- jects of the University; (t) subject to any limitation or conditions imposed by or in accordance with this Law, to invest any moneys appertaining to the University by way of endow- ment and whether for general or special purposes, and such other moneys as may not be immediately required for current expenditure, in any approved in- vestments or securities or in the purchase or improvement of land, with power from time to time to vary any such investments and to deposit any moneys for the time being uninvested with any bank on deposit or current account; (u) to take such steps as may, from time to time, be deemed expedient for the pur- pose of procuring contributions to the funds of the University; (v) to borrow, whether at interest or not and if need be upon the security of any or all the property, movable or immovable, of the University, such moneys as the University may, from time to time, in its discretion find it necessary or expedi- ent to borrow; (w) to make gifts for any charitable purpose; (x) to do anything which it is authorised or required by this Law, or by statutes, ordinances or regulations to do; (y) to do all such acts and things, whether incidental to the powers aforesaid or not, as may be requisite in order to further the objects of the University as a place of education and of learning and research. (2) The powers conferred upon the University by subsection (1) of this section shall not necessarily have to be exercised by the officers, authorities and person mentioned in Statute 2 as comprising the University acting together on anyone occasion, and any such powers may be exercised by any of those officers, authorities, persons or others where provision enabling any of them so to do is made in or by virtue of this Law."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "The Visitor and his functions",
      "content": "6. The Visitor and his functions (1) The Visitor may from time to time conduct a visitation of the University in per- son, or after consultation with the Chancellor, direct that the same shall be conducted by such person or persons as he may appoint in that behalf, for the purpose of advising on the effective fulfilment of the objects and the due exercise of the functions of the Univer- sity as prescribed by law. (2) It shall be the duty of all officers, members, authorities, employees of and persons otherwise connected with the University to make available to the Visitor, and to any other person or persons conducting a visitation in pursuance of this section, such facilities and assistance as he or they may reasonably require for the visitation."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Prohibition of discrimination on grounds of race, creed, class, religion, etc.",
      "content": "Prohibition of discrimination on grounds of race, creed, class, religion, etc. (1) Membership of the University shall be open to all persons of either sex and of whatever race, ethnic group or place of origin, religion, political or other opinion, nation- ality or class; and no test of religious or other belief or profession shall be adopted or imposed in order to entitle any person to be admitted to such membership or to be awarded any degree, certificate or other academic distinction of the University. (2) No fellowship, scholarship, studentship, medal, prize or other academic distinc- tion or award of the University shall be limited to persons of any particular race or ethnic group or place or origin, political or other opinion, religion, nationality, or class if the cost of the same is met from the general funds of the University. (3) Nothing in this section shall preclude the appointment of a member of a particular religious body to be minister of religion to members of that body who are employees or students of or otherwise connected with the University. 8. Common seal (1) The common seal of the University shall be kept in such custody as the Council may direct and shall not be used except by resolution of the Council or in such other manner as may be prescribed by statute. (2) The common seal of the University shall be officially and judicially noticed. PART III Th e o ff ice r s, c on s ti t u e nt bodies and oth e r authoriti e s of the Uni ve r s i ty"
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "C",
      "content": "9. C hancellor There shall be a Chancellor of the University who shall be the head of the University and shall in relation to the University take precedence before all other members thereof, and when he is present, he shall preside at all meetings of Convocation and other assem- blies of the University. 10. Pro-Chancellor There shall be a Pro-Chancellor of the University who shall, in relation to the Univer- sity, take precedence before all other members of the University except the Chancellor and except the Vice-Chancellor when acting as Chairman of Convocation or the Deputy Vice-Chancellor when so acting, and the Pro-Chancellor shall, when he is present, be the chairman of all meetings of the Council. 11. Vice-Chancellor There shall be a Vice-Chancellor of the University, who shall be the principal aca- demic and executive officer of the University and e x-offi c i o chairman of the Senate, and who shall in the absence of the Chancellor confer degrees and other academic titles and distinctions of the University. 12. Deputy Vice-Chancellor There shall be a Deputy Vice-Chancellor of the University who shall assist the Vice- Chancellor in the discharge of his functions as prescribed by law and shall, subject to the Statutes, in the absence of the Vice-Chancellor exercise and perform such of the func- tions of the Vice-Chancellor as the Vice-Chancellor or if the Vice-Chancellor should be incapacitated, the Council, may delegate to him."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Other officer",
      "content": "13. Other officer s There shall be such other officers of the University as the Council may, from time to time, desire fit to appoint. 14. A ppointments and tenure of office (1) Subject to the provisions of this Law, provisions may be made by Statutes with regard to the appointment and tenure of office of the Chancellor, Pro-Chancellor, Vice- Chancellor, Deputy Vice-Chancellor and other officers of the University, and any other matters relating thereto. (2) The First Chancellor, Pro-Chancellor and Vice-Chancellor shall be the persons so named respectively in the First Schedule to this Law. [First Schedule.]"
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "E",
      "content": "15. E s tabli s hment and function s of the Council (1) There is hereby established for the University a council to be known as the Coun- cil of the Obafemi Awolowo University, the constitution and procedure of which shall, subject to the provisions of this Law, be in accordance with such provisions as may be made by statute in that behalf. (2) The Council shall be the governing authority of the University and shall have the custody, control and disposition of all the property and finances of the University and, except as may otherwise be provided in this Law and the Statutes, shall manage and su- perintend generally the affairs of the University and, in any matter concerning the Uni- versity not provided for by or under this Law, the Council may act in such manner as appears to it best calculated to promote the interests, objects and purposes of the Univer- sity. (3) Without limiting the generality of the provisions of subsection (2) of this section, the Council, subject to the provisions of this Law and the Statutes, shall have the follow- ing functions- (a) to participate in the making, amendment or revocation of statutes pursuant to the provisions of this Law; (b) to make, amend or revoke ordinances pursuant to the provisions of this Law; (c) to govern, manage and regulate the finances, accounts, investments, property, business and all other similar affairs whatsoever of the University, and for that purpose to appoint bankers, solicitors and any other persons or agents as the Council may deem expedient, and to cause proper books of accounts to be kept of all sums of money received and expended by the University and of the as- sets and liabilities of the University in such manner as shall give a true and fair view of the state of the University and explain its transactions from time to time; (d) to borrow money on behalf of the University; (e) to invest any moneys belonging or appertaining to the University and not for the time being required to be expended for any of its purposes; (f) to sell, buy, exchange, lease or accept leases or otherwise dispose of any real or personal property on behalf of the University; (g) to provide and maintain the buildings, libraries, laboratories, premises, furni- ture, apparatus and other means needed for carrying out the work of the Uni- versity; (h) to enter into, vary, perform and cancel contracts on behalf of the University; (i) to enter into agreements for the incorporation in the University of any other institution and for taking over its rights, property and liabilities and for any other purpose not inconsistent with any of the provisions of this Law; (j) to determine, in consultation with the Senate, all University fees; (k) to establish, after considering the recommendation of the Senate in that behalf, faculties, institutes, schools, boards, departments, and other units of learning and research; to prescribe their organisation, constitution and functions and to modify or revise the same; (l) to authorise, after considering the recommendation of the Senate in that behalf, the establishments for the academic staff in the University, and, with the ap- proval of the Senate, to suspend or abolish any academic post except a post created by this Law or the Statutes; (m) to authorise the establishments for the administrative staff and other staff in the University and to suspend or abolish any such posts other than posts created by this Law or the Statutes; (n) to make the appointments authorised by this Law and the Statutes; (o) to regulate the salaries and to determine the conditions of service of all staff employed by the University; provided that the salaries and conditions of serv- ice of the academic staff shall be regulated and determined in accordance with the recommendation of the Senate; (p) to exercise powers of removal from office and other disciplinary control over the academic staff, the administrative staff and all other staff in the University; (q) to institute, in consultation with the Senate, and subject to any such conditions as may be specified by the Council or the founders, as the case may be, fellow- ships, studentships, scholarships, bursaries, prizes, medals and other endow- ments and aids to study and research; (r) to promote and to make provision for research within the University; (s) to call for reports from the Senate on any matter relating to instruction or teaching or any other academic matter within the University; (t) to award honorary degrees and other distinctions in accordance with such pro- visions as may be made by statute in that behalf; (u) to supervise and control the residence and discipline of students of the Univer- sity and to make arrangements for their health and general welfare; (v) to provide for the welfare of all persons employed by the University and the wives, widows and dependants of such persons, including the payment to them of money, pension or other retirement benefits and to subscribe to benevolent, superannuation or other similar funds for the benefit of such persons, their wives, widows and dependants (w) to perform all such other functions as are or may be conferred or imposed on the Council by this Law, or by the Statutes, Ordinances and Regulations and to carry this Law, the Statutes, Ordinances and Regulations into effect so far as they may concern the Council. (4) The Council may constitute boards, committees or other bodies for the purpose of making recommendations to the Council in respect of any of its functions conferred or imposed under or by virtue of this Law. (5) The Council may delegate any of its functions conferred or imposed under or by virtue of this Law to the chairman or any other member or members thereof or to any body comprising such member or members and such other persons as the Council may appoint: Provided that- (a) any such delegation shall be revocable at will and shall not preclude the Coun- cil from exercising any of its functions under or by virtue of this Law; (b) the Council shall not so delegate its powers to participate in the making, amending or revocation of statutes or to make, amend or revoke ordinances. 1 6. C ompo s ition of the C ouncil The Council of the University shall consist of - [l993 No. 11.] (a) the Pro-Chancellor; (b) the Vice-Chancellor; (c) the Deputy Vice-Chancellors; (d) one person from the Ministry responsible for education; (e) nine persons representing a variety of interests and broadly representative of the whole Federation to be appointed by the President; [1996 No. 25.] (f) four persons appointed by the Senate from among its members; (g) two persons appointed by the Congregation from among its members; (h) one person appointed by Convocation from among its members. 17. E s tabli s hm e nt and function s of the Se nat e (1) There is hereby established for the University a Senate, the constitution and pro- cedure of which shall, subject to the provisions of this Law, be in accordance with such provisions as may be made by statute in that behalf. (2) The Senate shall, subject to the provisions of this Law and subject also to the powers reserved to the Council in all matters affecting the University, be the supreme academic authority of the University and be responsible for all academic matters in the University, and shall organise, control and direct the academic work of the University, both in teaching and research, and shall take such measures and act in such a manner as it thinks proper for the advancement of the University as a place of education, learning and research. (3) Without limiting the generality of the provisions of subsection (2) of this section, the Senate, subject to the provisions of this Law and the Statutes, shall have the following functions- (a) to formulate and establish the academic policy of the University and to advise the Council on the provision of facilities to carry out that policy; (b) to appoint the Deans of the faculties in accordance with such provisions as "
    },
    {
      "provision_ref": "s23",
      "section": "23",
      "title": "Convocation",
      "content": "23. Convocation (1) There shall be a Convocation of the University which shall be an assembly of the University convened for the purpose of conferring degrees and other academic titles and distinctions of the University. (2) The procedure of Convocation shall, subject to any such provisions as may be made by statutes, be prescribed by the Senate."
    },
    {
      "provision_ref": "s24",
      "section": "24",
      "title": "Graduates Association",
      "content": "24. Graduates Association There shall be a Graduates Association of the University the constitution, functions and procedure of which shall, subject to the provisions of this Law, be such as may be prescribed by ordinances. PART VI St a tut e s , o rdin ances and regulati ons"
    },
    {
      "provision_ref": "s25",
      "section": "25",
      "title": "Statutes",
      "content": "25. Statutes (1) Subject to the provisions of this Law, statutes may be made to prescribe or regu- late any or all of the following matters- (a) the status, appointment, continuance in office and the functions of the officers of the University where such matters have not been provided for by this Law; (b) the constitution, functions and procedure of the authorities and constituent bodies of the University and other matters relative to such authorities and bodies; (c) the procedure for the appointment and the terms and conditions of service of, and the exercise of disciplinary control over the academic staff, the adminis- trative staff and other staff of the University; (d) the affiliation or admission to the University of educational or research institu- tions and the establishment of affiliated institutions; (e) the admission of students, their discipline and welfare; (f) the conferment of honorary degrees; (g) all other matters which under the provisions of this Law may be authorised or required to be prescribed or regulated by statute and, in addition, all such other provisions consistent with this Law as it may be deemed proper to make for the governance of the University, its members, authorities and other constitu- ent bodies or otherwise and for carrying out the work of the University and for the promotion of its objects. (2) The Statutes contained in the Second Schedule to this Law shall be the first stat- utes of the University, and shall be deemed to have been made under the provisions of this Law, and shall continue in force until such time as they may hereafter be amended, revoked or replaced by statutes made in the manner hereinafter prescribed. [Second Schedule.] (3) The power to make statutes shall not be limited by or with reference to, the first or any subsequent statutes or to the subject matters thereof."
    },
    {
      "provision_ref": "s26",
      "section": "26",
      "title": "Mode of exercising power to make, amend or revoke statutes",
      "content": "26. Mode of exercising power to make, amend or revoke statutes (1) Statutes shall be made, amended or revoked by the Council and the Senate with the assent of the Chancellor. (2) Proposals for the making, amendment or revocation of statutes may be initiated by either the Council or the Senate and howsoever initiated such proposals shall become statutes and effective only where they have received- (a) approval at a meeting of the Council by the votes of at least three quarters of the members present and voting, being not less than one half of the total mem- bership of the Council for the time being; and (b) approval at a meeting of the Senate by the votes of at least three quarters of the members present and voting being not less than one half of the total member- ship of the Senate for the time being; and (c) the assent of the Chancellor. (3) Every statute, or the amendment or revocation of any statute shall be in full force and effect as from the day upon which the assent of the Chancellor is given to the same or from such other date as may be specified in the statute. (4) A statute may be proved in any court by the production of a copy thereof pur- porting to be signed and certified as true by the Vice-Chancellor, the Deputy Vice- Chancellor or the Registrar."
    },
    {
      "provision_ref": "s27",
      "section": "27",
      "title": "Ordinances",
      "content": "27. Ordinances (1) Subject to the provisions of this Law and of the Statutes, the Council, either act- ing in accordance with the recommendation of, or after consultation with, the Senate, may from time to time make ordinances for the purpose of- (a) further prescribing or regulating any matters prescribed or regulated by statutes where the statutes require that such matters shall be further prescribed or regulated by ordinance; (b) exercising or prescribing the manner of exercising, except where expressly or by necessary implication the context does not so permit, any function con- ferred or imposed upon the Council by this Law; (c) prescribing or regulating any matter which though relating to the academic affairs of the University are agreed by both the Council and the Senate to have such financial implications as would make them appropriate subjects for provi- sion by ordinance; (d) prescribing or regulating any other matter which may be authorised or required by this Law to be prescribed or regulated by ordinance. (2) Ordinances may add to, amend, or revoke the ordinances from time to time in force. (3) Every ordinance shall take effect as from the day on which it is made by resolu- tion of the Council or from such other date as may be specified in the ordinance."
    },
    {
      "provision_ref": "s28",
      "section": "28",
      "title": "Regulations",
      "content": "28. Regulations (1) Subject to the provisions of this Law, the Statutes and Ordinances, the Senate may from time to time make regulations for the purpose of exercising any function con- ferred or imposed upon the Senate by this Law, or prescribing or regulating any matter which may be authorised or required by this law to be prescribed or regulated by regula- tion. (2) Regulations may add to, amend or revoke the regulations from time to time in force. (3) Regulations shall take effect as from the day on which they are made by the Sen- ate or from such other date as may be specified in the regulations."
    },
    {
      "provision_ref": "s29",
      "section": "29",
      "title": "Conflict of provisions",
      "content": "29. Conflict of provisions In the event of- (a) any statute being inconsistent with the provisions of this or any other Law; or (b) any ordinance being inconsistent with the provisions of this or any other Law or any statute; or (c) any regulation being inconsistent with the provisions of this or any other Law or any statute or ordinance, then in respect of paragraph (a), the provisions of the law; in respect of paragraph (b), the provisions of the law or the statute; and in respect of paragraph (c), the provisions of this Law, the statute or the ordinance, as the case may be, shall prevail and such statute, ordi- nance or regulation as mentioned respectively in those paragraph, shall, to the extent of the inconsistency, be void. PART V Residence and discipline"
    },
    {
      "provision_ref": "s30",
      "section": "30",
      "title": "General powers of the Council in relation to discipline and order",
      "content": "30. General powers of the Council in relation to discipline and order Subject to the provisions of this Law, the Statutes, Ordinances and Regulations, the Council shall have power to deal with all matters relating to the maintenance of discipline and order in the University in such manner as the Council may deem appropriate and whether or not such matters are referred to the Council by the Vice-Chancellor."
    },
    {
      "provision_ref": "s31",
      "section": "31",
      "title": "Removal of officers and staff",
      "content": "31. Removal of officers and staff (1) The Council may remove from office the Vice-Chancellor, the Deputy Vice- Chancellor, and other officer, of the University (excluding the Chancellor and the Pro- Chancellor), any member of the academic staff or any member of the administrative staff, subject to any such provisions as may be made by statutes or ordinances in that behalf. (2) Notwithstanding the provisions of subsection (1) of this section, any member of the staff or any member of the administrative staff- (a) who is appointed after or allowed to continue in employment beyond any re- tiring age prescribed by the Council; or (b) whose employment is temporary, part-time or probationary; or (C) whose appointment is not intended to continue until retiring age, may be removed from office in accordance with the terms of his contract of service or in exercise of powers of disciplinary control conferred in that behalf in or by virtue of this Law. (3) Any other staff may be removed from office in accordance with the terms of his contract of service or in exercise of powers of disciplinary control conferred in that behalf in or by virtue of this Law. 32. Functions of Vice-Chancellor The Vice-Chancellor shall exercise such functions as may be conferred or imposed upon him by this Law, the Statutes, Ordinances and Regulations, and shall, subject to the provisions of this Law, exercise general supervision over discipline in the University (in- cluding in particular the exercise of disciplinary control over students) in such manner as the Vice-Chancellor may deem appropriate. 33. Discipline of s tudent s (l) Subject to the provisions of this section, where it appears to the Vice-Chancellor that any student of the University has been guilty of misbehaviour, the Vice-Chancellor may, without prejudice to the exercise of any other disciplinary powers conferred on him by this Law, the Statutes, Ordinances or Regulations, direct- (a) that the student shall not, during such period as may be specified in the direc- tion, participate in such activities of the University, or make use of such facili- ties of the University, as may be so specified; or (b) that the activities of the student shall, during such period as may be specified in the direction, be restricted in such manner as may be specified; or (c) that the student be rusticated for such period as may be specified in the direc- tion; or (d) that the student be expelled from the University. (2) Where a direction is given under paragraph (c) or ( d ) of subsection (1) of this section, the student concerned may appeal against the direction to the Council which may, after causing such inquiry to be made into the matter as it may consider appropriate, either confirm or set aside the direction or alter it in such manner as it may think fit. (3) The fact that an appeal against a direction has been brought in pursuance of sub- section (2) of this section shall not affect the operation of the direction pending the de- termination of the appeal. (4) The Vice-Chancellor may delegate any of his powers to discipline students under this section to a disciplinary board consisting of such members of the University as he may nominate. (5) The Vice-Chancellor may empower the head of a hall of residence or other simi- lar institution of the University to discipline students, other than by way of rustication or expulsion from the University, for any breach of hall rules. (6) Nothing in this section shall be construed as precluding the restriction or termina- tion of a student's activities in or attendance at the University other than on the grounds of misbehaviour. (7) The Council, acting in accordance with the advice of the Vice-Chancellor and the Senate, may make ordinances governing the discipline of students and may prescribe in such ordinances what acts or omissions on the part of students shall for the purpose of this section constitute \"misbehaviour\" and until such ordinances are made, the expression \"misbehaviour\" shall mean any such act or omission as the Vice-Chancellor may from time to time so designate."
    },
    {
      "provision_ref": "s34",
      "section": "34",
      "title": "Power",
      "content": "34. Power s of Council to suspend students, University activities, etc. Notwithstanding anything contained in section 31 or 32, the Council shall have power to discipline any student, class of students, or all students of the University in such man- ner, whether by way of rustication, expulsion or otherwise, and to suspend the academic and other activities of the University or any part thereof for such period as the Council may deem appropriate, where in the opinion of the Council good order and discipline in the University has been or is likely to be prejudiced by any act or omission on the part of such student or students and the Council is satisfied that the situation so created has not been or cannot be dealt with effectively or at all by the exercise of any other powers to discipline students conferred by the foregoing provisions of this Part: Provided that the Council may suspend the academic and other activities of the University or any part thereof only where the Council, after considering a report in that behalf from the Senate, is satisfied that in the circumstances prevailing at the material time the same cannot continue to be carried on effectively or in the overall interest of the University."
    },
    {
      "provision_ref": "s35",
      "section": "35",
      "title": "Residence of staff and students",
      "content": "35. Residence of staff and students (1) The Council may require that any member of the academic staff or the adminis- trative staff shall live within the University precincts in accommodation provided for the purpose. (2) The Vice-Chancellor may require that any student shall live in a hall of residence provided for the purpose and under such conditions of residence as may from time to time be prescribed by statute or ordinance. (3) The Vice-Chancellor may require that any student shall live outside the Univer- sity within such radius from the University as shall from time to time be prescribed by ordinance or regulation. 36 . Protection of the University ' s estate (1) The Vice-Chancellor shall have responsibility for ensuring that peace and order are maintained within the precincts of the University's estate and it shall be lawful for the Vice-Chancellor to take such action at all times as he may deem necessary or expedient to maintain peace, protect property and promote and protect the safety and welfare of the students and staff resident within the estate. (2) Provision may be made by ordinance for the purpose of any of the matters men- tioned in subsection (1) of this section. PART VI Financial provisions"
    },
    {
      "provision_ref": "s37",
      "section": "37",
      "title": "Finance and General Purposes Committee",
      "content": "37. Finance and General Purposes Committee (1) The Council shall appoint a committee of the Council to be known as the Finance and General Purposes Committee which, subject to the directions and supervision of the Council, shall exercise control over the property and expenditure of the University and perform such other functions of the Council as the Council may from time to time dele- gate to it. (2) The constitution of the Finance and General Purposes Committee and its func- tions shall be such as may be prescribed by statute."
    },
    {
      "provision_ref": "s38",
      "section": "38",
      "title": "Bank accounts",
      "content": "38. Bank accounts The Council shall arrange that all moneys received on account of the University shall be paid into such bank as may be approved by the Council to the credit of one or other of the accounts of the University to be opened with such bank or banks in accordance with the directions of the Council. 39 . Financial year, accounts, etc. (1) The Council shall fix the financial year for the purpose of the accounts of the University. (2) The Council shall cause proper accounts to be kept in respect of each financial year and proper records in relation to those accounts, and without prejudice to any other requirement as to accounting or control, imposed whether by this Law or otherwise, with respect to the finance of and the lands, endowment and other property held by or for the purposes of the University. (3) The accounts of the University for the preceding financial year, including an an- nual statement thereof, shall be prepared in such form and shall contain such information as the Council may from lime to time direct."
    },
    {
      "provision_ref": "s40",
      "section": "40",
      "title": "Annual estimates",
      "content": "40. Annual estimates (1) The estimates of income and expenditure for a financial year shall be presented by the Vice-Chancellor to the Council and may be approved by the Council before the beginning of that financial year: Provided that the Vice-Chancellor may during any financial year present and the Council may approve supplementary estimates of income or expenditure. (2) The annual and supplementary estimates shall be prepared in such form and shall contain such information as the Council may direct."
    },
    {
      "provision_ref": "s41",
      "section": "41",
      "title": "Gifts, donations, etc.",
      "content": "41. Gifts, donations, etc. (1) The Council may on behalf of the University accept by way of grants, gift, testa- mentary disposition or otherwise, property and moneys in aid of the finances of the Uni- versity on such conditions as it may approve. (2) Registers shall be kept of all donations to the University, including the names of donors and any special conditions under which any donation may have been given. (3) All property, money or funds donated for any specific purposes shall be applied and administered in accordance with the purposes for which they are donated and shall be accounted for separately. 42 . G eneral fund of the Uni v er s it y (1)There shall be a general fund of the University which shall consist of the follow-ing- (a) grants-in-aid; (b) fees; (c) income derived from investments; (d) gifts, legacies, endowments and donations not accepted for a particular pur- pose; (e) income derived from the exercise of any functions conferred or imposed on the University by this Law; ( f) all other moneys belonging to the University from whatsoever source derived. (2) The general fund shall be applied for the purposes of the University. 43. A udit (1) The Council shall cause the accounts of the University to be audited by auditors appointed by the Council as soon as may be after the end of each financial year or for any such other period as the Council may require. (2) The appointment and other matters relative to the auditors, their continuance in office and their functions, as the case may be, shall, subject to the provisions of this sec- tion, be prescribed by statute."
    },
    {
      "provision_ref": "s44",
      "section": "44",
      "title": "R",
      "content": "44. R e tirement b e nefit s, sup e r a nnuation , et c . Provision may be made by statute for the contribution by the University to any super- annuation fund or other similar scheme or for the establishment of any other retirement benefits scheme for the benefit of the members of its staff."
    },
    {
      "provision_ref": "s45",
      "section": "45",
      "title": "R",
      "content": "45. R e tiring a ge o f acad e mi c s taff of th e Uni ve r s ity (1) Notwithstanding anything to the contrary in the Pensions Act, the compulsory re- tiring age of an academic staff of a University shall be 65 years. [Cap. P4.] (2) A law or rule requiring a person to retire from the public service after serving for 35 years shall not apply to an academic staff of the University."
    },
    {
      "provision_ref": "s46",
      "section": "46",
      "title": "Spe",
      "content": "46. Spe c ia l provi s ion s relating to pension of profe ss or s A person who retires as a professor having served- (a) a minimum period of fifteen years as a professor in the University or continu- ously in the service of a university in Nigeria up to the retiring age; and (b) who during the period of service was absent from the University only on ap- proved national or University assignments, shall be entitled to pension at a rate equivalent to his last annual salary and such allow- ances, as the Council may, from time to time, determine as qualifying for pension and gratuity, in addition to any other retirement benefits to which he may be entitled. [1993 No. Il.] PART VII Gene r a l p r ov i s i o n s"
    },
    {
      "provision_ref": "s47",
      "section": "47",
      "title": "Exec",
      "content": "47. Exec ution and i ss ue of in s trument s (1) Any contract or instrument which, if entered into or executed into or executed by a person not being a body corporate, would not require to be under seal, may be entered into or executed without being sealed on behalf of the University by any person generally or specially authorised by the University for that purpose. (2) Any document purporting to be one duly executed or issued under the seal of the University or on behalf of the University shall, unless the contrary is proved, be deemed to be a document so executed or issued, as the case may be."
    },
    {
      "provision_ref": "s48",
      "section": "48",
      "title": "Se",
      "content": "48. Se r v i ce of notice s, e tc . Service upon the University of any notice, order or other document may be effected by delivering the same or by sending it by registered post addressed to the secretary of the Council. 49. Re s tricti o n of s uit s and exe cution (1) No suit shall be commenced against the University until at least three months af- ter written notice of intention to commence the same shall have been served on the Uni- versity by the intending plaintiff or his agent; and such notice shall clearly state the cause of action, the particulars of the claim, the name and place of abode of the intending plaintiff and the relief which he claims. (2) For the avoidance of doubt, it is hereby declared that no suit shall be commenced against an officer or servant of the University, in any case where the University is vicari- ously liable for any alleged act, neglect or default of the officer or servant in the perform- ance or intended performance of his duties, unless three months at least has elapsed after written notice of intention to commence the same shall have been served on the Univer- sity by the intending plaintiff or his agent. (3) In any suit against the University, no execution or attachment or process in the nature thereof shall be issued against the University, but any sums of money which may by the judgment of the court be awarded against the University shall, subject to any di- rections given by the court where notice of appeal has been given by the University in respect of the said judgment, be paid by the University from its general fund."
    },
    {
      "provision_ref": "s50",
      "section": "50",
      "title": "Disputes as to appointments, elections, etc.",
      "content": "50. Disputes as to appointments, elections, etc. If any question arises whether any person has been duly appointed, elected, selected, nominated or eo-opted as, or whether any person is entitled to be, a member of the Uni- versity or a member of any authority or other body of the University, the question shall be referred to the Council whose decision thereon shall be final. 51 . Vacancy or defect in appointment, etc., not to invalidate proceeding s No resolution or proceeding of any authority or other body or the University estab- lished by or in pursuance of any provisions of this Law shall be invalidated merely by reason of the existence of a vacancy or of vacancies in the membership of such authority or body or by reason of any defect in the appointment, election, selection, nomination or eo-option of a member thereof or by reason that any person not entitled to do so took part in the proceedings."
    },
    {
      "provision_ref": "s52",
      "section": "52",
      "title": "Committees generally",
      "content": "52. Committees generally (1) The Council, the Senate, the board of any faculty and any body of persons estab- lished by or in pursuance of the provisions of this Law may respectively establish such committees for the purposes of their respective functions as they may think fit. (2) Unless otherwise expressly provided, any committee may consist partly or per- sons who are and partly of persons who are not members of the Council, the Senate or the Board of any faculty or such body of persons established by or in pursuance of the provi- sions of this Law, as the case may be, and any such committee may eo-opt any person to participate in its proceeding but such person shall not have a right to vote on any ques- tion. (3) Subject to the provisions of this Law and the Statutes, the Council, the Senate, the Board of any faculty and such other body of persons established by or in pursuance of the provisions of this Law may respectively, with or without restrictions or conditions, as they think fit, delegate any of their powers and duties to any committee. (4) Except as may otherwise by provided by statutes, ordinances or regulations, the quorum and procedure of any committee shall be such as may be determined by the body establishing the committee."
    },
    {
      "provision_ref": "s53",
      "section": "53",
      "title": "Resignation and reappointments, etc.",
      "content": "53. Resignation and reappointments, etc. (1) Any person who has been or is deemed to have been appointed, elected, nomi- nated or otherwise selected to any office established by or in pursuance of any provisions of this Law, may resign from that office by writing under his hand addressed to the per- son or authority by whom he was or its deemed to have been appointed, elected, nomi- nated or otherwise selected. (2) The resignation of any person from any such office shall take effect either on the date when the writing signifying the same is received by the person or authority to whom it is addressed or by any person authorised by that person or authority to receive it or else on some other date specified therein in that behalf as otherwise permitted by law. (3) Any person who has resigned his office shall, if not disqualified, be entitled to be re-appointed, re-elected, re-nominated or otherwise re-selected to the same. 54. Members of a u thorities and bodies to dec l a r e p erso n a l interests Any member of any authority or other body of the University established by or in pur- suance of any provisions in this Law who has a personal interest in any matter proposed to be considered by that authority or body shall forthwith disclose such interest to the authority or body and shall not vote or otherwise participate in any decision on any ques- tion relating to that matter. 55. Preliminary investigation in respect of land required by the University (1) Whenever it appears to the University that any land in the State is likely to be re- quired for its purposes, the University may, by its servants and agents, together with all necessary workmen, enter upon any such land and- (a) (i) survey and take levels of the land; (ii) dig or bore under the sub-soil; and (iii) do all other acts necessary, to ascertain whether the land is adapted for such purposes; (b) clear, set out and mark the boundaries of the land in respect of which it is pro- posed to make an application under subsection (1) of section 56: Provided that no such agent, servant or workman shall enter any land (except with the consent of the occupier thereof) unless at least seven days' notice of the intended en- try has been given to such occupier. (2) As soon as conveniently may be after any entry made under subsection (l) of this section, the University shall pay compensation for all damage arising out of the exercise of any power conferred by that subsection. (3) In the case of any dispute as to the amount of any compensation payable under this section the amount may be determined by the High Court or a magistrate's court having jurisdiction in respect of the place where the land is situated. 56. C ompul s or y acquisition of land (1) Whenever there is any hindrance to acquisition by the University of any land re- quired for its purpose, including any failure by the University to reach agreement as to the amount to be paid in respect of the acquisition, the President, upon the application of the University and after such inquiry as he may think fit, may declare that the land is re- quired for the purpose of the University. (2) Upon such declaration being made, the land to which it relates shall be deemed to be land required for a public purpose of the State within the meaning of the Land Use Act, and the President may cause action to be taken by the appropriate authority for the purpose of acquiring the land for the Government of the Federation. [Cap. L5.] (3) Where any land which has been the subject of a declaration under subsection (l) of this section has been acquired, the appropriate authority may vest such land in the University by means of a certificate under its hand and seal: provided that the University shall not sell, demise, mortgage, charge or otherwise alienate any land or any interest in any land vested in the University under the provisions of this subsection without the prior approval of the President. (4) The compensation, if any, payable under the Land Use Act, for the acquisition of any land under this section shall, in the first instance, be paid by the Government of the Federation but the Government may require the University to refund to the Government any compensation so paid and all incidental expenses incurred by the Government. [Cap. L5.] In this section- \"the appropriate authority\" means the authority having power under the Land Use Act to acquire land for public purposes of the Federation."
    },
    {
      "provision_ref": "s57",
      "section": "57",
      "title": "Exemption from stamp duties and registration fees",
      "content": "57. Exemption from stamp duties and registration fees Stamp duties and registration fees under the provisions of the Stamp Duties Act shall not be payable in respect of any transfer of any property, rights or liabilities to the Uni- versity. [Cap. S9.]"
    },
    {
      "provision_ref": "s58",
      "section": "58",
      "title": "Power to make proposals for amendment of Law",
      "content": "58. Power to make proposals for amendment of Law (1) The Council may at any time make to the Government of the State proposals for amendments in this Law by a special resolution passed in that behalf. (2) A \"special resolution\" shall mean a resolution of which at least 21 days' notice has been given, passed at one meeting of the Council and confirmed at a subsequent meeting held not more that three months after the former: Provided that the resolution be passed at each meeting by a majority of not less than three fourths of the members present and voting."
    },
    {
      "provision_ref": "s59",
      "section": "59",
      "title": "Statutes, ordinances and regulation",
      "content": "59. Statutes, ordinances and regulation s exempted from interpretation s tatutes Nothing in the interpretation laws shall have effect with reference to the making and operation of statutes, ordinances and regulations made in pursuance of this Law, but the powers conferred by this Law to make statutes, ordinances and regulations are, for the avoidance of doubt, hereby declared to include powers to amend, revoke and replace the same. PART VIII Tran s iti o n a l pr ov i s i o n s"
    },
    {
      "provision_ref": "s60",
      "section": "60",
      "title": "Continuation of existing Council and Senate until replaced",
      "content": "60. Continuation of existing Council and Senate until replaced The Provisional Council and the Senate established by the University of Ife (Provi- sional Council) Law, 1961 and in being immediately before the appointed day, shall as from the appointed day, be deemed to be the Council and the Senate of the University respectively until they are replaced in office by a new Council and a new Senate constituted in accordance with such provisions as may be made in that behalf in or by virtue of this law. 61 . Continuation in office of Chancellor and other officers and s taff of the Univer s it y (1) Any person who held office as Chancellor, chairman of the Provisional Council (in this Law designated as the Pro-Chancellor), Vice-Chancellor, Deputy Vice- Chancellor, Registrar, Librarian, Bursar, Dean, Vice-Dean or Sub-Dean of a Faculty, Director of an Institute, Head of a Department, member of any Faculty Board, Board of Studies, committee of joint committee or of any other authority or body of the University as it existed immediately before the appointed day, shall, as from the appointed day, be deemed to have been appointed, elected, nominated or otherwise selected thereto, as the case may be, under or by virtue of this Law, and shall continue in such office until such time as the tenure thereof may be determined in accordance with any such provisions or arrangement as may be made or be deemed to have been made in that behalf in or by virtue of this Law. (2) Any person (not being a person with respect to whom subsection (1) of this sec- tion applies) who held office as a member of the academic staff, the administrative staff or other staff or agent of the University as it existed immediately before the appointed day, shall, as from the appointed day, be deemed to have been appointed thereto under or by virtue of this Law, and shall hold such appointment until such time as the tenure thereof may be determined in accordance with any such provisions or arrangement as may be made or be deemed to have been made in that behalf in or by virtue of this Law. (3) For the avoidance of doubt, it is hereby declared that any term or period for which any person had served in any office or post immediately before the appointed day shall be taken into account for the purpose of determining the term or period for which he is eli- gible to serve in such office or post under or by virtue of this Law. 62. T ran s itional provision s relating to faculties, boards, department s The faculties, Faculty Boards, boards of studies, departments, institutes and other units of learning and research of the University as it existed immediately before the ap- pointed day, shall, as from the appointed day, be deemed to be the faculties, Faculty Boards, boards of studies, departments, institutes and other units of learning and research of the University until the same may be re-constituted or replaced in accordance with the provisions of this Law which shall apply in relation to them accordingly. 6 3. T ransitional provi s ions relating to graduates, s tudents , examinations, degree s , e tc . , o f th e Universit y All graduates and students of the University as it existed immediately before the ap- pointed day, and all periods of study for any degree or other qualification, and all exami- nations, degrees, diplomas, certificates, fellowships, scholarships, studentships, exhibi- tions, bursaries, prizes, medals and other academic titles and distinctions accepted, rec- ognised, granted or awarded, as the case may be, by the same, shall, as from the ap- pointed day, be deemed to be graduates and students of the University and periods of study, examinations, degrees, diplomas, certificates, fellowships, scholarships, student- ships, exhibitions, bursaries, prizes, medals and other academic titles and distinctions accepted, recognised, granted or awarded, as the case may be, by the University, and the relevant provisions of this Law shall apply in relation to them accordingly."
    },
    {
      "provision_ref": "s64",
      "section": "64",
      "title": "Transfer of land acquired by the Government for the University",
      "content": "64. Transfer of land acquired by the Government for the University (1) As from the appointed day, all that parcel of land described in subsection (2) of this section acquired by the Government of the Western State of Nigeria shall without further assurance vest in fee simple absolute in the University. (2) The parcel of land referred to in subsection (1) of this section is all that parcel of land acquired by the Government of the Western State of Nigeria by virtue of Western Nigeria Notice No. 392 dated the 13th day of March, 1961, and published at page 208 of the Western Nigeria Ga ze tt e No. 13, Volume 10 dated the 16th day of March, 1961, as amended by Western Nigeria Notice No. 315 dated the 25th day of May, 1964, and pub- lished at page 204 of the Western Nigeria Ga ze tt e No. 17, Volume 14, dated the 8th day of April, 1965, the Certificate of Title for which is dated 21 st September, 1965, and filed in the Land Registry, Ibadan, as No. 9 at page 9 in Volume 822."
    },
    {
      "provision_ref": "s65",
      "section": "65",
      "title": "Transfer to the University of the property and liabilitie",
      "content": "65. Transfer to the University of the property and liabilitie s of the Provi s ional Council (1) All property vested in the Provisional Council immediately before the appointed day, shall, as from the appointed day, vest in the University by virtue of this Law, and without further assurance, and as from the appointed day, the University shall have all rights and be subject to all liabilities which the Provisional Council had or 10 which it was subject immediately before the appointed day. (2) Subject to the provisions of this Law, every deed, agreement or other instrument or any arrangement whatsoever to which the Provisional Council either by itself or through any other authority or person was a party immediately before the appointed day, shall, as from the appointed day have effect as if- (a) the University had been a party to the same; (b) for any reference to the Provisional Council, other authority, or person, there were substituted, in respect of anything falling to be done on or after the ap- pointed day, a reference to the University. (3) Where, by the operation of any of the foregoing provisions of this section, any property, right or liability becomes the property, right or liability of the University, the University and all other persons shall, as from the appointed day, have the same rights and powers (and in particular the same rights and powers as to the taking or resisting of legal proceedings) for ascertaining, perfecting, protecting or enforcing that property, right or liability of the University and any legal proceedings by or against the Provisional Council pending on the appointed day in respect of such property, right or liability may be continued by or against the University. (4) Nothing in this section shall be construed as purporting to derogate from the pro- visions of any Federal law relating to the transfer or vesting of any class of property, right or liability in the University either on the appointed day or so soon as may be thereafter, and upon such vesting the provisions of this section relating to the consequence of the vesting of property, rights or liabilities shall have effect accordingly. (5) For the avoidance of doubt, it is hereby declared that the provisions of subsection (1) of this section shall apply to the property of the Council of the Nigerian College of Arts, Science and Technology vested in the Provisional Council by virtue of subsec- tion (2) of section 3 of the Nigerian College of Arts, Science and Technology (Transfer) Act, 1962. (1962 No. 3.) (6) In this section- \" property\" without prejudice to the generality of its meaning, includes lands, build- ings and appurtenances, investments, funds, loans, and accounts receivable, liens, claims and rights. 66. Repeal of Law No. 6 of 1961 The University of He (Provisional Council) Law, 1961, is hereby repealed. FIRST SCHEDULE [(Section 14 (2).) ] T h e F ir s t C ha nce ll o r , P r o - C h a n ce ll o r and Vi ce -Chan ce ll o r o f th e Univ e rsit y Chancellor: Chief Obafemi Awolowo, B Com, LLB, Hon LL D, Hon DSC (Econs), Barrister-at-Law. Pro-Chancellor: Chief Thompson Tanimowo Solaru, MA, BD. Vice-Chancellor: Hezekiah Adedunmola Oluwasanmi, BA, MA, PhD. SECOND SCHEDULE (Section 42 (2).) T h e S tatut es o f th e U ni ve r s it y STATUTES 1. Definitions. Members of the University. The officers of the University. The Chancellor. The Pro-Chancellor. The Vice-Chancellor. The Deputy Vice-Chancellor. Office of the registrar. Other principal officers ofthe University. Selection board for other principal officers. 11. Auditors. 12. The Council. STATUTES The Finance and General Purposes Committee. The Senate. The faculties. The Institute of Administration. Boards of Studies. The Congregation. Convocation. Honorary degrees. Appointment of staff. Appointments by Joint Committee of the Council and the Senate. Removal of officers, members of the Council and staff and auditors from office, Service of notices and documents. STATUTE I D efi niti ons 1. In these Statutes- (a) \" the Law\" means the Obafemi Awolowo University Law; (b) words used shall have the same meaning as in the Law. 2 . Words defined in the Law and the Statutes shall, unless the context otherwise requires, have the same meaning in the Ordinances and in the Regulations. STATUTE 2 M e mb e r s o f t h e U ni ve r s it y 1. The Members of the University shall be- (a) the officers of the University; (b) the members of the Council; (c) the members of the Senate; (d) the members of the academic staff; (e) the graduates; (f) the students; and ( g) such other persons as may by statute be granted the status of members. 2. A person shall remain a member of the University only so long as he is qualified for such membership under any of the sub-paragraphs of paragraph I of this Statute. STATUTES 3 T h e officers of the Universit y The officers of the University shall be- (a) the Chancellor; ( b ) the Pro-Chancellor; (c ) the Vice-Chancellor; ( d) the Deputy Vice-Chancellor; (e ) the Director of the Institute of Administration; (f) the Registrar; (g ) the Librarian; (h) the Bursar; and (i) such other persons as may by statute be granted the status of officers. STATUTE 4 The Chan ce ll o r The Chancellor shall be appointed by the President, after consultation with the Council. The Chancellor shall have such functions as may be prescribed by law and shall hold office for five years or until he resigns, or he is removed from office in accordance with Stat- ute 21, and unless so removed he shall be eligible for re-appointment for a second term only. 3 . The Chancellor may, unless where the context does not so permit, delegate any of his functions in writing to the Pro-Chancellor: Provided that any such delegation shall be revocable at will and shall not preclude the Chancellor from exercising any of his functions. 4 . The Chancellor may request information concerning the general conduct of the affairs of the University from the Pro-Chancellor and the Vice-Chancellor whose duty it shall be to pro- vide the same. STATUTE 5 Th e Pr o- Ch a n ce l lor 1 . The Pro-Chancellor shall be appointed by the President, after consultation with the Coun- cil. 2. The Pro-Chancellor shall hold office for a period of four years or until he resigns or he is removed from office in accordance with Statute 21, and unless so removed, he shall be eli- gible for re-appointment for a second term only. 3. The Pro-Chancellor shall be the chairman of the Council and shall preside at its meetings, and perform such other functions as may be prescribed by law. [1993 No. 11.] 4. The Pro-Chancellor may, at the request of the Chancellor, exercise for the Chancellor any functions specially delegated in writing to him by the Chancellor other than the conferring of degrees or other academic titles or distinctions of the University. STATUTE 6 The Vi ce - C han c ellor (1) There shall be a Vice- Chancellor of the University who shall be appointed by the President in accordance with the provisions of this Statute. [1993 No. 11.] (2) Where a vacancy occurs in the post of a Vice-Chancellor, the Council shall- (a) advertise the vacancy in a reputable journal or a widely read newspaper in Ni- geria, specifying- (i) the qualities of the persons who may apply for the post; and (ii) the terms and conditions of service applicable to the post, and thereafter draw up a short list of suitable candidates for the post for consideration; ( b ) constitute a Search Team consisting of- (i) a member of the Council, who is not a member of the Senate, as chairman; (ii) two members of the Senate who are not members of the Council, one of whom shall be a professor; (iii) two members of Congregation who are not members of the Council, one of whom shall be a professor, to identify and nominate for consideration, suitable persons who are not likely to apply for the post of their own volition because they feel that it is not proper to do so. (3) A Joint Council and Senate Selection"
    }
  ],
  "definitions": [
    {
      "term": "academic y e ar",
      "definition": "such period not exceeding twelve consecutive months as the Senate may from time to time so designate",
      "source_provision": "s2"
    },
    {
      "term": "the appointed day",
      "definition": "the day on which this Law comes into force",
      "source_provision": "s2"
    },
    {
      "term": "Congregation",
      "definition": "the Congregation of the University established by section 21 of this Law",
      "source_provision": "s2"
    },
    {
      "term": "Convocation",
      "definition": "an assembly of the University established by section 22 of this Law",
      "source_provision": "s2"
    },
    {
      "term": "the Council",
      "definition": "the Council of the University established by section 15 of this Law",
      "source_provision": "s2"
    },
    {
      "term": "functions",
      "definition": "powers and duties",
      "source_provision": "s2"
    },
    {
      "term": "graduate",
      "definition": "a person on whom a degree, other than an honorary degree, has been conferred by the University and any other person as may be designated as a gradu- ate by the Council, acting in accordance with the recommendation of the Senate",
      "source_provision": "s2"
    },
    {
      "term": "Graduates Association",
      "definition": "any association recognised by the Council pursuant to the provisions of this Law or the Statutes",
      "source_provision": "s2"
    },
    {
      "term": "prescribed",
      "definition": "prescribed by this Law, or by statutes, ordinances or regulations of the University",
      "source_provision": "s2"
    },
    {
      "term": "professor",
      "definition": "a person appointed to be a professor in the University and in- cludes a visiting professor",
      "source_provision": "s2"
    },
    {
      "term": "Provisional Council",
      "definition": "the Provisional Council established under the Univer- sity of Ife (Provisions Council) Law, 1961",
      "source_provision": "s2"
    },
    {
      "term": "Regulations",
      "definition": "any Regulations of the University made by the Senate pursuant to the provisions of the Law or the Statutes",
      "source_provision": "s2"
    },
    {
      "term": "the Senate",
      "definition": "the Senate of the University established by section 16 of this Law",
      "source_provision": "s2"
    },
    {
      "term": "Statutes",
      "definition": "the Statutes of the University set out in the Second Schedule to this law or made hereafter under the provisions of this Law",
      "source_provision": "s2"
    },
    {
      "term": "s tudent",
      "definition": "a person who has been registered as a student of the University during a current academic year for a first or higher degree, diploma, certificate or such other qualification of the University as may be approved by the Senate as qualifying a person for the status of a student",
      "source_provision": "s2"
    },
    {
      "term": "teacher",
      "definition": "a person appointed as a member of the staff of the University on full-time or part-time teaching duties and shall include such persons employed on re- search duties in the University as are required also to teach",
      "source_provision": "s2"
    },
    {
      "term": "undergraduate",
      "definition": "a person registered as a student undergoing a course of studies for a first degree of the University as may be approved by the Senate as qualifying a student undergoing it for the status of an undergraduate",
      "source_provision": "s2"
    },
    {
      "term": "the University",
      "definition": "Obafemi Awolowo University, Ife established and incorpo- rated by section 3 of this Law. PART II Establishment, incorporation and functions of the University",
      "source_provision": "s2"
    }
  ]
}