{
  "id": "oil-and-gas-export-free-zone-act",
  "type": "statute",
  "title": "OIL AND GAS EXPORT FREE ZONE ACT",
  "title_en": "OIL AND GAS EXPORT FREE ZONE ACT",
  "short_name": "OIL AND GAS EXPORT FREE ZONE ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=423",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Import duty tariff rebate for special products imported into the free zone",
      "content": "1. Import duty tariff rebate for special products imported into the free zone As from the commencement of this Order, any special product imported into the free zone under the Act- (a) on which value has been added without changing the essential character of the product after processing in the free zone; and (b) intended for the customs territory, shall be granted an import duty tariff rebate of 75 percent."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "Interpretation In this Order, unless the context otherwise requires- \" Act \" means the Oil and Gas Export Free Zones Act, 1996; \" customs territory\" means the territory within the Federal Republic of Nigeria other than the area designated as the oil and gas free zone under the Act; \"free z one \" means the oil and gas free zone designated under the Oil and Gas Export Free Zone Act; [1996 No. 8.] \"special product\" means any article or item imported into the free zone on which value has been added without changing the essential character of the product after processing; \"value\" means any additional process added on a product. Citation This Order may be cited as the Oil and Gas Export Free Zone (Special Import Provi- sions) Order 2003. OIL AND GAS EXPORT FREE ZONE REGULATIONS, 2003 ARRANGEMENT OF REGULATIONS PART I Ad mini s tr a ti o n and P owe r s of th e F r ee Zo n e REGULATION 1. Functions of the Free Zone Authority. Exemption from taxes, rates, etc. Incentives to Free Zone investors. Movement of goods in and out of the Free Zone. Processing of goods in the Free Zone. Registration of vehicles. Possession of driver's licence. Customs, Police and Immigration. Customs procedures. Security in the Free Zone. 11. Free Zone tariffs. 12. Applicable laws. 13. Arbitration and settlement of disputes. 14. Legal proceedings. 15. Restriction on non-Nigerian employee. 16. Health, safety and environmental control. PART II P roce dur es for Imp or tin g , Ex p o rtin g and M o v e m e n t of Goo d s General procedures for importing goods into the Free Zone. Procedures for importing goods into the Free Zone by sea. Procedures for importing goods into the Free Zone by air. Procedures for importing goods into the Free Zone by road. Cargo track inventory system. Exporting goods from the Free Zone into the Customs Territory. Customs Scheduling System. Exporting goods overseas by sea. REGULATION Export of goods overseas by air. Goods from the Customs Territory for repairs or maintenance in the Free Zone. Repairs and maintenance of goods in the Free Zone from the Customs Territory for export. Goods for repairs or maintenance in the Customs Territory from the Free Zone. Procedures for transferring goods between licensees. Procedures for transferring goods from a Free Zone to another. PART III Li ce n s in g of Bus in ess E ntiti es w ithin th e Free Zo n e Form of application for licence. Types of licences. Free Zone enterprise licence. Continuing obligations of a licensee. Renewal of licence. Premises. Amendment, withdrawal, revocation and surrender. Annulment of an operational licence. Licence fees. PART IV F r ee Zo n e E nt e r pr i ses P r oce dur es Formation of Free Zone enterprises. Issuance of certificate. Share Capital. Name of a Free Zone enterprise. Registered address of a Free Zone enterprise. Sign-name plate. Correspondence, etc. PART V Ba nkin g Proce dur es 47. Banking activities in the Free Zone. PART VI H e alth , Sa f e t y an d E n v ir o nm e nt 48. Management of health, safety and environmental matters within the Free Zone. PART VII Plannin g a n d Co n s tru c ti o n Pr oce dur es 49. Acquisition of land. PART VIII Misce ll aneous REGULATION Immigration procedures. Guidelines. Interpretation. Citation. OIL AND GAS EXP OR T F R EE ZONE R EGULATIONS, 2003 [S.1. 12 of2003.] [5 th December , 2003] [ Commencement.] PART I Administration and Powers of t h e Free Zone F u nctio n s of t h e Free Zone Aut h ority The Administration of the Free Zone is vested in the Authority, which in exercise of its functions shall have power to delegate some of its functions as it may, from time to time, determine. Exemptio n f r om taxes, rates, etc. (1) A licensee shall, in connection with its operations in the Free Zone, be exempted from payment of all Federal, State or Local Government taxes and rates, including stamp duties. (2) A licensee or any other entity entitled to an exemption from payment of taxes un- der these Regulations shall, be exempted from providing, filing or submitting any docu- ments or information which but for these Regulations would be required by any Ministry or any other Government agency, excluding the Authority for the purpose of assessing or charging such taxes or duties. (3) The Authority shall, on request from any Ministry or Government agency, ex- cluding the Authority, provide a copy of the current licence of a licensee or entity entitled to an exemption under these Regulations."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Incentives to Free Zone investors",
      "content": "Incentives to Free Zone investors (1) A licensee shall not be subject to foreign exchange regulations in connection with its operations in the Free Zone. (2) A licensee may repatriate any foreign capital invested in the Free Zone at any time together with capital appreciation thereon. (3) Any profits and dividends derived by investors from operations in the Free Zone may be remitted overseas at any time. (4) A licensee operating in the Free Zone shall be entitled to--- (a) up to 100 percent foreign ownership of any business in the Free Zone; (b) up to 100 percent foreign management of any business in the Free Zone. (5) A licensee shall not require any import or export licence in connection with im- port or export from the Free Zone. (6) Any products manufactured, assembled or pre-packaged and sold in the Free Zone shall be- (a) registered in accordance with the provisions of these Regulations; and (b) sold in the Customs Territory subject to the tariffs and other charges prescribed by the appropriate authorities. (7) Notwithstanding the provisions of regulation 3, subregulation (6) of this regula- tion, the percentage of any products or goods manufactured, assembled, pre-packaged in the Free Zone and sold in the Customs Territory shall be unlimited. (8) Foreign personnel employed by a licensee in the Free Zone shall not be subject to the immigration quota system. (9) Goods brought into the Free Zone by a licensee, for consumption by the licensee in the normal course of its business within the Free Zone shall not attract any taxes or duties whatsoever."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Mo",
      "content": "Mo v ement of goods in and out of the Fr e e Zone (1) The Authority shall have the power to take over Free Zone goods abandoned in the Free Zone and dispose of them in any manner it may deem fit. (2) Where any goods or properties have been declared abandoned and the owner or person who ought to be in possession of them discarded them and is indifferent as to what becomes of them, any costs incurred by the Authority in removing the abandoned goods shall, be refunded on demand by the licensee or owner of the abandoned goods, as the case may be."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Proces",
      "content": "Proces s ing of goods in the Free Zone Goods brought into the Free Zone by a licensee or transferred to the licensee by an- other licensee in the Free Zone may, subject to the licensee holding an appropriate li- cence, be broken up, sorted, graded, packed, cleaned, marked, remarked, loaded, un- loaded, divided, mixed, separated or otherwise worked or reworked by the licensee."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "R",
      "content": "R e gi s tration of vehicles Registration of vehicles in the Free Zone shall be in accordance with the rules and regulations set out by the Authority, the Federal Road Safety Corps and the Free Zone Customs Command."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Possession of driver's licence",
      "content": "Possession of driver's licence A driver of a vehicle in the Free Zone shall possess- (a) a valid driver's licence issued by the Federal Road Safety Corps and the driver's licence shall be appropriate for the required class of vehicle; or (b) an international driver's licence issued by an appropriate authority and duly verified by the Authority and the Federal Road Safety Corps."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Cu",
      "content": "Cu s toms , Police and Immigration Dedicated Free Zone Customs, Police and Immigration Commands shall be estab- lished to deal with all aspects of the movement of goods and personnel in and out of the Free Zone."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Customs procedures",
      "content": "Customs procedures Without prejudice to the provisions of the Act and these Regulations, the following Customs procedures shall apply in the Free Zone- (a) goods released into the Customs Territory shall be classified as imports and be subject to all applicable taxes, duties and levies; (b) goods released from the Customs Territory into the Free Zone shall be classi- fied as exports into the Free Zone; (c) equipment and consumables to be used in the construction of facilities in the Free Zone, may be imported into the Free Zone by a licensee free of any taxes, duties or levies. 10 . Security in the Free Zone The Authority shall provide security for the properties, premises and facilities of the Authority, while the Nigeria Ports Authority shall provide security for its own properties, premises and facilities in the Free Zone."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Free Zone tariffs",
      "content": "11. Free Zone tariffs The Authority shall issue a schedule of tariffs which shall apply in the Free Zone and which shall be reviewed, from time to time and copies made available to the licensees or operators."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Applicable laws",
      "content": "12. Applicable laws In addition to the provisions of the Act or these Regulations or circulars or any Order applicable in the Free Zone, all other relevant laws applicable in the Customs Territory shall apply in the Free Zone."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Arbitration and settlement of disputes",
      "content": "13. Arbitration and settlement of disputes (1) Any dispute arising between licensees in the Free Zone which cannot be settled amicably shall, be referred by either of the parties to the Authority for settlement and the decision of the Authority on the matter shall be communicated to the parties accordingly. (2) Any dispute arising between a licensee and any Government agency in the Free Zone shall, be referred to the Authority by, either of the parties concerned and the Au- thority shall represent the licensee in all negotiations, arbitration, settlement and recon- ciliation of the dispute. (3) The Arbitration and Conciliation Act shall apply in respect of regulation 13, sub- regulation (2) of this regulation. [L.F.N. 2004 Cap. A 18.] (4) Any dispute arising between any licensee and the employees which cannot be set- tled amicably between the parties shall, be referred to the Authority, which shall take all necessary steps to reach a settlement between the parties. (5) In all the cases in sub regulations (1) to (4) of regulation 13 of this regulation, the Authority reserves the right to intervene at any stage in the dispute without prior notice to the parties involved, in order to settle the dispute and maintain industrial peace in the Free Zone."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Legal proceedings",
      "content": "14. Legal proceedings A licensee shall take out litigation or defend any suit through the Authority and the Authority shall take appropriate measures to protect the rights of the licensee in the suit."
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Restriction on non",
      "content": "15. Restriction on non - Nigerian employee A non-Nigerian employee of any licensee shall not accept employment outside the Free Zone or offer the same services outside the Free Zone without the prior consent and approval of the Authority in accordance with applicable laws. 16 . Health, safet y and environmental con t rol A licensee shall, observe the relevant measures necessary for the protection and pres- ervation of the Free Zone environment and the immediate host community, in accordance with the relevant Federal Laws on health, safety and environmental control. PART II P rocedur e fo r Imp o rtin g , Expor t i n g a n d Move m e nt of Goods"
    },
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "General procedure",
      "content": "17. General procedure s for importing goods into the Free Zone (1) Goods shall be imported into the Free Zone in accordance with the following procedures- (a) the supplier of the goods shall, ensure that the Bill of Lading or airwaybill, invoices and packing list are itemised with their prices; (b) the manifest of the vessel or the aircraft relating to the goods shall be clearly marked with the words \"Free Zone Status\" for goods to be discharged at the Free Zone; (c) the licensee shall observe the following procedures in relation to the Bill of Lading or airwaybill, (in this regulation referred to as the \"Bill\")- (i) the Bill shall indicate that the consignee of the goods is the licensee and specify the licensee's address as Oil and Gas Free Zone, Onne, On ne Port Complex, Rivers State, Nigeria; (ii) where a bank has a lien on the goods shipped into the Free Zone, the Bill shall be consigned to the bank but shall bear the marks and num- bers of the Free Zone; (iii) in sea shipments, the port of discharge shall be specified on the Bill as Onne Port Complex and where the goods are to be discharged at a port other than Onne Port Complex, it shall be specified on the Bill and the final port of discharge shall be specified as \"Oil and Gas Free Zone, Onne, Rivers State; and (iv) in air shipments, the airport of final destination shall be specified on the Bill as \"Port Harcourt International Airport; (d) the licensee shall complete Form M prior to or on entering the Customs Terri- tory and to be entitled to a waiver of pre-shipment inspection, when complet- ing the Form M, the country of supply shall be specified as \"Oil and Gas Free Zone, Onne, Port-Harcourt, Rivers State; (e) the identification and address of the consignee contained in the manifest, Bill, invoice and packing list shall be specified as \"Oil and Gas Free Zone, Onne, Port-Harcourt, Rivers State; (f) the Authority shall require the shipping line or airline to provide separate manifest of goods to be discharged in the Free Zone; (g) the shipping line shall provide a manifest for the Authority seven days before the arrival of a vessel and in the case of an aircraft, the manifest shall be pro- vided, prior to or upon arrival of the aircraft and the manifest shall be delivered to the Authority in an envelope duly sealed with wax; (h) a licensee shall provide to the Authority, prior to the arrival of goods or upon shipment either by electronic means or otherwise, certified true copies of in- voices, packing list and the Bill; (i) the licensee shall comply with the specific procedures for importing goods into the Free Zone by air, sea or road freight, as the case may be; (j) the Transfer Request or Request to Transfer under Customs Escort shall, be delivered to the Terminal Operator who shall transfer the goods from the quay- side to the dedicated Free Zone stacking area or a common stacking area and thereafter, the Transfer Request or Request to Transfer under Customs Escort shall be signed by the Terminal Operator and returned to the Authority; and (k) where the goods are delivered by the Terminal Operator to a dedicated Free Zone stacking area, he shall be rei ieved of any shipping line liability on behalf of the owner of the goods and the liability shall pass on to the Authority."
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "Procedures for importing goods into the Free Zone",
      "content": "18. Procedures for importing goods into the Free Zone by sea Goods shall be imported into the Free Zone by sea in accordance with the following procedures- (a) the commercial invoice relating to the goods shall specify the value of the in- surance, cost of the goods and freight; (b) a licensee shall complete a Transaction Request Order Form and deliver it to the Authority together with a copy of each of the following documents- (i) Commercial Invoice; (ii) Bill of Lading; (iii) Packing List; and (iv) Attested invoice (Form C 16); (c) the Authority may after the verification of the licensee's documents referred to in paragraph (b) of this regulation, forward a transfer request to the Free Zone Customs Command and the Nigerian Ports Authority office in the Free Zone; (d) the Free Zone Customs Command and Nigerian Ports Authority office in the Free Zone may each issue a transfer request order to the Shipping Agent and Terminal Operator to release the goods; (e) the Transfer Request Order issued under paragraph (d) of this regulation shall be marked with the stacking address of the cargo and a stock reference number; (f) the licensee shall apply in writing to the Authority, to transfer any of its Free Zone goods upon discharge from the vessel or aircraft to the Free Zone; (g) the licensee shall be liable to pay all Nigerian Ports Authority fees and charges; (h) the licensee shall be entitled to the ship agent's Delivery Order, on the presen- tation of a Transfer Request Order and the payment of ship agent's charges; (i) the licensee shall present the ship agent's Delivery Order to the Terminal Op- erator and Nigerian Ports Authority office in the Free Zone for, the purposes of transferring the goods from the quayside to the Free Zone. 19 . P r o c e dur es fo r i mp o r t in g goo d s int o t h e F r ee Zo n e by a i r (1) Goods shall be imported into the Free Zone by air, in accordance with the follow- ing procedures- (a) the commercial invoice relating to the goods shall specify the value of the in- surance, cost of the goods and freight; (b) the licensee shall apply in writing to the Authority to, transfer under Customs Escort any of its goods to the Free Zone at the expense of the licensee; (c) upon the receipt of a cargo advice from the airline, the licensee shall collect all the documents relating to the goods as follows- (i) Commercial invoice; (ii) Airway bill; and (iii) Packing list; (d) the Authority may, after the verification of the licensee's documents referred to in paragraph (c) of this subregulation, forward a transfer request to Nigeria Customs Service, Airport Command and Nigerian Aviation Handling Company; (e) the Authority shall, subject to the payment of the airline charges and the pres- entation of Customs Transfer Request Order, obtain a Delivery Order which shall be presented to the Nigerian Aviation Handling Company for the release of the goods; ( f) the goods released by the Nigerian Aviation Handling Company shall, be tal- lied and reconciled with the manifest by the Nigeria Customs Service and the Airport Command, which shall issue a landing certificate to the Customs Es- cort for verification by the Free Zone Customs Command; (g) the landing certificate issued pursuant to paragraph (f) of this subregulation shall, bear a label of the stacking address of the cargo and a stock reference number issued by the Authority and a copy of the landing certificate shall be issued to the Nigerian Ports Authority. (2) The airline shall, provide a separate manifest of all Free Zone cargo, and such a manifest shall be made available by print or electronic transmission to the Authority, prior to or upon arrival of the aircraft."
    },
    {
      "provision_ref": "s20",
      "section": "20",
      "title": "Procedures for importing goods into the Free Zone by road",
      "content": "20. Procedures for importing goods into the Free Zone by road Goods shall be imported into the Free Zone by road in accordance with the following procedures- (a) the commercial invoice relating to the goods shall, specify the value of the insurance, cost of the goods and freight; (b) the licensee shall, apply in writing to the Authority to transfer under Customs Escort, any of its goods to the Free Zone at the expense of the licensee; (c) the application referred to in paragraph (b) of this regulation shall be delivered to the Authority together with a copy of each of the following- (i) Commercial Invoice; (ii) Waybill; and (iii) Packing List; (d) the Authority may, after verification of the licensee's documents referred to in paragraph (c) of this regulation, forward a Transfer Request to the Nigeria Customs Service and the Free Zone Customs Command, which shall issue a Transfer Request Order to the Nigeria Customs Service at the point of entry; (e) the Nigeria Customs Service at the point of entry shall tally and reconcile the waybill with the packing list and issue a landing certificate to the Custom Escort; (f) upon arrival of the goods in the Free Zone, the Free Zone Customs Command shall verify, tally and reconcile the goods with the landing certificate."
    },
    {
      "provision_ref": "s21",
      "section": "21",
      "title": "Cargo track inventory system",
      "content": "21. Cargo track inventory system (1) All deliveries of goods in the Free Zone shall be entered into the Authority's \"cargotrack\" inventory system. (2) The Authority shall issue stock reports, from time to time, showing the movement of goods in the Free Zone. (3) The licensee shall, on demand by the Authority or the Free Zone Customs Com- mand, provide statistical data, delivery and receipt returns and any other information that may be required by the Authority. (4) The Authority and the Free Zone Customs Command shall, at reasonable times have access to the factory, warehouse, assembly plant or any other premises of the licen- see, for the purposes of examining any goods or records of the licensee."
    },
    {
      "provision_ref": "s22",
      "section": "22",
      "title": "Exporting goods from the Free Zone into the Customs Territory",
      "content": "22. Exporting goods from the Free Zone into the Customs Territory Goods shall be exported into the Customs Territory from the Free Zone in accordance with the following procedures- (a) the licensee shall, submit a completed Form M to the bank with the original shipping documents relating to the transfer of the goods into the Free Zone and the country of origin of the goods on the Form M shall be the country where the goods were originally manufactured or produced, while the country of sup- ply shall be Oil and Gas Free Zone, Onne, Port-Harcourt, Rivers State; (b) the licensee shall complete a Transaction Request Order and forward it to the Authority together with copies of the following documents, attested to by the bank- (i) Commercial Invoice; (ii) Form M; (iii) Bill of Lading; (iv) Packing List; and (v) Form C16; (c) the Authority shall request the Free Zone Customs Command and Pre- shipment Inspection Agent to examine, assess, value and classify the goods for importation into the Customs Territory; (d) a joint examination of the goods by the Free Zone Customs Command and the Pre-shipment Inspection Agent shall be carried out and a Clean Report of In- spection issued by the Pre-shipment Inspection Agent; (e) the licensee shall produce a duly executed bank guarantee or bond to the Au- thority and the Free Zone Customs Command, an inspection report duly signed by the Free Zone Customs Command and the Pre-shipment Inspection Agent specifying the duty payable on the goods shall be used for the release of the goods; (f) the licensee or its agent shall present a Clean Report of Inspection together with other relevant documents to the bank for the purposes of payment of duty; (g) the licensee or its agent shall complete the Single Goods Declaration Form attaching the Clean Report of Inspection, invoice, Bill of Lading, Packing List, Form C 16 and the bank pay-in-slip for endorsement and processing and release to the licensee or its agent."
    },
    {
      "provision_ref": "s23",
      "section": "23",
      "title": "Customs Scheduling System",
      "content": "23. Customs Scheduling System (1) The release of goods into the Customs Territory through the Customs Scheduling System shall be in accordance with the following procedures- (a) the licensee shall apply to the Authority for registration under the Customs Scheduling System and the Authority shall endorse and forward it to the Free Zone Customs Command for approval; (b) where approval is granted by the Free Zone Customs Command, the release of the goods shall be entered into a separate cargo tracking system opened by the Authority; (c) the licensee shall provide a bank guarantee or bond to the Free Zone Customs Command for an amount sufficient to cover the duties; (d) the licensee shall submit a Transfer Request Order, a copy of the bank guaran- tee or bond and the Report of Inspection to the Authority, for the release of the goods by the Free Zone Customs Command through the Customs Scheduling System; (e) the Free Zone Customs Command shall issue a Duty Scheduling Release Re- quest Form to the licensee, who shall perfect the Free Zone Customs entry within 14 days of the release of the goods."
    },
    {
      "provision_ref": "s24",
      "section": "24",
      "title": "Exporting goods overseas by sea",
      "content": "24. Exporting goods overseas by sea The licensee shall export goods overseas from the Free Zone by sea in accordance with the following procedures- (a) a licensee shall complete a Transaction Request Order and forward it to the Authority together with copies of the following documents- (i) Commercial Invoice; (ii) Bill of Lading; (iii) Packing List; and (iv) Export Declaration Form; (b) the Authority shall request the Free Zone Customs Command to examine the goods, as well as require the Nigerian Ports Authority to endorse the Export Declaration Form, before the goods are released by the Free Zone Customs Command; (c) the licensee or its agent shall submit the release documents to the shipping line for cargo booking; (d) the Authority shall request the Terminal Operator to deliver the goods to the vessel under the Free Zone Customs Escort; (e) the Free Zone Customs Escort shall present the release documents to the cap- tain of the vessel for endorsement as evidence of shipment of the goods; (f) the Free Zone Customs Escort shall deliver the endorsed release documents to the Authority, Free Zone Customs and Nigerian Ports Authority, for purposes of deleting the goods from the cargo inventory; (g) the licensee shall perfect an Export Bill of Entry for the purposes of effecting final release by the Free Zone Customs Command."
    },
    {
      "provision_ref": "s25",
      "section": "25",
      "title": "Export of goods overseas by air",
      "content": "25. Export of goods overseas by air A licensee shall export goods overseas by air, in accordance with the following procedures- (a) by completing a Transaction Request Order and forwarding it to the Authority, together with copies of each of the following documents- (i) Commercial Invoice; (ii) Air Waybill; (iii) Packing List; and (iv) Export Declaration Form; (b) the Authority shall request the Free Zone Customs Commands to examine the goods, as well as require the Nigerian Ports Authority to endorse the removal Order for the release of the goods; (c) the Authority shall request the Airport Customs Command to approve the re- lease documents for the purposes of the export of the goods; (d) the licensee or its agent shall submit the release documents to the Nigerian Aviation Handling Company which shall endorse the Export Declaration Form; (e) the Authority shall transfer the goods under the Free Zone Customs Escort to the Airport Customs Command and the Nigerian Aviation Handling Company for tallying, reconciliation, verification and delivery on-board the aircraft; (f) the Free Zone Customs Escort shall present the release documents to the cap- tain of the aircraft for endorsement as evidence of air freight of the goods; (g) the Free Zone Customs Escort shall deliver the endorsed release documents to the Authority, Free Zone Customs Command and the Nigerian Ports Authority for the purposes of deleting the goods from the cargo inventory; (h) the licensee or the beneficiary of the services shall perfect an Export Bill of Entry for final release by the Free Zone Customs Command. 26 . Goo d s from the C u sto m s Te rrit o r y f or r e p a ir s or mai nt e n a n ce i n t h e F r ee Zone (1) A licensee or any other person may apply to the Authority for the repairs or main- tenance in the Free Zone of goods situate at or from the Customs Territory. (2) The application for repairs or maintenance of the goods shall be made on a Trans- action Request Order, stating the reasons for such repairs or maintenance. (3) The Authority shall request the Free Zone Customs Command, Pre-shiprnent In- spection Agent and Nigerian Ports Authority to examine the items to be utilised for the repairs or maintenance of the goods. (4) The Pre-shipment Inspection Agent shall issue a Clean Report of Inspection on the goods utilised for the repairs or maintenance, for the purposes of payment of duties. 27. R epai r s a n d m a int e n a n ce o f g o o d s i n th e Free Zone fro m t h e C u s t o m s Terri- tory for export (1) A licensee or any other person may apply to the Authority for, the repairs or maintenance in the Free Zone of goods from the Customs Territory, for purposes of export. (2) The application for the repairs or maintenance of the goods shall be made on a Transaction Request Order, stating the reasons for such repairs or maintenance. (3) The Authority shall request the Free Zone Customs Command and the Nigerian Ports Authority to examine and release the items to be utilised for the repairs and mainte- nance of the goods. (4) Upon the completion of repairs or maintenance, the licensee shall issue an invoice showing the description and value of spare parts and components from the Free Zone stock items, which have been utilised in the repairs or maintenance of the goods. (5) The Authority shall request the Terminal Operator to deliver the goods repaired or maintained on board the vessels or aircraft under Free Zone Customs Escort. (6) The Free Zone Customs Escort shall present the release documents to the captain of the vessel or aircraft for endorsement as evidence of shipment or airfreight of the goods. (7) The Free Zone Customs Escort shall deliver the endorsed release documents to the Authority, Free Zone Customs Command and the Nigerian Ports Authority for the purposes of deleting the goods from the cargo inventory. (8) The licensee or the beneficiary of the services shall perfect an Export Bill of Entry for final release by the Free Zone Customs Command for purposes of export. 28. Coo d s for repai r s or m ai n te n a n ce in th e C u s t o m s T err it o r y fro m th e F r ee Zo n e (1) A licensee may apply to the Authority for the repairs or maintenance of the goods situate at or from the Customs Territory in the Free Zone. (2) The application for the repairs or maintenance of the goods shall be made on a Transaction Request Order, stating the reasons for such repairs or maintenance. (3) The Authority shall request the Free Zone Customs Command and the Nigerian Ports Authority to examine and release the goods from the Free Zone for repairs or main- tenance in the Customs Territory. (4) The goods for repairs or maintenance shall be exported under Free Zone Customs Escort to the Customs Territory. (5) The release documents issued by Free Zone Customs Command shall specify the duration of the repairs or maintenance, the Free Zone Customs Command may extend the duration for the repairs or maintenance. (6) Customs duty shall be charged on any goods not returned within the time limit specified in the release documents, unless an application for an extension of time is made by the licensee and approved by the Free Zone Customs Command. (7) Upon the completion of the repairs or maintenance of the goods, the licensee shall import the goods under the Free Zone Customs Escort into the Free Zone. (8) The Free Zone Customs Command and the Nigerian Ports Authority shall exam- ine, reconcile and verify the repaired or maintained goods imported into the Free Zone. 29. Proced ur es fo r tra n s f err in g goo d s b etwee n li ce n s e es (1) Where a licensee desires to sell goods situate in the Free Zone to another licensee, the licensee purchasing the goods shall complete and submit a Transaction Request Order to the Authority, together with all the relevant documents relating to the goods to be purchased. (2) The procedures relating to exportation of goods from the Free Zone into the Cus- toms Territory set out in regulation 22 of these Regulations shall apply to the transfer of goods between licensees. (3) Where a licensee sells goods situate in the Free Zone to another licensee, the ven- dor licensee shall complete a Transaction Request Order specifying, among other things, that the goods are not for immediate consumption, transfer or export, as the case may be. (4) The Authority shall notify the parties in writing, where the Transaction Request Order is not approved."
    },
    {
      "provision_ref": "s30",
      "section": "30",
      "title": "Procedures for transferring goods from a Free Zone to another",
      "content": "30. Procedures for transferring goods from a Free Zone to another (1) The transfer of goods from a Free Zone overseas to a Free Zone in Nigeria shall, in the normal course of business be regarded as export. (2) Where the transfer of goods is between two Free Zones in Nigeria, the approval of the Authority shall be obtained and the goods shall be transferred under Free Zone Customs Escort. (3) The Free Zone Customs Escort shall deliver the endorsed landing certificate to the Authority, Free Zone Customs Command and Nigerian Ports Authority as evidence of transfer of the goods and for purposes of deleting the goods from the cargo inventory. PART III Licensing of Busin e ss Entities within the Free Zone 31 . Form of application for licence An application for a licence shall be made to the Authority by completing and filing with the Authority, an application form."
    },
    {
      "provision_ref": "s32",
      "section": "32",
      "title": "Types of licences",
      "content": "32. Types of licences (1) Subject to the provisions of the Act and these Regulations, the Authority may, grant an approved applicant one or more of the following licences- (a) a general licence; or (b) a special licence; or (c) a Free Zone enterprise licence. (2) For purposes of obtaining a general licence, an entity shall- (a) hold a valid Certificate of Incorporation, issued by the Registrar of Companies in Nigeria; and (b) have a permit from the Department of Petroleum Resources to operate as an oil and gas service company in Nigeria. (3) For the purposes of obtaining a special licence, an offshore entity shall produce evidence of a notarised Certificate of Incorporation in the country of origin, together with the Memorandum and Articles of Association. (4) An approved Free Zone entity with a special licence shall operate only within the Free Zone."
    },
    {
      "provision_ref": "s33",
      "section": "33",
      "title": "Free Zone enterprise licence",
      "content": "33. Free Zone enterprise licence (1) The Authority may issue a Free Zone enterprise licence to an approved applicant who has satisfied the requirements prescribed by the Authority. (2) For the purposes of issuing a Free Zone enterprise licence, an applicant shall submit its business plan to the Authority for appraisal. (3) An applicant for a grant of a Free Zone Enterprise licence shall produce a bond to the Free Zone Registrar, in accordance with the tariffs prescribed by the Authority. (4) A Free Zone licensee shall operate only within the Free Zone. (5) A Free Zone licence shall specify the activities to be undertaken by the licensee in the Free Zone."
    },
    {
      "provision_ref": "s34",
      "section": "34",
      "title": "Continuing obligations of a licensee",
      "content": "34. Continuing obligations of a licensee A Free Zone licensee shall- (a) at all times, comply with the terms and conditions of the licence and any lease agreement; (b) comply with administrative directives and circulars issued by the Authority, from time to time; (c) comply with the Laws of Nigeria, to the extent in which they are applicable in the Free Zone; (d) submit to the Authority, at such intervals that may be prescribed by the Au- thority, such statistical data, information and returns as regards the audited ac- counts, sales, purchases and other operations of the licensee, as the Authority may require or prescribe, from time to time."
    },
    {
      "provision_ref": "s35",
      "section": "35",
      "title": "Renewal of licence",
      "content": "35. Renewal of licence (1) A licence shall be valid for one calendar year. (2) Upon expiration, a licence shall be renewed on- (a) payment of the prescribed fees; (b) payment of any outstanding amount due to the Authority; (c) the presentation of any other documents, returns or information which the Authority may require; and (d) the presentation of an acceptable appraisal report in the case of a Free Zone enterprise. 36. Premises A licensee shall enter into a lease agreement in respect of any parcel of land or prem- ises which the licensee proposes to hold."
    },
    {
      "provision_ref": "s37",
      "section": "37",
      "title": "Amendment, withdrawal, revocation and surrender",
      "content": "37. Amendment, withdrawal, revocation and surrender (1) Upon application ofa licensee, the Authority may amend its licence. (2) The Authority may withdraw or revoke a licence for non-compliance with the re- quirements of the licence. (3) A licensee may surrender a current licence at any time, in accordance with any conditions that may be imposed by the Authority."
    },
    {
      "provision_ref": "s38",
      "section": "38",
      "title": "Annulment of an operational licence",
      "content": "38. Annulment of an operational licence The operational licence of a licensee may be annulled if any of the following circum- stances are confirmed by an investigation carried out by the Authority- (a) where it is confirmed, through a written report that there has been an act con- trary to the provisions of the law, these Regulations, guidelines, circulars and directives issued by the Authority, which is detrimental to peace and order in the Free Zone; (b) where it is established that a licensee has evaded tax, such as the enjoyment of earnings accruing from business activities conducted in the Customs Territory; and (c) where it is established that a licensee has presented a forged document. (2) A licensee whose licence has been annulled shall forfeit the licence fee paid to the Authority. (3) A Free Zone enterprise, which carries on its activities in the Free Zone despite the expiration of or annulment of its operational licence shall be expelled from the Free Zone by the Nigeria Police or Free Zone Customs command, on the request of the Authority and the property of the affected licensee shall be confiscated."
    },
    {
      "provision_ref": "s39",
      "section": "39",
      "title": "Licence fees",
      "content": "39. Licence fees (1) A licensee shall pay its licence fees, in accordance with the tariffs prescribed by the Authority, from time to time. (2) The fee for amending a licence shall be as prescribed by the Authority. (3) An application by a licensee to amend the approved activities specified in a li- cence shall be deemed to be an application for a new licence and fees shall be charged as prescribed by the Authority. (4) The Authority reserves the right to review the tariffs for operations in the Free Zone, from time to time. PART IV Free Zone Enterpr i ses Proc e dures"
    },
    {
      "provision_ref": "s40",
      "section": "40",
      "title": "Formation of Free Zone enterprises",
      "content": "40. Formation of Free Zone enterprises (1) Any company or any other entity or person who desires to form a Free Zone en- terprise shall complete and submit to the Authority, the prescribed application form and a proposed business plan with all the necessary information and documentation. (2) The Authority may reject any application that fails to comply with the require- ments for the formation of Free Zone enterprises. (3) The Authority shall notify the applicant in writing of any decision made within 30 days of the receipt of the application. (4) The Authority may modify the requirements for the formation of a Free Zone enterprise. 4 1 . Iss u a nc e of ce r ti f ic at e (1) A successful applicant for the formation of a Free Zone enterprise shall, be issued with a certificate which shall contain, among other things, the date of registration, name of the enterprise and the seal of the Authority. (2) A Free Zone enterprise shall be deemed to be duly formed with effect from the date of registration thereof."
    },
    {
      "provision_ref": "s42",
      "section": "42",
      "title": "S",
      "content": "42. S h a r e c a pi ta l (1) The share capital of a Free Zone enterprise shall be- (a) denominated in either Nigerian official currency or any other international currency acceptable to the Authority; (b) divided into unit of shares as the Authority may, from time to time determine, and each unit of shares shall be evidenced by a share certificate; (c) paid in cash or by valuable assets. (2) Any transaction in shares or securities shall have prior approval of the Authority. (3) The share capital of a Free Zone enterprise may be altered by the owner's decla- ration, subject to the prior approval of the Authority and the details of the alteration shall be entered into the Free Zone enterprises register, maintained and kept by the Authority and shall take effect from the date of registration. (4) Any Free Zone enterprise, undertaking an approved activity in the Free Zone shall notify the Registrar of any purchase, assignment or transfer of shares in the enterprise, except where its shares are quoted and are transferable on any international Stock Exchange. 43. N a m e o f a Fr ee Z o ne ent e rpri se (1) The name of a Free Zone enterprise shall end with the initials \"FZE\" and shall not be registered in the Free Zone enterprises register with a name which is not approved by the Authority. (2) A Free Zone enterprise may change its name by th e owner's declaration, subject to the proposed name being approved by the Authority. (3) The new name of the Free Zone enterprise shall be entered into the Free Zone en- terprises register and a certificate of change of name issued by the Authority. (4) The certificate of change of name shall specify, among other things, the date of registration of the new name, the new name of the Free Zone enterprise and the seal of the Authority. 44 . Registered address of a Free Zone enterprise (1) A Free Zone enterprise shall at all times, have a registered address within the Free Zone to which all communication and notices shall be addressed. (2) The Authority shall be notified of any change of address within 14 days thereof. 45 . Sign-name plate A Free Zone enterprise shall affix and keep affixed, its sign-name plate in legible let- ters and in a conspicuous position, in the registered office or place of business in the Free Zone."
    },
    {
      "provision_ref": "s46",
      "section": "46",
      "title": "Correspondence",
      "content": "46. Correspondence , etc. A Free Zone enterprise shall have its name printed in legible letters in all business let- ters, notices and other official publications, including promissory notes, cheques, bills of exchange, orders for money, goods or services purported to be signed by or on behalf of the Free Zone enterprise and in all parcels, invoices, receipts, letters of credit and guarantees. PART V B a nkin g Pr oce du res 4 7. Banking activitie s in the Free Zone (1) Without prejudice to the Central Bank Act, the Authority may, permit a bank to maintain a branch in the Free Zone to offer banking services. [L.F.N. 2004 Cap. C4.] (2) A bank operating in the Free Zone shall not be entitled to any incentives granted to the Free Zone licensees, except the importation of any item to be consumed by the bank in the Free Zone as set out in the Act. (3) Any bank operating in the Free Zone shall comply with the Central Bank of Nigeria guidelines on offshore banking. (4) A Free Zone account shall be denominated in either Nigerian official currency or any other internationally acceptable currency to the Authority. PART VI H ea lth, Saf e t y a n d E n v i ronm e nt"
    },
    {
      "provision_ref": "s48",
      "section": "48",
      "title": "Management of health, safet",
      "content": "48. Management of health, safet y and environmental matters within the Fre e Z o n e (1) The Authority shall ensure that all Free Zone enterprises comply with all health, safety and environmental laws and regulations made thereunder. (2) Any incident involving loss and material damage or physical injury in the Free Zone shall be reported to the Authority as soon as practicable after the incident. PART VII Planning and Construction Procedures"
    },
    {
      "provision_ref": "s49",
      "section": "49",
      "title": "Acquisition of land",
      "content": "49. Acquisition of land (1) Without prej udice to the provisions of the Land Use Act, any land under the con- trol or management of the Nigerian Ports Authority shall be acquired, leased or trans- ferred to an investor by the Nigerian Ports Authority. [L.F.N. 2004 Cap. L5.] (2) An investor shall take lease from the Nigerian Ports Authority, in respect of any land situate in the Free Zone, but within the Ports Area and owned by the Nigerian Ports Authority, on the terms and conditions prescribed by the Nigerian Ports Authority. (3) An investor shall take lease from the Authority, in respect of any land outside the control or management of the Nigerian Ports Authority but situate within the Free Zone. (4) A Free Zone entity shall present to the Authority, a written report of any applica- tion for lease or acquisition of land in the Free Zone. PART VIII Miscellaneous"
    },
    {
      "provision_ref": "s50",
      "section": "50",
      "title": "Immigration procedures",
      "content": "50. Immigration procedures (1) Notwithstanding the provisions of the Immigration Act, any approved Free Zone entity, employing or engaging the services of any non-Nigerian shall, comply with the requirements set out by the Free Zone Immigration Command. (2) The Authority shall in consultation with the Free Zone Immigration Command, publish the guidelines and procedures on immigration matters applicable in the Free Zone. (3) The Authority shall make available, the guidelines and procedures mentioned in subregulation (2) of this regulation to the licensees. 51 . Guidelines The Authority shall publish or cause to be published all guidelines relating to admini- stration, management and operations of the Free Zone. 52 . Interpretation In these Regulations- \"Act\" means the Oil and Gas Export Free Zone Act, L.F.N. 2004 Cap. 05; \"applicant\" means an entity which has duly completed, signed and submitted an ap- plication form to the Authority; \"Authority\" means the Oil and Gas Export Free Zone Authority, established under section 2 of the Oil and Gas Export Free Zone Act, 1996; \" Bank \" means any institution, duly licensed in accordance with the Banking Act Cap. 28 L.F.N. to carry on banking business in Nigeria; \" bank pa y -in- s lip \" means a receipt, issued by a bank for payment made in respect of Customs duties and other import related levies and charges; \" circular \" means notices or any periodic information issued by the Authority, Gov- ernment or any of its agencies; \" countr y of origin \" means in the case of a foreign entity, a jurisdiction other than Nigeria and in the case of a domestic entity, the Free Zone and for the purposes of inspec- tion, the country of origin means the country of manufacture or last country where value was added to the goods; \" Cu s toms Bill of Entry \" means the form issued by the Nigeria Customs Service, for the purpose of the declaration of goods or single goods declaration; \"Delivery Order\" means a form issued by the Nigerian Ports Authority to the im- porter through the shipping line; \"domestic entity\" means any entity duly registered and licensed by the appropriate authorities to carry on business in Nigeria; \"Ex port Bill of Entry \" means a document issued by the Nigeria Customs Service for the purpose of exportation of goods; \"Ex port D ec laration \" means a document issued by the Nigeria Customs Service for the purpose of declaring goods for export; \" forei g n entit y\" means any entity duly registered and licensed by the appropriate authorities in its country of origin to carry on business anywhere, including Nigeria; \"F oreign T e rritor y\" means the Free Zone and any territory other than the Customs Territory; \" Form M \" means a document issued by the Central Bank of Nigeria for the purpose of importation of goods into Nigeria; \" Fr e e Zone \" means the area designated as a Free Zone by the President of the Fed- eral Republic of Nigeria; \"Free Zone circular\" means a notice issued or information disseminated by the Authority, from time to time; \" Free Zone Custom s Guarantee \" means a guarantee or bond issued by a bank or any other financial institution on behalf of a licensee and on the terms approved by the Authority and acceptable to the Free Zone Customs Command; \" lea se a greem e nt\" means a legal agreement in respect of land or property acquired in the Free Zone; \"licence\" means written permission granted by the Authority to a Free Zone entity to engage in an approved business or activity within the Free Zone; \"licence fee\" means a specified amount of money prescribed by the Authority and payable by the licensee to enable it to engage in an approved business in the Free Zone; \"licensee\" means an entity duly licensed to carry on an approved business in the Free Zone; \"Nigeria\" means the Federal Republic of Nigeria, excluding the Free Zone; \"Registrar\" means the Free Zone Registrar appointed by the Authority; \"Request for Release under Customs Duty Scheduling System\" means a document issued by the Authority to effect release of Free Zone goods under bank guarantee or bond; \"Request to Release\" means a document issued by the Authority for the purpose of effecting release of cargo to the owner; \"Request to Repair Free Zone Goods in Nigeria\" means a document issued by the Authority to effect release of Free Zone goods for the purposes of repairs in Nigeria; \"Request to Transfer under Customs Escort\" means a document issued by the Au- thority to the Nigeria Customs Service for the purposes of transferring Free Zone goods into the Free Zone; \"Terminal Operator\" means the authorised operator of the terminals in the Free Zone; \"Transfer Request\" means a document issued by the Authority for the purposes of the transfer of Free Zone goods to a dedicated Free Zone entity premises; \"Transfer Request Order\" means a transfer request form."
    },
    {
      "provision_ref": "s53",
      "section": "53",
      "title": "Citation",
      "content": "53. Citation These Regulations may be cited as the Oil and Gas Export Free Zone Regulations, 2003."
    }
  ],
  "definitions": [
    {
      "term": "Act",
      "definition": "the Oil and Gas Export Free Zones Act, 1996",
      "source_provision": "s2"
    },
    {
      "term": "customs territory",
      "definition": "the territory within the Federal Republic of Nigeria other than the area designated as the oil and gas free zone under the Act",
      "source_provision": "s2"
    },
    {
      "term": "free z one",
      "definition": "the oil and gas free zone designated under the Oil and Gas Export Free Zone Act",
      "source_provision": "s2"
    },
    {
      "term": "special product",
      "definition": "any article or item imported into the free zone on which value has been added without changing the essential character of the product after processing",
      "source_provision": "s2"
    },
    {
      "term": "value",
      "definition": "any additional process added on a product. Citation This Order may be cited as the Oil and Gas Export Free Zone (Special Import Provi- sions) Order 2003. OIL AND GAS EXPORT FREE ZONE REGULATIONS, 2003 ARRANGEMENT OF REGULATIONS PART I Ad mini s tr a ti o n and P owe r s of th e F r ee Zo n e REGULATION 1. Functions of the Free Zone Authority. Exemption from taxes, rates, etc. Incentives to Free Zone investors. Movement of goods in and out of the Free Zone. Processing of goods in the Free Zone. Registration of vehicles. Possession of driver's licence. Customs, Police and Immigration. Customs procedures. Security in the Free Zone. 11. Free Zone tariffs. 12. Applicable laws. 13. Arbitration and settlement of disputes. 14. Legal proceedings. 15. Restriction on non-Nigerian employee. 16. Health, safety and environmental control. PART II P roce dur es for Imp or tin g , Ex p o rtin g and M o v e m e n t of Goo d s General procedures for importing goods into the Free Zone. Procedures for importing goods into the Free Zone by sea. Procedures for importing goods into the Free Zone by air. Procedures for importing goods into the Free Zone by road. Cargo track inventory system. Exporting goods from the Free Zone into the Customs Territory. Customs Scheduling System. Exporting goods overseas by sea. REGULATION Export of goods overseas by air. Goods from the Customs Territory for repairs or maintenance in the Free Zone. Repairs and maintenance of goods in the Free Zone from the Customs Territory for export. Goods for repairs or maintenance in the Customs Territory from the Free Zone. Procedures for transferring goods between licensees. Procedures for transferring goods from a Free Zone to another. PART III Li ce n s in g of Bus in ess E ntiti es w ithin th e Free Zo n e Form of application for licence. Types of licences. Free Zone enterprise licence. Continuing obligations of a licensee. Renewal of licence. Premises. Amendment, withdrawal, revocation and surrender. Annulment of ",
      "source_provision": "s2"
    }
  ]
}