{
  "id": "statistics-act",
  "type": "statute",
  "title": "STATISTICS ACT",
  "title_en": "STATISTICS ACT",
  "short_name": "STATISTICS ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=494",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. Short title This Act may be cited as the Statistics Act."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "Interpretation In this Act, unless the context otherwise requires- \"Minister\" means the Minister charged with responsibility for matters relating to sta- tistics; \"Statistician\" means the Federal Government Statistician; \"statistics\" means information in connection with or incidental to all or any of the matters specified in the First Schedule. [First Schedule.] PART II F ederal statistics"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Application of Part to Federal statistics",
      "content": "Application of Part to Federal statistics The provisions of this Part shall apply to statistics relating to- (a) the Federal Capital Territory, Abuja; and (b) items contained in the Exclusive Legislative List."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Statistician's duty to supervise Federal statistics",
      "content": "Statistician's duty to supervise Federal statistics (1) Subject to the provision of the National Population Commission Act, it shall be the duty of the Statistician, subject to any direction by the Minister- [Cap. N67.] (a) to collect, compile, analyse and publish statistical information relating to the commercial, industrial, agricultural, mining, social, economic and general ac- tivities and conditions of the inhabitants of the Federation; (b) to collaborate with departments of the Government of the Federation, the States and with local authorities, in the collection, compilation, analysis and publication of statistical records of administrations and departments; and (c) generally, to organise a co-ordinated scheme of social and economic statistics relating to the Federation. (2) It shall be the duty of the Statistician to make such arrangements and to do all such things as are necessary for the performance of his duties in accordance with the pro- visions of this Part."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Collection and publication of Federal statistics",
      "content": "Collection and publication of Federal statistics (1) Subject to the provisions of this Act and with the approval of the Minister, there shall be collected, from time to time, statistics either in the Federation generally or in any part thereof. (2) The Statistician shall cause the statistics collected under this Part to be compiled, tabulated and analysed, and, subject to the provisions of this Act, may cause such statis- tics or abstracts thereof to be published, with or without comments thereon, in such man- ner as he may determine."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Power to obtain information",
      "content": "6. Power to obtain information (l) The Statistician may, for the purpose of subsection (1) of section 5 of this Act- (a) by notice in writing require any person to furnish, in such form and manner and within such time as may be specified in the notice, such periodical or other information, estimates or returns concerning such of the matters set out in the First Schedule as may be so specified; [First Schedule.] (b) by interviewing any person, require him to furnish particulars relating to any of such matters; (c) by notice in writing, require any person to complete a form contained in the notice with particulars relating to any of such matters and to return it in such manner and within such time as may be specified in the notice. (2) A notice referred to in subsection (1) of this section- (a) may be served by delivering it to the person to whom it is addressed or by sending it by registered post to his last known address; (b) shall state that it is served in exercise of the powers conferred by this section and shall include a general statement of the purpose for which the information, estimates, returns or particulars are required. (3) Where any information, estimates, returns or particulars have been required of any person by a notice purporting to be issued by the Statistician, it shall, in any legal proceedings relating thereto, be presumed until the contrary is proved- (a) that the information, estimates, returns or particulars were such as may law- fully be required of that person in accordance with the provisions of this Part; and (b) that the notice was duly served in accordance with paragraph (a) of subsec- tion (2) of this section. (4) When the person required to furnish information, estimates, returns or particulars in accordance with the provisions of this section is a company incorporated under the Companies and Allied Matters Act, the same shall be furnished by a person specifically authorised for the purpose by such company. [Cap. C20.j"
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Duty to make returns in respect of undertaking",
      "content": "Duty to make returns in respect of undertaking If the Statistician publishes, by notification in the Federal Gazette, and in such news- papers as may appear to him to be sufficient for notifying the persons concerned, or, if the Statistician is satisfied that local conditions so require it, in such other manner as may appear to him to be most suitable for such notification in the area or areas concerned, a list of any classes or descriptions of undertaking in relation to which returns will be re- quired for any of the purposes of this Part, it shall be the duty of every person carrying on an undertaking of any such class or description as aforesaid, who has not received a no- tice under paragraph (a) of subsection (1) of section 6 of this Act requiring him to furnish returns in relation to such undertaking, to inform such person as may be specified in the notification, within such period (being not less than 21 days after the date of publication by the particular method of notification adopted by the Statistician and applicable to such person) as may be specified therein, that he is carrying on such undertaking, and within the same or such further period as may be reasonable to give to that person such particu- lars of the undertaking as may be so specified."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Restriction on publication",
      "content": "Restriction on publication Except for the purposes of a prosecution under Part V of this Act- (a) no individual return, or part thereof, made for the purposes of this Part; (b) no answer given to any question put for the purposes of this Part; (c) no report, abstract or other document, containing particulars comprised in any such return or answer so arranged as to enable such particulars to be identified with any person, undertaking or business, shall be published, admitted in evidence or shown to any person not employed in the exe- cution of a duty under this Act, without the previous consent in writing thereto of the person making such return or giving such answer, or in the case of an undertaking or business, of the person who for the time being is the owner or person in charge or having the management or control of the undertaking or business: Provided that nothing in this section shall prevent or restrict the publication of any such report, abstract or other document without such consent where the particulars in such report, abstract or other document make identification possible merely by reason of the fact that the particulars relate to an undertaking or business which is the only under- taking or business or is one of only two undertakings or businesses within its or their par- ticular sphere of activities if such report, abstract or other document is so arranged as to disclose in respect of such undertaking or undertakings only the following information- (a) either the quantity or the value of any description of goods manufactured, pro- duced or exported or sold; and (b) the number and description of employees employed; and (c) any other information which has been furnished or supplied under this Part, to the publication of which no objection has been made in writing by the person furnishing or supplying such information prior to the publication of the report, abstract or other document."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Restrictions as to disclosure of information",
      "content": "9. Restrictions as to disclosure of information A person required under the provisions or this Part to furnish any information, esti- mates, returns or particulars, shall not be obliged to disclose any information or produce any document- (a) which he would not be compellable to disclose or produce if he were a witness in a court of law; or (b) which would involve the disclosure of any trade secret in or relating to any undertaking of which he is the owner or in the conduct or supervision of which he is engaged. PART III State jurisdiction as to statistics"
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "State statistics",
      "content": "10. State statistics In respect of matters not relating to a national census, and other than those referred to in paragraphs (a), (b) and (c) of subsection (1) of section 6 of this Act, the House of As- sembly of a State may provide for the collection, compilation, analysis and publication of statistics in such manner as it may think fit. [L.N. 112 of 1964.] PART IV General powers and procedure"
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Delegation of functions",
      "content": "11. Delegation of functions Subject to the approval of the Minister, and the Governor of the State in respect of any officer in the public service of a State, the Statistician may delegate in writing any of his powers and duties under this Act, and in such event in respect of any power or duty so delegated a reference in this Act to the Statistician shall be taken to include a reference to the officer to whom such delegation has taken place. [L.N. 112 of 1964.]"
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Oath of secrecy",
      "content": "12. Oath of secrecy Every person employed in the execution of any power or duty under this Act shall be- fore entering upon his duties make and subscribe an oath before a magistrate in the form set out in the Second Schedule to this Act. [Second Schedule.]"
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Unlawful disclosure",
      "content": "13. Unlawful disclosure (1) Any person, being a person employed for any of the purposes of this Act, who without lawful authority publishes or communicates to any person, otherwise than in the ordinary course of such employment, any information required by him in the course of his employment, shall be guilty of an offence and liable on conviction to a fine of #200 or to a term of imprisonment of one year, or to both such fine and such imprisonment. (2) Any person, being in possession of any information which to his knowledge has been disclosed in contravention of this Act, who publishes or communicates to any per- son such information, shall be guilty of an offence and liable on conviction to a fine of N 200 or to a term of imprisonment of one year, or to both such tine and such imprison- ment. (3) Any person who, in the execution of any other purpose or duty under this Act fails to comply with or contravenes any other term or condition of his oath shall be guilty of an offence and shall be liable on conviction to a fine of #200 or to a term of impris- onment of one year or to both such fine and imprisonment."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Penalties for failure to furnish information, etc.",
      "content": "14. Penalties for failure to furnish information, etc. (1) Any person. who is required to furnish information, estimates, returns or particu- lars under this Act and who fails to do so, shall be guilty of an offence and liable on con- viction to a tine of #50 or to imprisonment for three months, or to both such fine and imprisonment or in the case of a second or subsequent offence to a fine of # 100 or to imprisonment for six months, or to both such fine and imprisonment, but it shall be a de- fence for any person charged with failure to furnish information, estimates, returns or particulars under this Act to prove that he did not know and had no reasonable cause of knowing that he was required to give that information or those estimates, returns or par- ticulars or that he had other reasonable excuse for such failure. (2) Any person who after conviction in respect of an offence under subsection (1) of this section continues to fail to comply with the provisions of the subsection, shall be guilty of a further offence and may on conviction thereof be punished accordingly. (3) Any person who in purported compliance with a requirement to furnish informa- tion, estimates, returns or particulars under this Act knowingly or recklessly makes any statement in such information, estimates, returns or particulars which is false in any mate- rial particular, shall be guilty of an offence and shall be liable on conviction to a fine of N 100 or to imprisonment for six months, or to both such fine and imprisonment. (4) Where an offence under the provisions of subsection (1) of this section- (a) is committed by a body corporate, every director and officer of that body shall be liable on conviction to a fine of #500 each or to imprisonment for a term not exceeding three months, or to both such fine and imprisonment; (b) is committed by a firm, every partner shall be deemed jointly and severally liable on summary conviction to a fine of N200 each or to imprisonment of a term not exceeding three months or to both such fine and imprisonment. (5) A person shall not be guilty of an offence under subsection (3) of this section if he can prove that the offence was committed without his knowledge, consent or conniv- ance, and that having regard to all circumstances, he exercised all due care and diligence to prevent the commission of the offence."
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Penalty for destruction, etc., of documents",
      "content": "15. Penalty for destruction, etc., of documents Any person who wilfully and without lawful authority destroys, defaces or mutilates any schedule, form or other document containing information obtained in the pursuance of the provisions of this Act, shall be guilty of an offence and liable to a fine of N200 or to a term of imprisonment of one year, or to both such fine and such imprisonment."
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Amendment to First Schedule",
      "content": "16. Amendment to First Schedule The President may by order amend any item in the First Schedule to this Act or add any item thereto or delete any item there from. [First Schedule. L.N. 112 of 1964.]"
    },
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "Regulations",
      "content": "17. Regulations The President may make regulations for carrying into effect the purposes and provi- sions of this Act and, in particular, but without prejudice to the generality of the fore- going power, may make regulations prescribing- [L.N. 112 of 1964.] (a) the particulars and information to be furnished on the taking of a census or concerning any matter in respect of which statistics may be collected under the provisions of this Act; (b) the manner and form in which, the rimes and places at which, and the persons by whom such particulars and information shall be furnished; and (c) the fees and charges to be paid in respect of any special information or report supplied, or any special investigation carried out, by the Statistician. SCHEDULES FIRST SCHEDULE [Sections 2, 6 (1) and 16.] Statistical subjects [1989 No. 23.] I. Housing. Immigration and emigration. Internal and external trade. Primary and secondary production. Agriculture, livestock, horticulture and allied industries. Forestry. Fisheries. Factories, mines and productive industries generally. Employment and unemployment. Salaries, wages, bonuses, fees, allowances and any other payment and honoraria for services rendered. Income, earnings, profits and interest. Output, stocks, sales and deliveries and details, relating to services provided. Orders, work in progress, outgoings and costs (including work given out to contractors) and details of capital expenditure. Receipts outstanding, fixed capital assets and plant (including the acquisition and dis- posal of such assets and plant). Social, educational, labour and industrial matters, including associations of employers, employees and other persons generally. Industrial disturbances and disputes. Banking, insurance and finance generally. Commercial and professional undertakings. Distributive trades. Health. Transport and communication i~ a!l, forms by land, water or air. Wholesale and retail prices of commodities, rents and cost of living. Injuries, accidents and compensation. Land tenure, and the occupation and use of land. Local government. SECOND SCHEDULE [Section 12.] Form of oath I,..................................... .................................do swear that I will faithfully and honestly fulfil my duties as.................................................................. in conformity with the requirements of the Statistics Act and that save as provided in that Act I will not disclose or make known any matter or thing which comes to my knowledge by reason of such employment. SUBSIDIARY LEGIS LA TION No Subsidiary Legislation"
    }
  ],
  "definitions": [
    {
      "term": "Minister",
      "definition": "the Minister charged with responsibility for matters relating to sta- tistics",
      "source_provision": "s2"
    },
    {
      "term": "Statistician",
      "definition": "the Federal Government Statistician",
      "source_provision": "s2"
    },
    {
      "term": "statistics",
      "definition": "information in connection with or incidental to all or any of the matters specified in the First Schedule. [First Schedule.] PART II F ederal statistics",
      "source_provision": "s2"
    }
  ]
}