{
  "id": "supreme-court-act",
  "type": "statute",
  "title": "SUPREME COURT ACT",
  "title_en": "SUPREME COURT ACT",
  "short_name": "SUPREME COURT ACT",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=499",
  "provisions": [
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "Provisions applying to exercise of original jurisdiction",
      "content": "17. Provisions applying to exercise of original jurisdiction With respect to the exercise of the original jurisdiction conferred upon the Supreme Court by subsection (1) of section 232 of the Constitution or which may be conferred upon it in pursuance of section 232 (2) of the Constitution, the following provisions shall apply- (a) subject to the express provisions of any enactment, law and equity shall be administered concurrently; (b) in every cause or matter pending before it the Supreme Court shall grant, either absolutely or on such terms and conditions as the Court thinks just, all such remedies whatsoever as any of the parties thereto may appear to be entitled to in respect of any legal or equitable claim properly brought forward by them in the cause or matter, so that, as far as possible, all matters in controversy be- tween the parties may be completely and finally determined, and all multipli- city of legal proceedings concerning any of those matters avoided; (c) subject to the express provisions of any enactment, in all matters in which there was formerly or is any conflict or variance between the rules of equity and the rules of the common law with reference to the same matter, the rules of equity shall prevail; (d) in addition to any other powers conferred upon the Supreme Court by any en- actment, the Supreme Court shall have and may exercise all powers and authorities which are vested in or capable of being exercised by it under the Constitution; (e) the Supreme Court shall observe and enforce the observance of customary law to the same extent as such law is observed and enforced in the Nigerian courts."
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "Witnesses in causes heard in original jurisdiction",
      "content": "18. Witnesses in causes heard in original jurisdiction (1) For the purpose of any cause before the Supreme Court in its original jurisdiction the Court may require the attendance of persons to give evidence or to produce documents or both. (2) Any person present in court during the hearing of any such cause may, if the Court thinks tit, be ordered to give evidence or to produce documents. (3) A Justice of the Supreme Court, if it appears to him that the attendance of any person confined in any part of the Federation as a prisoner under any sentence or order or commitment for trial or otherwise, or under civil process, is necessary for the purpose of obtaining evidence in any such cause as aforesaid pending or to be inquired of in the court, may issue a warrant for bringing up the said person before the Court and the superintendent of the prison or other officer in whose custody the person is shall forthwith obey such warrant."
    },
    {
      "provision_ref": "s19",
      "section": "19",
      "title": "Power of transfer in certain",
      "content": "19. Power of transfer in certain cases (l) This section shall apply to any cause or matter which is in respect of any of the matters mentioned in section 232 (l) of the Constitution. (2) The Supreme Court may order any cause or matter which is before it to be transferred to a High Court or magistrate's court having ordinary jurisdiction in the place where the cause of action arose and power to grant the relief sought, for hearing and determining or to be otherwise disposed of by such court. (3) Where an Order of Transfer is made under subsection (2) of this section, the court to which the cause or matter is transferred shall have jurisdiction to hear and determine it, to the extent set out in the Order of Transfer, as if it were a cause or matter within the ordinary jurisdiction of that court. (4) A transfer under subsection (2) of this section may be ordered at any time and at any state of the proceedings in a cause or matter before final judgment, and either with or without application in that behalf by any of the parties thereto, and may apply to any cause or matter in its entirety or in respect of any part thereof or procedure required to be taken therein."
    },
    {
      "provision_ref": "s20",
      "section": "20",
      "title": "Proceedings between the Federation and States",
      "content": "20. Proceedings between the Federation and States Any proceedings before the Supreme Court arising out of a dispute referred to in section 232 (1) of the Constitution and brought by or against the Federation or a State shall- (a) in the case of the Federation be brought in the name of the Attorney-General of the Federation; (b) in the case of a State be brought in the name of the Attorney-General of the State. PART III Appeals in civil cases"
    },
    {
      "provision_ref": "s21",
      "section": "21",
      "title": "Application of Part III",
      "content": "21. Application of Part III (1) This Part shall apply to the exercise of the jurisdiction of the Supreme Court to hear appeals in civil cases. (2) Where in the exercise by the Court of Appeal of its jurisdiction an interlocutory order or decision is made in the course of any suit or matter an appeal shall, by leave of that Court or of the Supreme Court, as the case may be, lie to the Supreme Court; but no appeal shall lie from any order made ex parte, or by consent of the parties, or relating only to costs. (3) Nothing in subsection (2) of this section shall be construed so as to authorise an application to the Supreme Court in the first instance for leave to appeal from an inter- locutory order or decision made in the course of any suit or matter brought in the Court of Appeal."
    },
    {
      "provision_ref": "s22",
      "section": "22",
      "title": "General power of the Supreme Court",
      "content": "22. General power of the Supreme Court The Supreme Court may, from time to time, make any order necessary for determining the real question in controversy in the appeal, and may amend any defect or error in the record of appeal, and may direct the court below to inquire into and certify its findings on any question which the Supreme Court thinks fit to determine before final judg- ment in the appeal and may make an interim order or grant any injunction which the court below is authorised to make or grant and may direct any necessary inquiries or accounts to be made or taken and generally shall have full jurisdiction over the whole proceedings as if the proceedings had been instituted and prosecuted in the Supreme Court as a court of first instance and may rehear the case in whole or in part or may remit it to the court below for the purpose of such rehearing or may give such other directions as to the man- ner in which the court below shall deal with the case in accordance with the powers of that court."
    },
    {
      "provision_ref": "s23",
      "section": "23",
      "title": "Wrong ruling as to sufficiency of stamp",
      "content": "23. Wrong ruling as to sufficiency of stamp The Supreme Court shall not grant a new trial or reverse any judgment by reason of the ruling of any court that the stamp upon any judgment is sufficient or that the docu- ment does not require a stamp."
    },
    {
      "provision_ref": "s24",
      "section": "24",
      "title": "Stay of execution",
      "content": "24. Stay of execution An appeal under this Part shall not operate as a stay of execution, but the Supreme Court may order a stay of execution either unconditionally or upon the performance of such conditions as may be imposed in accordance with rules of court. PART IV Appeals in criminal cases from the Court of Appeal 25. Application of Part IV This Part shall apply to the exercise of the jurisdiction of the Supreme Court to hear appeals from decisions of the Court of Appeal in criminal proceedings in which an appeal has been brought to that Court from some other court."
    },
    {
      "provision_ref": "s26",
      "section": "26",
      "title": "Determination of an appeal",
      "content": "26. Determination of an appeal On the hearing of an appeal under this Part, the Supreme Court may exercise any power that could have been exercised by the Court of Appeal or may order the case to be retried by a court of competent jurisdiction. PART V Procedure"
    },
    {
      "provision_ref": "s27",
      "section": "27",
      "title": "Time for appealing",
      "content": "27. Time for appealing (1) Where a person desires to appeal to the Supreme Court he shall give notice of appeal or notice of his application for leave to appeal in such manner as may be directed by rules of court within the period prescribed by subsection (2) of this section that is applicable to the case. (2) The periods prescribed for the giving of notice of appeal or notice of application for leave to appeal are- (a) in an appeal in a civil case, fourteen days in an appeal against an interlocutory decision and three months in an appeal against a final decision; (b) in an appeal in a criminal case, thirty days from the date of the decision ap- pealed against. (3) Where an application for leave to appeal is made in the first instance to the court below, a person making such application shall, in addition to the period prescribed by subsection (2) of this section, be allowed a further period of fifteen days, from the date of the hearing of the application by the court below, to make an application to the Supreme Court. (4) The Supreme Court may extend the periods prescribed in subsection (2) of this section."
    },
    {
      "provision_ref": "s28",
      "section": "28",
      "title": "Legal assistance to appellant",
      "content": "28. Legal assistance to appellant The Supreme Court may at any time assign counsel to an appellant in any appeal or proceedings preliminary or incidental to an appeal in which, in the opinion of the court, it appears desirable in the interests of justice that the appellant should have legal aid, and that he has not sufficient means to enable him to obtain that aid."
    },
    {
      "provision_ref": "s29",
      "section": "29",
      "title": "Supplemental powers of court",
      "content": "29. Supplemental powers of court In the exercise of its appellate jurisdiction, the Supreme Court may, if it thinks it necessary or expedient in the interest of justice- (a) order the production of any document, exhibit, or other thing connected with the proceedings, the production of which appears to it necessary for the deter- mination of the case; and (b) order any of the witnesses who would have been compellable witnesses at the trial to attend and be examined before the Court, whether they were or were not called at the trial, or order the examination of any such witnesses to be conducted in manner provided by rules of court, or, in the absence of rules of court making provision on that behalf, as it may direct, before any judge of the Court or before any officer of the Court or other person appointed by the Court for the purpose, and allow the admission of any depositions so taken as evi- dence before the Court; and (c) receive the evidence, if tendered, of any witness (including the appellant) who is a competent but not compellable witness and, if the appellant makes an ap- plication for the purpose, of the husband or wife of the appellant, in cases where the evidence of the husband or wife could not have been given at the trial except on such an application; and (d) where any question arising on the appeal involves prolonged examination of documents or accounts, or any scientific or local investigation, which cannot in the opinion of the Court conveniently be conducted before the Court, order the reference of the question in manner provided by rules of court, or, in the ab- sence of rules of court making provision in that behalf, as it may direct, for en- quiry and report of any such commissioner appointed by the Court, and act upon the report of any such commissioner so far as it thinks fit to adopt it; and exercise in relation to the proceedings of the Court any other powers which may for the time being be prescribed by rules of court and issue any warrants necessary for enforcing the orders or sentence of the Court: Provided that in no case shall any sentence be increased by reason of or in consideration of any evidence that was not given at the trial."
    },
    {
      "provision_ref": "s30",
      "section": "30",
      "title": "Right of appellant to be present",
      "content": "30. Right of appellant to be present (l) On the hearing of an appeal in a criminal case an appellant, notwithstanding that he is in custody, shall be entitled to be present, if he desires it, except where the appeal is on some ground involving a question of law alone but, in that case, and on the application for leave to appeal and on any proceedings preliminary or incidental to an appeal, shall not be entitled to be present, except where rules of court provide that he shall have the right to be present or where the Supreme Court gives him leave to be present. (2) The power of the Supreme Court to pass any sentence under this Act may be exercised notwithstanding that the appellant is for any reason not present. (3) The right of an appellant who is in custody to be present at the hearing of his appeal shall be subject to his paying all expenses of and incidental to his transfer to and from the place where the Supreme Court sits for the determination of his appeal: Provided that the Court may direct that he be brought before the Court in any case where, in the opinion of the Court, his presence is advisable for the due determination of the appeal, in which event such expenses as aforesaid shall be defrayed out of the Consolidated Revenue Fund. (4) An appellant who does not appear at the hearing of his appeal or application for leave to appeal by counsel may present his appeal and argument in writing, and any ap- peal or argument so presented shall be considered by the Supreme Court."
    },
    {
      "provision_ref": "s31",
      "section": "31",
      "title": "Admission of appellant to bail, and date of sentence",
      "content": "31. Admission of appellant to bail, and date of sentence (1) The Supreme Court may, if it thinks fit, on the application of an appellant admit the appellant to bail pending the determination of his appeal. (2) The time during which an appellant, pending the determination of his appeal, is admitted to bail shall not count as part of any term of imprisonment under his sentence and, any imprisonment under the sentence of an appellant, whether it is the sentence passed by the court of trail or the sentence passed by the Court of Appeal or the sentence of the Supreme Court, shall, subject to any directions which may be given by the Court, be deemed to be resumed or to begin to run, as the case requires, from the day on which he is received into prison under the sentence. (3) In any case in which the appellant has received special treatment pending the hearing of his appeal in accordance with the provisions of any law relating to prisons, the Supreme Court shall fix the day from which the sentence shall be deemed to begin to run."
    },
    {
      "provision_ref": "s32",
      "section": "32",
      "title": "Procedure with respect to frivolous appeals on question of law",
      "content": "32. Procedure with respect to frivolous appeals on question of law If it appears to the Registrar that any notice of an appeal against a conviction purporting to be on a ground of appeal which involves a question of law alone, does not show any substantial ground of appeal, the Registrar may refer the appeal to any Justice of the Supreme Court and such Justice may if he is of the same opinion, direct the Regis- trar to refer the appeal to the Supreme Court for summary determination, and, when the case is so referred, the Court may, if it considers that the appeal is frivolous or vexatious, and can be determined without adjourning the same for a full hearing, dismiss the appeal summarily, without calling on any person to attend the hearing or to appear for the Gov- ernment thereon. PART VI Miscellaneous and repeals"
    },
    {
      "provision_ref": "s33",
      "section": "33",
      "title": "Power to send back a case for amendment",
      "content": "33. Power to send back a case for amendment The Supreme Court, when a question as to the interpretation of the Constitution has been referred to that Court under section 233 of the Constitution, may cause the case to be sent back for amendment and judgment shall be delivered after it has been amended. SUBSIDIARY LEGISLATION No Subsidiary Legislation"
    }
  ],
  "definitions": []
}