{
  "id": "united-nations-convention-on-carriage-of-goods-by-sea-ratification-and-enforceme",
  "type": "statute",
  "title": "UNITED NATIONS CONVENTION ON CARRIAGE OF GOODS BY SEA (RATIFICATION AND ENFORCEMENT) ACT",
  "title_en": "UNITED NATIONS CONVENTION ON CARRIAGE OF GOODS BY SEA (RATIFICATION AND ENFORCEMENT) ACT",
  "short_name": "UNITED NATIONS CONVENTION ON CARRIAGE",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://placng.org/lawsofnigeria/view2.php?sn=546",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Enforcement of the United Nations Convention on Carriage of Goods by Sea",
      "content": "Enforcement of the United Nations Convention on Carriage of Goods by Sea As from the commencement of this Act, the provisions of the United Nations Convention on Carriage of Goods by Sea which are set out in the Schedule to this Act shall, subject as there under provided, have force of law and shall be given full recognition and effect and be applied by all authorities and persons exercising legislative, executive and judicial powers in the Federal Republic of Nigeria. [Schedule.]"
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Short title",
      "content": "2. Short title This Act may be cited as the United Nations Convention on Carriage of Goods by Sea (Ratification and Enforcement) Act, 2005. SCHEDULE [Section 1] 11.5.220 (The Hamburg Rules, 1978) United Nations Convention on the Carriage of Goods by Sea, 1978 The State Parties to this Convention, HAVING RECOGNlSED the desirability of determining by agreement certain rules relating to the carriage of goods by sea. HAVE DECIDED to conclude a Convention for this purpose and have thereto agreed as follows- PART I General Provisions ARTICLE 1 Definitions In this Convention- 1. \"Carrier\" means any person by whom or in whose name a contract of carriage of goods by sea has been concluded with a shipper. 2. \"Actual carrier\" means any person to whom the performance of the carriage of the goods, or of part of the carriage, has been entrusted by the carrier, and includes any other person to whom such performance has been entrusted. 3 . \"Shipper\" means any person by whom or in whose name or on whose behalf a contract of carriage of goods by sea has been concluded with a carrier, or any person by whom or in whose name or on whose behalf the goods are actually delivered to the carrier in relation to the contract of carriage by sea."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "\"Consignee\"",
      "content": "\"Consignee\" means the person entitled to take delivery of the goods."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "\"Goods\"",
      "content": "\"Goods\" includes live animals; where the goods are consolidated in a container, pallet or similar article of transport or where they are packed, \"goods\" includes such article of transport or packaging if supplied by the shipper. 6 . \"Contract of carriage by sea\" means any contract whereby the carrier undertakes against payment of freight to carry goods by sea from one port to another; however, a contract which involves carriage by sea and also carriage by some other means is deemed to be a contract of carriage by sea for the purposes of this Convention only in so far as it relates to the carriage by sea. 7. \"Bill of lading\" means a document which evidences a contract of carriage by sea and the taking over or loading of the goods by the carrier, and by which the carrier undertakes to deliver the goods against surrender of the document. A provision in the document that the goods are to be delivered to the order of a named person, or to order, or to bearer, constitutes such an undertaking."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "\"Writing\"",
      "content": "8. \"Writing\" includes, inter alia, telegram and telex. ARTICLE 2 Scope of Ap plication 1. The provisions of this Convention are applicable to all contracts of carriage by sea between two different States, if- (a) the port of loading as provided for in the contract of carriage by sea is located in a Contracting State; or (b) the port of discharge as provided for in the contract of carriage by sea is located in a Contracting State; or (c) one of the optional ports of discharge provided for in the contract of carriage by sea is the actual port of discharge and such port is located in a Contracting State; or (d) the bill of lading or other document evidencing the contract of carriage by sea is issued in a Contracting State; or (e) the bill of lading or other document evidencing the contract of carriage by sea provides that the provisions of this Convention or the legislation of any State giving effect to them are to govern the contract. 2 . The provisions of this Convention are applicable without regard to the nationality of the ship, the carrier, the actual carrier, the shipper, the consignee or any other interested person. 3. The provisions of this Convention are not applicable to charter-parties. However, where a bill of lading is issued pursuant to a charter-party, the provisions of the Convention apply to such a bill of lading if it governs the relation between the carrier and the holder of the bill of lading, not being the charterer. 4. If a contract provides for future carriage of goods in a series of shipments during an agreed period, the provisions of this Convention apply to each shipment. However, where a shipment is made under a charter-party, the provisions of paragraph 3 of this Article apply. ARTICLE 3 Interpretation of the Convention In the interpretation and application of the provisions of this Convention regard shall be had to its international character and to the need to promote uniformity. PART II Liability of the Carrier ARTICLE 4 Period of Responsibility 1. The responsibility of the carrier for the goods under this Convention covers the period during which the carrier is in charge of the goods at the port of loading, during the carriage and at the port of discharge. 2. For the purpose of paragraph 1 of this Article, the carrier is deemed to be in charge of the goods- (a) from the time he has taken over the goods from- (i) the shipper, or a person acting on his behalf; or (ii) an authority or other third party to whom, pursuant to law or regulations applicable at the port of loading, the goods must be handed over for the shipment; (b) until the time he has delivered the goods- (i) by handing over the goods to the consignee; or (ii) in cases where the consignee does not receive the goods from the carrier, by placing them at the disposal of the consignee in accordance with the contract or with the law or with the usage of the particular trade, applicable at the port of discharge; or (iii) by handing over the goods to an authority or other third party to whom, pursuant to law or regulations applicable at the port of discharge, the goods must be handed over. 3 . In paragraphs 1 and 2 of this Article, reference to the carrier or to the consignee means, in addition to the carrier or the consignee, the servants or agents, respectively of the carrier or the consignee. ARTICLES Basis of Liability l. The carrier is liable for loss resulting from loss of or damage to the goods, as well as from delay in delivery, if the occurrence which caused the loss, damage or delay took place while the goods were in his charge as defined in Article 4, unless the carrier proves that he, his servants or agents took all measures that could reasonably be required to avoid the occurrence and its consequences. 2 . Delay in delivery occurs when the goods have not been delivered at the port of discharge provided for in the contract of carriage by sea within the time expressly agreed upon or, in the absence of such agreement, within the time which it would be reasonable to require of a diligent carrier, having regard to the circumstances of the case. 3 . The person entitled to make a claim for the loss of goods may treat the goods as lost if they have not been delivered as required by Article 4 within 60 consecutive days following the expiry of the time for delivery according to paragraph 2 ofthis Article. 4 . (a) The carrier is liable- (i) for loss of or damage to the goods or delay in delivery caused by fire, if the claimant proves that the fire arose from fault or neglect on the part of the carrier, his servants or agents; (ii) for such loss, damage or delay in delivery which is proved by the claimant to have resulted from the fault or neglect of the carrier, his servants or agents, in taking all measures that could reasonably be required to put out the fire and avoid or mitigate its consequences. (b) In case of fire on board the ship affecting the goods, if the claimant or the carrier so desires, a survey in accordance with shipping practices must be held into the cause and circumstances of the fire, and a copy of the surveyor's report shall be made available on demand to the carrier and the claimant. 5 . With respect to live animals, the carrier is not liable for loss, damage or delay in delivery resulting from any special risks inherent in that kind of carriage. I f the carrier proves that he has complied with any special instructions given to him by the shipper respecting the animals and that, in the circumstances of the case, the loss, damage or delay in delivery could be attributed to such risks, it is presumed that the loss, damage or delay in delivery was so caused, unless there is proof that all or a part of the loss, damage or delay in delivery resulted from fault or neglect on, the part of the carrier, his servants or agents. 6 . The carrier is not liable, except in general average, where loss, damage or delay in delivery resulted from measures to save life or from reasonable measures to save property at sea. 7. Where fault or neglect on the part of the carrier, his servants or agents combines with another cause to produce loss, damage or delay in delivery the carrier is liable only to the extent that the loss, damage or delay in delivery is attributable to such fault or neglect, provided that the carrier proves the amount of the loss, damage or delay in delivery not attributable thereto. ARTICLE 6 Limits of Liability 1 . (a) The liability of the carrier for loss resulting from loss of or damage to goods according to the provisions of Article 5 is limited to an amount equivalent to 835 units of account per package or other shipping unit or 2.5 units of account per kilogramme of gross weight of the goods lost or damaged, whichever is the higher. (b) The liability of the carrier for delay in delivery according to the provisions of Article 5 is limited to an amount equivalent to two and a half times the freight payable for the goods delayed, but not exceeding the total freight payable under the contract of carriage of goods by sea. (c) In no case shall the aggregate liability of the carrier, under both subparagraphs (a) and (b) of this paragraph, exceed the limitation which would be established under sub- paragraph (a) of this paragraph for total loss of the goods with respect to which such liability was incurred. 2. For the purpose of calculating which amount is the higher in accordance with paragraph 1 (a) of this Article, the following rules apply: (a) Where a container, pallet or similar article of transport is used to consolidate goods, the package or other shipping units enumerated in the bill of lading, if issued, or otherwise in any other document evidencing the contract of carriage by sea, as packed in such article of transport are deemed packages in shipping units. Except as aforesaid the goods in such article of transport are deemed one shipping unit. (b) In cases where the article of transport itself has been lost or damaged, that Article o"
    }
  ],
  "definitions": []
}